pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
/*******************************************************************************
 **+--------------------------------------------------------------------------+**
 **|                                                                          |**
 **|         Copyright (c) 2012 Texas Instruments Incorporated                |**
 **|                        ALL RIGHTS RESERVED                               |**
 **|                                                                          |**
 **| Permission is hereby granted to licensees of Texas Instruments           |**
 **| Incorporated (TI) products to use this computer program for the sole     |**
 **| purpose of implementing a licensee product based on TI products.         |**
 **| No other rights to reproduce, use, or disseminate this computer          |**
 **| program, whether in part or in whole, are granted.                       |**
 **|                                                                          |**
 **| TI makes no representation or warranties with respect to the             |**
 **| performance of this computer program, and specifically disclaims         |**
 **| any responsibility for any damages, special or consequential,            |**
 **| connected with the use of this program.                                  |**
 **|                                                                          |**
 **+--------------------------------------------------------------------------+**
 *******************************************************************************/
/**
 * @file        sl_selftest.c
 * @version     2.2.0
 * @brief       File contains the Self Test APIs
 *
 * @details The file implements the  api's for carrying out selftests and fault injection tests on/n
 * all the peripherals (includes Safety island peripherals also).The utility functions or/n
 * support functions which are used by this file are defined in either sl_misc.c or/n
 * sl_priv.c
 */

/* Comments regarding various justificatios for deviation from MISRA-C coding guidelines
 * are provided at the bottom of the file */

#include <sl_api.h>
#include <sl_priv.h>
#define FLASH_DIAG_MODE_ENABLED 0x5U


/*SAFETYMCUSW 69 S MR:3.4 <APPROVED> Comment_1*/
#ifdef __TI_COMPILER_VERSION__
/* 16 byte alignment is required to ensure that the starting address is always an even bank */
#pragma DATA_ALIGN(sramEccTestBuff, 16);
#endif
#ifdef __IAR_SYSTEMS_ICC__
#pragma data_alignment=16
#endif
volatile uint64 sramEccTestBuff[4] = {0x0u};

/*SAFETYMCUSW 69 S MR:3.4 <APPROVED> Comment_2*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_SelfTest_SRAM(SL_SelfTestType testType, boolean bMode, SL_SelfTest_Result * sram_stResult)
{
    volatile boolean _sl_fault_injection = FALSE;
    boolean retVal = FALSE;
    volatile uint32 ramRead, regBkupIntEnaSet, regBckupErrInfulence;

	volatile uint64* eccB1;
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
	volatile uint32 regBkupRamTh1, regBkupRamTh2;
	volatile uint64* eccB2;
#endif
	volatile uint32 irqStatus;
	register uint32 tempVal;
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    register uint64 ramread64;
    uint32 ram1uerraddr,ram2uerraddr;
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Start_Profiling(testType);
#endif


#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    /* If fault inject set global variable to flag to the ESM handler that it is a fault injection */
    if((SRAM_ECC_2BIT_FAULT_INJECT == testType)||
        (SRAM_ECC_1BIT_FAULT_INJECTION == testType)||
        (SRAM_ECC_ERROR_PROFILING_FAULT_INJECT == testType)){
        _sl_fault_injection=TRUE;
    }
#endif
#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /* Verify that the parameters are in range */
    /*LDRA_INSPECTWINDOW 50 */
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    if ((_SELFTEST_SRAMECC_MIN > testType) || (_SELFTEST_SRAMECC_MAX < testType) ||
            !CHECK_RANGE_RAM_PTR(sram_stResult)) {
        SL_Log_Error(FUNC_ID_ST_SRAM, ERR_TYPE_PARAM, 0U);
        return(FALSE);
    }
#endif
#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /* Error if not in privilege mode */
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_SRAM, ERR_TYPE_ENTRY_CON, 2U);
        return(FALSE);
    }
#endif

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    /* For MISRA C fix for LDRA - 408S*/
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    uint32 tmpRAMCTRL1=sl_tcram1REG->RAMCTRL;
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    uint32 tmpRAMCTRL2=sl_tcram2REG->RAMCTRL;
#endif

#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        uint32 tmpRAMCTRL=sl_l2ramwREG->RAMCTRL;
#endif

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    /* Error if ECC is not enabled */
    if ((SRAM_PAR_ADDR_CTRL_SELF_TEST == testType)
            && (((SRAM_ADDR_PARITY_DISABLED) == BF_GET(tmpRAMCTRL1, TCRAM_RAMCTRL_ADDRPARDIS_START, TCRAM_RAMCTRL_ADDRPARDIS_LEN))
                || ((SRAM_ADDR_PARITY_DISABLED) == BF_GET(tmpRAMCTRL2, TCRAM_RAMCTRL_ADDRPARDIS_START, TCRAM_RAMCTRL_ADDRPARDIS_LEN)))) {
        SL_Log_Error(FUNC_ID_ST_SRAM, ERR_TYPE_ENTRY_CON, 1U);
        return(FALSE);
    }
    if(((SRAM_ECC_ERROR_FORCING_1BIT == testType)||
            (SRAM_ECC_ERROR_FORCING_2BIT == testType)||
            (SRAM_RADECODE_DIAGNOSTICS == testType)) &&
             (((SRAM_ECC_DISABLED) == BF_GET(tmpRAMCTRL1, TCRAM_RAMCTRL_ECC_DET_EN_START, TCRAM_RAMCTRL_ECC_DET_EN_LEN))
                 ||((SRAM_ECC_DISABLED) == BF_GET(tmpRAMCTRL2, TCRAM_RAMCTRL_ECC_DET_EN_START, TCRAM_RAMCTRL_ECC_DET_EN_LEN)))) {
        SL_Log_Error(FUNC_ID_ST_SRAM, ERR_TYPE_ENTRY_CON, 1U);
        return(FALSE);
    }

    /* If nERROR is active then do not proceed with tests that trigger nERROR */
    if((TRUE) == SL_ESM_nERROR_Active()){
        SL_Log_Error(FUNC_ID_ST_SRAM, ERR_TYPE_ENTRY_CON, 3U);
        return(FALSE);
    }
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
    /* Error if ECC is not enabled */
    if(((SRAM_ECC_ERROR_FORCING_1BIT == testType)||
            (SRAM_ECC_ERROR_FORCING_2BIT == testType)) &&
             ((SRAM_ECC_DISABLED) == BF_GET(tmpRAMCTRL, L2RAM_RAMCTRL_ECC_DETECT_EN_START, L2RAM_RAMCTRL_ECC_DETECT_EN_LENGTH)))
    {
        SL_Log_Error(FUNC_ID_ST_SRAM, ERR_TYPE_ENTRY_CON, 1U);
        return(FALSE);
    }

    /* If nERROR is active then do not proceed with tests that trigger nERROR */
    if((TRUE) == SL_ESM_nERROR_Active())
    {
        SL_Log_Error(FUNC_ID_ST_SRAM, ERR_TYPE_ENTRY_CON, 3U);
        return(FALSE);
    }
#endif

    retVal = TRUE;      /* Function executed successfully */

