pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    regBkupRamTh1 = sl_tcram1REG->RAMTHRESHOLD;
    regBkupRamTh2 = sl_tcram2REG->RAMTHRESHOLD;
#endif

    /* False warning */
    switch(testType) {

case SRAM_ECC_ERROR_FORCING_2BIT:
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    case SRAM_ECC_2BIT_FAULT_INJECT:
        /* Read-unlock the error addresses for subsequent captures */
        ramRead= sl_tcram1REG->RAMUERRADDR;
        ramRead= sl_tcram2REG->RAMUERRADDR;
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        /* Clear any previous diagnostic errors status bits [22,21,20,19,12,11,10, 4] - required before trigger */
        BIT_SET(sl_l2ramwREG->RAMERRSTATUS, L2RAM_RAMERRSTATUS_CLRALL);
#endif

        /*SAFETYMCUSW 45 D MR:21.1 <APPROVED> Comment_6*/
        sramEccTestBuff[2] = 0U;
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /*SAFETYMCUSW 45 D MR:21.1 <APPROVED> Comment_6*/
        sramEccTestBuff[3] = 0U;
#endif
        /*SAFETYMCUSW 45 D MR:21.1 <APPROVED> Comment_7*/
        /*SAFETYMCUSW 134 S MR:12.2 <APPROVED> Comment_8*/
        /*SAFETYMCUSW 344 S MR:11.5 <APPROVED> Comment_9*/
        eccB1 = &sramEccTestBuff[2];
        eccB1 += (0x00400000u/sizeof(uint64));
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /*SAFETYMCUSW 45 D MR:21.1 <APPROVED> Comment_7*/
        /*SAFETYMCUSW 134 S MR:12.2 <APPROVED> Comment_8*/
        /*SAFETYMCUSW 344 S MR:11.5 <APPROVED> Comment_9*/
        eccB2 = &sramEccTestBuff[3];
        eccB2 += (0x00400000u/sizeof(uint64));

        /* Enable Writes to ECC RAM */
        /*SAFETYMCUSW 9 S MR: 12.2 <APPROVED> Comment_10*/
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        BIT_SET(sl_tcram1REG->RAMCTRL,TCRAM_RAMCTRL_ECCWREN);

        /*SAFETYMCUSW 9 S MR: 12.2 <APPROVED> Comment_10*/
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        BIT_SET(sl_tcram2REG->RAMCTRL,TCRAM_RAMCTRL_ECCWREN);

        /* cause a 2-bit ECC error */
        /* Flip 2 bits, this flip in ECC works as 2 bit error when the data part used for ECC is zero*/
        /*SAFETYMCUSW 45 D MR:21.1 <APPROVED> Comment_7*/
        *eccB1 ^= TCRAM_SYN_2BIT_DATA_ECC;
        _SL_Barrier_Data_Access();
        /*SAFETYMCUSW 45 D MR:21.1 <APPROVED> Comment_7*/
        *eccB2 ^= TCRAM_SYN_2BIT_DATA_ECC;
        _SL_Barrier_Data_Access();
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)

        /* Write test vectors */

		sl_l2ramwREG->DIAGDATAVECTOR_H = BF_GET((sramEccTestBuff[2]), 32, 32);
		sl_l2ramwREG->DIAGDATAVECTOR_L = BF_GET((sramEccTestBuff[2]), 0, 32);
        sl_l2ramwREG->DIAG_ECC = (*eccB1) ^ L2RAM_SYN_2BIT_DATA_ECC;

#endif

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        ramRead = sl_tcram1REG->RAMCTRL;
        /*flag is set to indicate the current test which is ongoing and
        These flags are used in the sl_esm.c so as to mask the esm callback*/
        if(SRAM_ECC_2BIT_FAULT_INJECT == testType)
        {
        	SL_FLAG_SET(SRAM_ECC_2BIT_FAULT_INJECT);
        }
        else
#endif
        {
        	SL_FLAG_SET(SRAM_ECC_ERROR_FORCING_2BIT);
        }

#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        _SL_Barrier_Data_Access();

        /* Set the self test flag for a self test to indicate the esm handler that this is done as a part of selftest */
        /* read from location with 2-bit ECC error this will cause a data abort to be generated */
        /*SAFETYMCUSW 446 S MR:10.1 <APPROVED> Comment_11*/
        ramread64 = sramEccTestBuff[2];
        _SL_Barrier_Data_Access();
        /* Restore ctrl registers */
        sl_tcram1REG->RAMCTRL &= ~TCRAM_RAMCTRL_ECCWREN;

        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        ramRead = sl_tcram2REG->RAMCTRL;
        /* Set the self test flag for a self test to indicate the esm handler that this is done as a part of selftest */
        /*SAFETYMCUSW 446 S MR:10.1 <APPROVED> Comment_11*/
        ramread64 = sramEccTestBuff[3];
        _SL_Barrier_Data_Access();
        /* Restore ctrl registers */
        sl_tcram2REG->RAMCTRL &= ~TCRAM_RAMCTRL_ECCWREN;

        if(SRAM_ECC_ERROR_FORCING_2BIT == testType){
            ram1uerraddr=sl_tcram1REG->RAMUERRADDR;
            ram2uerraddr=sl_tcram2REG->RAMUERRADDR;
            /*the esm interrupts for selftests which generate group 1 interrupts is blocked.Users will have to rely on
            status functions to get the pass/failure information*/
            /* Check the error status on both banks */
    		/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
            /*SAFETYMCUSW 134 S MR:12.2 <APPROVED> Comment_8*/
            /*SAFETYMCUSW 344 S MR:11.5 <APPROVED> Comment_9*/
    		/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_1"*/
            /*SAFETYMCUSW 134 S MR:12.2 <APPROVED> Comment_8*/
            /*SAFETYMCUSW 344 S MR:11.5 <APPROVED> Comment_9*/
            /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
            /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
            if ((((uint32)&sramEccTestBuff[2] & TCRAM_RAMUERRADDR_UNC_ERRADD) == ram1uerraddr)
            		&& (((uint32)&sramEccTestBuff[3] & TCRAM_RAMUERRADDR_UNC_ERRADD) == (ram2uerraddr)) &&
                    ((1 << ESM_G3ERR_B1TCM_ECC_UNCORR) == (sl_esmREG->SR1[2] & (1u << ESM_G3ERR_B1TCM_ECC_UNCORR)))&&
                    ((1 << ESM_G3ERR_B0TCM_ECC_UNCORR) == (sl_esmREG->SR1[2] & (1u << ESM_G3ERR_B0TCM_ECC_UNCORR)))) {
                *sram_stResult = ST_PASS;
            } else {
                *sram_stResult = ST_FAIL;
            }
            /* Clear nError */
            _SL_HoldNClear_nError();
            /* Clear the ESM Status */
            sl_esmREG->SR1[2] = ((1u << ESM_G3ERR_B0TCM_ECC_UNCORR) | (1u << ESM_G3ERR_B1TCM_ECC_UNCORR));
            /* Clear double bit error anyways */
            sl_tcram1REG->RAMERRSTATUS |= TCRAM_RAMERRSTATUS_DER;
            sl_tcram2REG->RAMERRSTATUS |= TCRAM_RAMERRSTATUS_DER;
            /* Compute uncorrupted ECC */
            sramEccTestBuff[2] = 0u;
            sramEccTestBuff[3] = 0u;
        }
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)

