pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
        /* Equality check test */
        sl_l2ramwREG->RAMTEST = (uint32) 0x0000008Au; /* 1->Trigger, 8->Eq., test mode, A->Test enable */
        BIT_SET(sl_l2ramwREG->RAMTEST, L2RAM_RAMTEST_TST_TRIGGER);

        /* Wait for the test to complete */
        /*SAFETYMCUSW 28 D <APPROVED> Comment_13*/
        while (L2RAM_RAMTEST_TST_TRIGGER == (sl_l2ramwREG->RAMTEST & L2RAM_RAMTEST_TST_TRIGGER));

        if(SRAM_ECC_ERROR_FORCING_2BIT == testType)
        {
            /* Check if the diagnostic error status bits have been set */
            if((1 << ESM_G2ERR_L2RAMW_UNCORR_B) == ((sl_esmREG->SSR2 & (1u << ESM_G2ERR_L2RAMW_UNCORR_B))) &&
                    ((sl_l2ramwREG->RAMERRSTATUS & (1 << L2RAM_RAMERRSTATUS_DRDE)) == (1 << L2RAM_RAMERRSTATUS_DRDE)) &&
                    ((sl_l2ramwREG->RAMERRSTATUS & (1 << L2RAM_RAMERRSTATUS_DWDE)) == (1 << L2RAM_RAMERRSTATUS_DWDE)))
            {
                *sram_stResult = ST_PASS;
            }
            else
            {
                *sram_stResult = ST_FAIL;
            }
            /* Clear any previous diagnostic errors status bits [22,21,20,19,12,11,10, 4] - required before trigger */
            BIT_SET(sl_l2ramwREG->RAMERRSTATUS, L2RAM_RAMERRSTATUS_CLRALL);
            _SL_HoldNClear_nError(); /* Clear nError */
        }

#endif
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /*clear the flags which indicate tests ongoing*/
		if(SRAM_ECC_2BIT_FAULT_INJECT == testType)
		{
		   /*clear the flags which indicate tests ongoing*/
			SL_FLAG_CLEAR(SRAM_ECC_2BIT_FAULT_INJECT);
		}
		else
#endif
		{
		   /*clear the flags which indicate tests ongoing*/
			SL_FLAG_CLEAR(SRAM_ECC_ERROR_FORCING_2BIT);
		}
        break;

    case SRAM_ECC_ERROR_FORCING_1BIT:
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    case SRAM_ECC_1BIT_FAULT_INJECTION:
    case SRAM_ECC_ERROR_PROFILING:
    case SRAM_ECC_ERROR_PROFILING_FAULT_INJECT:
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        /* Clear any previous diagnostic errors status bits [22,21,20,19,12,11,10, 4] - required before trigger */
        BIT_SET(sl_l2ramwREG->RAMERRSTATUS, L2RAM_RAMERRSTATUS_CLRALL);
#endif

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /*Backup grp1 esm interrupt enable register and clear the interrupt enable */
        /*the esm interrupts for selftests which generate group 1 interrupts is blocked.Users will have to rely on
        status functions to get the pass/failure information*/
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        regBkupIntEnaSet = sl_esmREG->IESR1;
        regBckupErrInfulence = sl_esmREG->EEPAPR1;
         if((SRAM_ECC_ERROR_FORCING_1BIT == testType)||(SRAM_ECC_ERROR_PROFILING == testType)){
             sl_esmREG->IECR1 = GET_ESM_BIT_NUM(ESM_G1ERR_B0TCM_CORRERR)|
                                 GET_ESM_BIT_NUM(ESM_G1ERR_B1TCM_CORRERR);
             sl_esmREG->DEPAPR1 = GET_ESM_BIT_NUM(ESM_G1ERR_B0TCM_CORRERR)|
                                 GET_ESM_BIT_NUM(ESM_G1ERR_B1TCM_CORRERR);

         }
#endif

        sramEccTestBuff[0] = 0U;
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        sramEccTestBuff[1] = 0U;
        uint8 testIterations=1u;
#endif
        /*SAFETYMCUSW 134 S MR:12.2 <APPROVED> Comment_8*/
        /*SAFETYMCUSW 344 S MR:11.5 <APPROVED> Comment_9*/
		eccB1 = &sramEccTestBuff[0];
        eccB1 += (0x00400000u/sizeof(uint64));

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /*SAFETYMCUSW 134 S MR:12.2 <APPROVED> Comment_8*/
        /*SAFETYMCUSW 344 S MR:11.5 <APPROVED> Comment_9*/
		eccB2 = &sramEccTestBuff[1];
        eccB2 += (0x00400000u/sizeof(uint64));

        /* Enable Writes to ECC RAM */
        /*SAFETYMCUSW 9 S MR: 12.2 <APPROVED> Comment_10*/
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        BIT_SET(sl_tcram1REG->RAMCTRL,TCRAM_RAMCTRL_ECCWREN);

        /*SAFETYMCUSW 9 S MR: 12.2 <APPROVED> Comment_10*/
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        BIT_SET(sl_tcram2REG->RAMCTRL,TCRAM_RAMCTRL_ECCWREN);

        regBkupRamTh1 = sl_tcram1REG->RAMTHRESHOLD;
        regBkupRamTh2 = sl_tcram2REG->RAMTHRESHOLD;
        /* Clear RAMOCCUR before setting value */
        sl_tcram1REG->RAMOCCUR=0u;
        sl_tcram2REG->RAMOCCUR=0u;
        if((SRAM_ECC_ERROR_PROFILING_FAULT_INJECT == testType)||(SRAM_ECC_ERROR_PROFILING == testType)){
            sl_tcram1REG->RAMTHRESHOLD = TCRAM_RAMTHRESHOLD_FOR_TEST;
            sl_tcram2REG->RAMTHRESHOLD = TCRAM_RAMTHRESHOLD_FOR_TEST;
            testIterations=(uint8)TCRAM_RAMTHRESHOLD_FOR_TEST;
        }else{
            sl_tcram1REG->RAMTHRESHOLD = 1u;
            sl_tcram2REG->RAMTHRESHOLD = 1u;
            testIterations=1u;
        }

        uint8 iTestCycle=0u;
        *sram_stResult = ST_PASS;
        for(iTestCycle=1u;iTestCycle<=testIterations;iTestCycle++){
            _SL_Barrier_Data_Access();
            /* cause a 1-bit ECC error */
            /*SAFETYMCUSW 45 D MR:21.1 <APPROVED> Comment_7*/
            *eccB1 ^= TCRAM_SYN_1BIT_DATA_ECC;
            /*SAFETYMCUSW 45 D MR:21.1 <APPROVED> Comment_7*/
            *eccB2 ^= TCRAM_SYN_1BIT_DATA_ECC;
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)

        /* Write test vectors */
		sl_l2ramwREG->DIAGDATAVECTOR_H = BF_GET((sramEccTestBuff[0]), 32, 32);
		sl_l2ramwREG->DIAGDATAVECTOR_L = BF_GET((sramEccTestBuff[0]), 0, 32);
        sl_l2ramwREG->DIAG_ECC = (*eccB1) ^ L2RAM_SYN_1BIT_DATA_ECC;

#endif

#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif

