pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
            /* read from location with to be generate error */

            _SL_Barrier_Data_Access();
            /*SAFETYMCUSW 446 S MR:10.1 <APPROVED> Comment_11*/
            ramread64 = sramEccTestBuff[0];
            /*SAFETYMCUSW 446 S MR:10.1 <APPROVED> Comment_11*/
            _SL_Barrier_Data_Access();
            ramread64 = sramEccTestBuff[1];
            _SL_Barrier_Data_Access();
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            /*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
            if((sl_tcram1REG->RAMOCCUR == (iTestCycle % testIterations))
               && (sl_tcram2REG->RAMOCCUR == (iTestCycle % testIterations))){
                /*Testcase is still in ST_PASS as long as RAMOCCUR gets incremented*/
                *sram_stResult = ST_PASS;
            }else{
                /*Testcase fails if RAMOCCUR does not get incremented*/
                *sram_stResult = ST_FAIL;
                break;
            }
            sramEccTestBuff[0] = 0u;
            sramEccTestBuff[1] = 0u;
        }
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)

        /* Equality check in compare */
        sl_l2ramwREG->RAMTEST = (uint32) 0x0000008Au; /* 1->Trigger, 8->Eq., test mode, A->Test enable */
        sl_l2ramwREG->RAMTEST = (uint32) 0x00000100u;

        /* Wait for the test to complete */
        /*SAFETYMCUSW 28 D <APPROVED> Comment_13*/
        while (L2RAM_RAMTEST_TST_TRIGGER == (sl_l2ramwREG->RAMTEST & L2RAM_RAMTEST_TST_TRIGGER));
#endif

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /* If in fault injection mode, this will not clear the status and ESM status */
        if(!((SRAM_ECC_1BIT_FAULT_INJECTION== testType) || (SRAM_ECC_ERROR_PROFILING_FAULT_INJECT == testType))){
            if(ST_FAIL != *sram_stResult){
                /* Check if the single bit errors have been generated for both banks */
            	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            	/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
            	/*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
                if ((TCRAM_RAMERRSTATUS_ADDR_SERR == ((uint32)sl_tcram1REG->RAMERRSTATUS & TCRAM_RAMERRSTATUS_ADDR_SERR))
                		/*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
                        && ((TCRAM_RAMERRSTATUS_ADDR_SERR == ((uint32)sl_tcram2REG->RAMERRSTATUS & TCRAM_RAMERRSTATUS_ADDR_SERR)))
                        && (((1u << ESM_G1ERR_B0TCM_CORRERR) | (1u << ESM_G1ERR_B1TCM_CORRERR))
                                == (sl_esmREG->SR1[0] & ((1u << ESM_G1ERR_B0TCM_CORRERR) | (1u << ESM_G1ERR_B1TCM_CORRERR))))){
                    /*LDRA_INSPECTWINDOW 50 */
            		/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
                    /*SAFETYMCUSW 134 S MR:12.2 <APPROVED> Comment_8*/
                    /*SAFETYMCUSW 344 S MR:11.5 <APPROVED> Comment_9*/
                	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                	/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
                	/*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
                    if( ((SRAM_ECC_ERROR_FORCING_1BIT==testType) &&
                    		(sl_tcram2REG->RAMSERRADDR == ((uint32)&sramEccTestBuff[1] & ((uint32)0x0003FFFFU)))) || (SRAM_ECC_ERROR_PROFILING==testType)) {
                        *sram_stResult = ST_PASS;
                    }else{
                        *sram_stResult = ST_FAIL;
                    }
                    sl_tcram1REG->RAMOCCUR = 0x00000000u;
                    sl_tcram2REG->RAMOCCUR = 0x00000000u;
                } else {
                    *sram_stResult = ST_FAIL;
                }
            }
            /* Clear the ESM Status */
            sl_esmREG->SR1[0] = ((1u << ESM_G1ERR_B0TCM_CORRERR) | (1u << ESM_G1ERR_B1TCM_CORRERR));
            /*SAFETYMCUSW 9 S MR: 12.2 <APPROVED> Comment_10*/
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            BIT_SET(sl_tcram1REG->RAMERRSTATUS,TCRAM_RAMERRSTATUS_ADDR_SERR);/* Clear for subsequent operation */
            /*SAFETYMCUSW 9 S MR: 12.2 <APPROVED> Comment_10*/
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            BIT_SET(sl_tcram2REG->RAMERRSTATUS,TCRAM_RAMERRSTATUS_ADDR_SERR);
            /* Compute uncorrupted ECC */
            sramEccTestBuff[0] = 0u;
            sramEccTestBuff[1] = 0u;
        }
        sl_tcram1REG->RAMTHRESHOLD = regBkupRamTh1;
        sl_tcram2REG->RAMTHRESHOLD = regBkupRamTh2;
        /* Restore ctrl registers */
        sl_tcram1REG->RAMCTRL &= ~TCRAM_RAMCTRL_ECCWREN;
        sl_tcram2REG->RAMCTRL &= ~TCRAM_RAMCTRL_ECCWREN;

        /*Restore grp1 esm interrupt enable*/
        sl_esmREG->IESR1 = regBkupIntEnaSet;
        sl_esmREG->EEPAPR1 = regBckupErrInfulence;
#endif

#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        /*if(SRAM_ECC_ERROR_FORCING_1BIT == testType){*/
        /* Check if the diagnostic error status bits have been set */
        if(((sl_esmREG->SSR2 & (1u << ESM_G2ERR_L2RAMW_UNCORR_B)) == (1 << ESM_G2ERR_L2RAMW_UNCORR_B)) &&
            ((sl_l2ramwREG->RAMERRSTATUS & (1 << L2RAM_RAMERRSTATUS_DRSE)) == (1 << L2RAM_RAMERRSTATUS_DRSE)) &&
            ((sl_l2ramwREG->RAMERRSTATUS & (1 << L2RAM_RAMERRSTATUS_DWSE)) == (1 << L2RAM_RAMERRSTATUS_DWSE)))
        {
            *sram_stResult = ST_PASS;
        }
        else
        {
            *sram_stResult = ST_FAIL;
        }
        /* Clear diagnostic errors status bits [22,21,20,19,12,11,10, 4] */
        BIT_SET(sl_l2ramwREG->RAMERRSTATUS, L2RAM_RAMERRSTATUS_CLRALL);
        _SL_HoldNClear_nError(); /* Clear nError */
        /*}*/
#endif

        break;

