pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    case SRAM_PAR_ADDR_CTRL_SELF_TEST:
        /* Once the tests are started, any access to RAM will generate parity errors. So block interrupts */
        irqStatus = _SL_Disable_IRQ();
        /* Should the interrupt routine be backed up and restored before this test is run or
         * should we use the Shadow register only. Because the ISR reads IOFFHR and IOFFLR
         * which in turn clears the status register, which will still be there in Shadow register
         *
         * Pointing ISR to a dummy ISR which does not read IOFFHR/IOFFLR can resolve this
         *
         */

        /* Added for bug fix*/
        tempVal = sl_tcram1REG->RAMPERADDR; /* RAMPERRADDR register must be read for subsequent updates */
        tempVal = sl_tcram2REG->RAMPERADDR;
        tempVal = tempVal; /* avoid compiler warning */
#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
        /* Override parity (actually flip).. NO RAM ACCESS from this point (except intentional errors) */
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        sl_tcram1REG->RAMCTRL = (sl_tcram1REG->RAMCTRL & (~TCRAM_RAMCTRL_ADDRPAR_OVR_MASK)) | TCRAM_RAMCTRL_ADDR_PARITY_OVER;
        /* Access any RAM location */
        _SL_Barrier_Data_Access();
        ramread64 = sramEccTestBuff[0]; /* Generate read parity error on B0 */
        _SL_Barrier_Data_Access();
        /* Restore parity, so that we can use the stack */
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        sl_tcram1REG->RAMCTRL = (sl_tcram1REG->RAMCTRL & (~TCRAM_RAMCTRL_ADDRPAR_OVR_MASK));


        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        sl_tcram2REG->RAMCTRL = (sl_tcram2REG->RAMCTRL & (~TCRAM_RAMCTRL_ADDRPAR_OVR_MASK)) | TCRAM_RAMCTRL_ADDR_PARITY_OVER;
        ramread64 = sramEccTestBuff[1]; /* Generate read parity error on B1 */
        _SL_Barrier_Data_Access();
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        sl_tcram2REG->RAMCTRL = (sl_tcram2REG->RAMCTRL & (~TCRAM_RAMCTRL_ADDRPAR_OVR_MASK));


        /* Have to check the Shadow register as the normal ESM status register is cleared during the interrupt handling */
        /*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        if ((TCRAM_RAMERRSTAT_RADDRPAR_FAIL == (uint32)(sl_tcram1REG->RAMERRSTATUS &
        		TCRAM_RAMERRSTAT_RADDRPAR_FAIL)) &&  /* Read parity error on B1 */
                (TCRAM_RAMERRSTAT_RADDRPAR_FAIL ==
                		/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                		(uint32)(sl_tcram2REG->RAMERRSTATUS &
                		TCRAM_RAMERRSTAT_RADDRPAR_FAIL)) &&  /* Read parity error on B2 */
                (GET_ESM_BIT_NUM(ESM_G2ERR_B0TCM_ADDPAR) ==
                		/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
                		/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                		(sl_esmREG->SSR2 & GET_ESM_BIT_NUM(ESM_G2ERR_B0TCM_ADDPAR))) &&   /* B1 Parity error */
                (GET_ESM_BIT_NUM(ESM_G2ERR_B1TCM_ADDPAR) ==
                		/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
                		/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                		(sl_esmREG->SSR2 & GET_ESM_BIT_NUM(ESM_G2ERR_B1TCM_ADDPAR)))) {    /* B2 parity error */
            *sram_stResult = ST_PASS;
        } else {
            *sram_stResult = ST_FAIL;
        }
        /* Anyways Clear the interrupt bits */
        sl_esmREG->SSR2 = (1u << ESM_G2ERR_B0TCM_ADDPAR);
        sl_esmREG->SSR2 = (1u << ESM_G2ERR_B1TCM_ADDPAR);
        sl_esmREG->SR1[1] = (1u << ESM_G2ERR_B0TCM_ADDPAR);
        sl_esmREG->SR1[1] = (1u << ESM_G2ERR_B1TCM_ADDPAR);
        sl_tcram1REG->RAMERRSTATUS = TCRAM_RAMERRSTAT_RADDRPAR_FAIL;
        sl_tcram2REG->RAMERRSTATUS = TCRAM_RAMERRSTAT_RADDRPAR_FAIL;
        tempVal = sl_tcram1REG->RAMPERADDR; /* RAMPERRADDR register must be read for subsequent updates */
        tempVal = sl_tcram2REG->RAMPERADDR;
        tempVal = tempVal; /* avoid compiler warning */

        if (ST_PASS == *sram_stResult) {
            /* Override parity (actually flip).. NO RAM ACCESS from this point (except intentional errors) */
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            sl_tcram1REG->RAMCTRL = (sl_tcram1REG->RAMCTRL & 0xF0FFFFFFU) | TCRAM_RAMCTRL_ADDR_PARITY_OVER;
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            sl_tcram2REG->RAMCTRL = (sl_tcram2REG->RAMCTRL & 0xF0FFFFFFU) | TCRAM_RAMCTRL_ADDR_PARITY_OVER;
            sramEccTestBuff[0] = 0xAAAAAAAABBBBBBBBu; /* Generate write parity error on B1 & B2 */
            sramEccTestBuff[1] = 0xBBBBBBBBAAAAAAAAu;
            /* Restore parity, so that we can use the stack */
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            sl_tcram1REG->RAMCTRL = (sl_tcram1REG->RAMCTRL & 0xF0FFFFFFU);
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            sl_tcram2REG->RAMCTRL = (sl_tcram2REG->RAMCTRL & 0xF0FFFFFFU);
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    		/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    		/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            /*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
            /*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
            /*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
            if ((TCRAM_RAMERRSTAT_WADDRPAR_FAIL == (uint32)(sl_tcram1REG->RAMERRSTATUS & TCRAM_RAMERRSTAT_WADDRPAR_FAIL)) &&  /* Write parity error on B1 */
                    (TCRAM_RAMERRSTAT_WADDRPAR_FAIL == (uint32)(sl_tcram2REG->RAMERRSTATUS & TCRAM_RAMERRSTAT_WADDRPAR_FAIL)) &&  /* Write parity error on B2 */
                    (0 != (sl_esmREG->SSR2 & (1u << ESM_G2ERR_B0TCM_ADDPAR))) &&    /* B1 Parity error */
                    (0 != (sl_esmREG->SSR2 & (1u << ESM_G2ERR_B1TCM_ADDPAR)))) {    /* B2 parity error */
                *sram_stResult = ST_PASS;
            } else {
                *sram_stResult = ST_FAIL;
            }

            /* Restore parity */
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            sl_tcram1REG->RAMCTRL = (sl_tcram1REG->RAMCTRL & 0xF0FFFFFFU);
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            sl_tcram2REG->RAMCTRL = (sl_tcram2REG->RAMCTRL & 0xF0FFFFFFU);

            /* Anyways Clear the interrupt bits */
            sl_esmREG->SSR2 = (1u << ESM_G2ERR_B0TCM_ADDPAR);
            sl_esmREG->SSR2 = (1u << ESM_G2ERR_B1TCM_ADDPAR);
            sl_esmREG->SR1[1] = (1u << ESM_G2ERR_B0TCM_ADDPAR);
            sl_esmREG->SR1[1] = (1u << ESM_G2ERR_B1TCM_ADDPAR);
            sl_tcram1REG->RAMERRSTATUS = TCRAM_RAMERRSTAT_WADDRPAR_FAIL;
            sl_tcram2REG->RAMERRSTATUS = TCRAM_RAMERRSTAT_WADDRPAR_FAIL;
            tempVal = sl_tcram1REG->RAMPERADDR; /* RAMPERRADDR register must be read for subsequent updates */
            tempVal = sl_tcram2REG->RAMPERADDR;
            tempVal = tempVal; /* avoid compiler warning */
        }
        _SL_HoldNClear_nError(); /* Clear nError */
        /* Restore interrupts */
        _SL_Restore_IRQ(irqStatus);
        ramread64 = ramread64; /* avoid compiler warning */

        break;
#endif

