pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    case SRAM_RADECODE_DIAGNOSTICS:
        retVal = TRUE;

#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif

        /*flag is set to indicate the current test which is ongoing and
        These flags are used in the sl_esm.c so as to mask the esm callback*/
        SL_FLAG_SET(SRAM_RADECODE_DIAGNOSTICS);
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        _SL_SelfTest_SRAM_RAD(sl_tcram1REG, sram_stResult);
        _SL_HoldNClear_nError(); /* Clear nError */
#endif
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        if (ST_PASS == *sram_stResult) {
            sl_esmREG->SR1[1] = (1u << ESM_G2ERR_B0TCM_UNCORR);
            sl_esmREG->SSR2 = (1u << ESM_G2ERR_B0TCM_UNCORR);
            /*flag is set to indicate the current test which is ongoing and
            These flags are used in the sl_esm.c so as to mask the esm callback*/
            SL_FLAG_SET(SRAM_RADECODE_DIAGNOSTICS);
            _SL_SelfTest_SRAM_RAD(sl_tcram2REG, sram_stResult);
            _SL_HoldNClear_nError(); /* Clear nError */
            if (ST_PASS == *sram_stResult) {
                sl_esmREG->SR1[1] = (1u << ESM_G2ERR_B1TCM_UNCORR);
                sl_esmREG->SSR2 = (1u << ESM_G2ERR_B1TCM_UNCORR);
            }
        }
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        _SL_SelfTest_SRAM_RAD(sl_l2ramwREG, sram_stResult);
        /* Clear any previous diagnostic errors status bits [22,21,20,19,12,11,10, 4] - required before trigger */
        BIT_SET(sl_l2ramwREG->RAMERRSTATUS, L2RAM_RAMERRSTATUS_CLRALL);
        _SL_HoldNClear_nError(); /* Clear nError */
#endif
        /*clear the flags which indicate tests ongoing*/
        SL_FLAG_CLEAR(SRAM_RADECODE_DIAGNOSTICS);
        break;
#endif

    default:
        retVal = FALSE;
        break;
    }
    /* If the test was fault injection and not self test, then do not mask the call back & clear the *
    *  FAULT_INJECTION flag for subsequent runs*/
    if((TRUE) == _sl_fault_injection){
            _sl_fault_injection=FALSE;
    }
#if(FUNC_RESULT_LOG_ENABLED == 1)
    /*SAFETYMCUSW 45 D MR:21.1 <APPROVED> Comment_14*/
    SL_Log_Result(FUNC_ID_ST_SRAM,testType, *sram_stResult , 0U);
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Stop_Profiling(testType);
#endif
    return(retVal);
}

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
#define flashBadECC1    0x20000000u
#define flashBadECC2    0x20000008u
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
#define flashBadECC1    0x00000008u
#define flashBadECC2    0x000000016u
/* Flash diagnostics must be run from SRAM  */
#ifdef __TI_COMPILER_VERSION__
#pragma CODE_SECTION (SL_SelfTest_Flash, ".sl_stflash_SRAM")
#endif
#ifdef __IAR_SYSTEMS_ICC__
#pragma location = ".sl_stflash_SRAM"
#endif
#endif
/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_SelfTest_Flash (SL_SelfTestType testType, boolean bMode, SL_SelfTest_Result * flash_stResult)
{
    boolean retVal = FALSE;
    uint32 fdiagCtrl = F021F_FDIAGCTRL_DIAG_EN_KEY, regBkupIntEnaSet;
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    uint32 regBkupFparOvr, regBckupErrInfulence, regBckupFdiagctrl;
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
    uint32 content, index, regBkupCamAvail, regBckupFdiagctrl, regBckupErrctrl, regBckupErrInfulence, vimCleared = 0;
#endif
    volatile boolean _sl_fault_injection = FALSE;
    volatile uint32 flashread = 0u;
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    /* If fault inject set global variable to flag to the ESM handler that it is a fault injection */
    if((FLASH_ADDRESS_ECC_FAULT_INJECT == testType)||
        (FLASH_ADDRESS_PARITY_FAULT_INJECT == testType)||
        (FLASH_ECC_TEST_MODE_2BIT_FAULT_INJECT == testType)){
        _sl_fault_injection=TRUE;
    }
#endif
#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /* Verify that the parameters are in rage */
    /*LDRA_INSPECTWINDOW 50 */
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    if ((_SELFTEST_FLASHECC_MIN > testType) || (_SELFTEST_FLASHECC_MAX < testType) || !CHECK_RANGE_RAM_PTR(flash_stResult)) {
        SL_Log_Error(FUNC_ID_ST_FLASH, ERR_TYPE_PARAM, 0U);
        return(FALSE);
    }
#endif
#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /* Error if not in privilege mode */
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_FLASH, ERR_TYPE_ENTRY_CON, 2U);
        return(FALSE);
    }

    /* If nERROR is active then do not proceed with tests that trigger nERROR */
    if((TRUE) == SL_ESM_nERROR_Active()){
        SL_Log_Error(FUNC_ID_ST_FLASH, ERR_TYPE_ENTRY_CON, 3U);
        return(FALSE);
    }
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Start_Profiling(testType);
#endif

    switch(testType) {
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    case FLASH_ECC_ADDR_TAG_REG_MODE:
        regBckupFdiagctrl = sl_flashWREG->FDIAGCTRL;
        /* Read to unfreeze the error address registers */
        flashread = sl_flashWREG->FUNCERRADD;
        fdiagCtrl |= F021F_FDIAGCTRL_DMODE_ADDR_TAG;
        /* clear flash status flags */
        sl_flashWREG->FEDACSTATUS = (F021F_FEDACSTATUS_ADD_TAG_ERR |  F021F_EE_STATUS_D_UNC_ERR_FLG);
        sl_flashWREG->FDIAGCTRL = fdiagCtrl;
        /* address for test in FRAWDATAL*/
        sl_flashWREG->FRAWDATAL = sl_flashWREG->FPRIMADDTAG;

        sl_flashWREG->FREDUADDTAG^=(uint32)~0;
#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
        sl_flashWREG->FDIAGCTRL |=F021F_FDIAGCTRL_DIAG_TRIG;
        _SL_HoldNClear_nError();
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        /*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
        if ((F021F_FEDACSTATUS_ADD_TAG_ERR == ((uint32)sl_flashWREG->FEDACSTATUS & F021F_FEDACSTATUS_ADD_TAG_ERR)) &&
            (GET_ESM_BIT_NUM(ESM_G3ERR_FMC_UNCORR) == (sl_esmREG->SR1[2] & GET_ESM_BIT_NUM(ESM_G3ERR_FMC_UNCORR))))
        {
            /*Clear ESM status */
            sl_esmREG->SR1[2]=GET_ESM_BIT_NUM(ESM_G3ERR_FMC_UNCORR);
            *flash_stResult = ST_PASS;
            /* clear flash status flags */
            sl_flashWREG->FEDACSTATUS = (F021F_FEDACSTATUS_ADD_TAG_ERR |  F021F_EE_STATUS_D_UNC_ERR_FLG);
            /* Read to unfreeze the error address registers */
            flashread = sl_flashWREG->FUNCERRADD;

            sl_flashWREG->FDIAGCTRL = regBckupFdiagctrl;
            sl_flashWREG->FDIAGCTRL = fdiagCtrl;
            /*Load primary address tag(with a different value address in FRAW_DATAL != FPRIMADDTAG )*/
            sl_flashWREG->FPRIMADDTAG^=(uint32)~0;
            /*Load duplicate address tag*/
            sl_flashWREG->FRAWDATAL =sl_flashWREG->FREDUADDTAG;
            sl_flashWREG->FDIAGCTRL |=F021F_FDIAGCTRL_DIAG_TRIG;
            _SL_HoldNClear_nError();
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            /*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
            if ((F021F_FEDACSTATUS_ADD_TAG_ERR == ((uint32)sl_flashWREG->FEDACSTATUS & F021F_FEDACSTATUS_ADD_TAG_ERR))&&
                (GET_ESM_BIT_NUM(ESM_G3ERR_FMC_UNCORR) == (sl_esmREG->SR1[2] & GET_ESM_BIT_NUM(ESM_G3ERR_FMC_UNCORR))))
            {
                *flash_stResult = ST_PASS;
            }
            else
            {
                *flash_stResult = ST_FAIL;
            }
        }
        else
        {
            *flash_stResult = ST_FAIL;
            /*if any of the test fails break the loop as the test case has failed*/
        }
        /*Clear ESM status */
        sl_esmREG->SR1[2]=GET_ESM_BIT_NUM(ESM_G3ERR_FMC_UNCORR);
        /* clear flash status flags */
        sl_flashWREG->FEDACSTATUS = (F021F_FEDACSTATUS_ADD_TAG_ERR |  F021F_EE_STATUS_D_UNC_ERR_FLG);
        /* Read to unfreeze the error address registers */
        flashread = sl_flashWREG->FUNCERRADD;
        sl_flashWREG->FDIAGCTRL = regBckupFdiagctrl;
        retVal = TRUE;
        break;
#endif
    case FLASH_ECC_TEST_MODE_1BIT:

