pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /* Backup parity over ride register */
        regBkupFparOvr = sl_flashWREG->FPAROVR;
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        /* Backup the EPC error control register*/
        regBckupErrctrl = sl_epcREG1->EPCCNTRL;
#endif
        /* Backup the FLASH diag control register */
        regBckupFdiagctrl = sl_flashWREG->FDIAGCTRL;

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /* Read to unfreeze the error address registers */
        flashread = sl_flashWREG->FCORERRADD;
        sl_flashWREG->FEDACSTATUS= F021F_FEDACSTATUS_ERR_ZERO_FLG;
#endif
        /*Backup grp1 esm interrupt enable register and clear the interrupt enable */
        regBkupIntEnaSet = sl_esmREG->IESR1;

        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        regBckupErrInfulence = sl_esmREG->EEPAPR1;

#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        /* Disable interrupt on CAM/FIFO full */
        if((sl_vimREG->REQMASKCLR3 & VIM_CHANNEL_EPC_FIFO_CAM_FULL) == VIM_CHANNEL_EPC_FIFO_CAM_FULL) {
            BIT_SET(sl_vimREG->REQMASKCLR3, VIM_CHANNEL_EPC_FIFO_CAM_FULL);
            vimCleared = 1;
        }
#endif
        if((FALSE) == _sl_fault_injection){
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
            sl_esmREG->IECR1 = GET_ESM_BIT_NUM(ESM_G1ERR_FMC_CORR);
            sl_esmREG->DEPAPR1 = GET_ESM_BIT_NUM(ESM_G1ERR_FMC_CORR);
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
            sl_esmREG->IECR1 = GET_ESM_BIT_NUM(ESM_G1ERR_EPC_SERR);
            sl_esmREG->DEPAPR1 = GET_ESM_BIT_NUM(ESM_G1ERR_EPC_SERR);
#endif
        }
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        /* Clear any pending CAM full/overflow events */
        BIT_SET(sl_epcREG1->EPCERRSTAT, (EPC_ERR_CAM_FULL | EPC_ERR_CAM_OVRFLW));

        /* Clear any pending FIFO full/overflow events */
        BIT_SET(sl_epcREG1->FIFOFULLSTAT, EPC_FIFO_FULL);
        BIT_SET(sl_epcREG1->OVRFLWSTAT, EPC_FIFO_OVRFLW);

        /* Enable EPC CAM/FIFO full events */
        BIT_SET(sl_epcREG1->EPCCNTRL, EPC_CTRL_FULL_EN);
        /* Enable EPC CAM/FIFO overflow events (also enables correctable error event) */
        BF_SET(sl_epcREG1->EPCCNTRL, EPC_CTRL_SERR_EN, EPC_CTRL_SERR_START, EPC_CTRL_SERR_LENGTH);
#endif

        /* Setup the diag mode for 1 bit error */
        fdiagCtrl |= F021F_FDCTRL_DMODE_TEST_MODE;
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        sl_flashWREG->FPAROVR = F021F_FPAROVR_PAR_OVR_ENABLE|F021F_FPAROVR_BUS_PAR_ENABLE;
        sl_flashWREG->FPAROVR |= F021F_FPAROVR_SYN_1BIT_DATA_ECC;
#endif
        sl_flashWREG->FDIAGCTRL = fdiagCtrl;
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        /* Prepare the values of data and ecc to be XORed */
        sl_flashWREG->FEMU_DMSW = 0U;
        sl_flashWREG->FEMU_DLSW = 0U;
        sl_flashWREG->FEMU_ECC = F021F_FEMU_ECC_SYN_1BIT_DATA_ECC;
        /* Select the right port for reading from */
        BF_SET(sl_flashWREG->FDIAGCTRL, F021F_FDIAGCTRL_DIAG_BUF_SEL_A, F021F_FDIAGCTRL_DIAG_EN_START, F021F_FDIAGCTRL_DIAG_EN_LENGTH);


        regBkupCamAvail = sl_epcREG1->CAMAVAILSTAT;
#endif

#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        regBkupCamAvail = sl_epcREG1->CAMAVAILSTAT;
#endif
        /* Enable the trigger bit of the diagnostic */
        sl_flashWREG->FDIAGCTRL |= F021F_FDIAGCTRL_DIAG_TRIG;

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /*SAFETYMCUSW 58 S MR:14.3 <APPROVED> Comment_16*/
        flashread = *(volatile uint32 *)flashBadECC2;
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        /*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
        /*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
        if ((F021F_FEDACSTATUS_ERR_ZERO_FLG == ((uint32)sl_flashWREG->FEDACSTATUS & F021F_FEDACSTATUS_ERR_ZERO_FLG))
                && (sl_flashWREG->FCORERRADD == 0x8u)
                && ((sl_esmREG->SR1[0] & BIT(ESM_G1ERR_FMC_CORR)) == BIT(ESM_G1ERR_FMC_CORR))) {
            /* Clear flash & ESM status registers */
            sl_flashWREG->FEDACSTATUS = F021F_FEDACSTATUS_ERR_ZERO_FLG;
            sl_esmREG->SR1[0] = BIT(ESM_G1ERR_FMC_CORR);
            flashread = sl_flashWREG->FCORERRADD;
            /* Repeat the test for a different address to ensure that the FCORERRADD register is updated correctly */
            /*SAFETYMCUSW 58 S MR:14.3 <APPROVED> Comment_16*/
            sl_flashWREG->FDIAGCTRL |= F021F_FDIAGCTRL_DIAG_TRIG;
            flashread = *(volatile uint32 *)flashBadECC1;
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            /*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
            /*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
            if ((F021F_FEDACSTATUS_ERR_ZERO_FLG == ((uint32)sl_flashWREG->FEDACSTATUS & F021F_FEDACSTATUS_ERR_ZERO_FLG))
                    && (sl_flashWREG->FCORERRADD == 0x0u)
                    && ((sl_esmREG->SR1[0] & BIT(ESM_G1ERR_FMC_CORR)) == BIT(ESM_G1ERR_FMC_CORR))) {
                *flash_stResult = ST_PASS;
            } else {
                *flash_stResult = ST_FAIL;
            }
        } else {
            *flash_stResult = ST_FAIL;
        }
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)

        /*SAFETYMCUSW 58 S MR:14.3 <APPROVED> Comment_16*/
        flashread = *(volatile uint32 *)flashBadECC1;

