pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
        if (((((sl_epcREG1->EPCERRSTAT & EPC_ERR_CAM_FULL) == EPC_ERR_CAM_FULL) ||
                ((sl_epcREG1->EPCERRSTAT & EPC_ERR_CAM_OVRFLW) == EPC_ERR_CAM_OVRFLW) ||
                (sl_epcREG1->CAMAVAILSTAT != regBkupCamAvail))) &&
                ((((sl_esmREG->SR1[0]) & BIT(ESM_G1ERR_EPC_SERR))) == (BIT(ESM_G1ERR_EPC_SERR)))) {
                    /* Clear ESM status registers */
                    sl_esmREG->SR1[0] = BIT(ESM_G1ERR_EPC_SERR);

            if(sl_epcREG1->CAMAVAILSTAT != regBkupCamAvail) {
                /* Clear the CAM entries */
                /* Set CAM indices to available */
                for(content = 0U; content<32U; content++) {
                    if((volatile uint32 *)(sl_epcREG1->CAM_CONTENT[content] & EPC_CAM_CONTENT_ADDR) == (volatile uint32 *)(flashBadECC1 & EPC_CAM_CONTENT_ADDR)) {
                        break;
                    }
                }
                /* Calculate the index location */
                index = content/4;
                index = content - index*4;
                content = content/4;
                BF_SET(sl_epcREG1->CAM_INDEX[content], EPC_CAM_INDEX_CLEAR, EPC_CAM_INDEX_START(index), EPC_CAM_INDEX_LENGTH);
            }

            *flash_stResult = ST_PASS;

        } else {
            *flash_stResult = ST_FAIL;
        }
#endif

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /* Anyways clear flash & ESM status registers */
        sl_flashWREG->FEDACSTATUS = F021F_FEDACSTATUS_ERR_ZERO_FLG;
        sl_esmREG->SR1[0] = BIT(ESM_G1ERR_FMC_CORR);
        flashread = sl_flashWREG->FCORERRADD;
#endif
        /* Clear the diag mode settings */
        sl_flashWREG->FDIAGCTRL &=~(F021F_FDCTRL_DMODE_TEST_MODE|F021F_FDIAGCTRL_DIAG_EN_MASK); /* Clear Diagnostics enable key */
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        sl_flashWREG->FPAROVR = regBkupFparOvr;
#endif
        sl_flashWREG->FDIAGCTRL = regBckupFdiagctrl;

        /*Restore grp1 esm interrupt enable*/
        sl_esmREG->IESR1 = regBkupIntEnaSet;
        sl_esmREG->EEPAPR1 = regBckupErrInfulence;
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)

        /* Restore EPC registers*/
        sl_epcREG1->EPCCNTRL = regBckupErrctrl;
		sl_epcREG1->CAMAVAILSTAT = regBkupCamAvail;

        if(vimCleared == 1) {
            BIT_SET(sl_vimREG->REQMASKSET3, VIM_CHANNEL_EPC_FIFO_CAM_FULL);
        }

#endif

        retVal = TRUE; /* Tests were run */
        break;
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    case FLASH_ADDRESS_PARITY_SELF_TEST:
    case FLASH_ADDRESS_PARITY_FAULT_INJECT:
        /* Backup registers */
        regBkupFparOvr = sl_flashWREG->FPAROVR;
        regBckupFdiagctrl = sl_flashWREG->FDIAGCTRL;
        /* Read to unfreeze the error address registers */
        flashread = sl_flashWREG->FUNCERRADD;
        sl_flashWREG->FEDACSTATUS = F021F_FEDACSTATUS_ADD_PAR_ERR;
        fdiagCtrl |= F021F_FDCTRL_DMODE_TEST_MODE;
        sl_flashWREG->FPAROVR = F021F_FPAROVR_PAR_OVR_ENABLE|F021F_FPAROVR_BUS_PAR_ENABLE;
        sl_flashWREG->FDIAGCTRL = fdiagCtrl;
        sl_flashWREG->FPAROVR |= F021F_FPAROVR_ADD_INV_PAR;
        /*flag is set to indicate the current test which is ongoing and
        These flags are used in the sl_esm.c so as to mask the esm callback*/
        if(testType == FLASH_ADDRESS_PARITY_SELF_TEST)
        {
        	SL_FLAG_SET(FLASH_ADDRESS_PARITY_SELF_TEST);
        }
        else
        {
        	SL_FLAG_SET(FLASH_ADDRESS_PARITY_FAULT_INJECT);
        }
#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
        flashread = *(volatile uint32 *)flashBadECC1;

        if(FLASH_ADDRESS_PARITY_FAULT_INJECT != testType)
        {
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        	/*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
            if ((F021F_FEDACSTATUS_ADD_PAR_ERR==((uint32)sl_flashWREG->FEDACSTATUS & F021F_FEDACSTATUS_ADD_PAR_ERR))) {
                sl_flashWREG->FPAROVR = regBkupFparOvr;
                _SL_HoldNClear_nError(); /* Clear nError */
                /* Clear flash & ESM status registers */
                sl_flashWREG->FEDACSTATUS = F021F_FEDACSTATUS_ADD_PAR_ERR;
                sl_esmREG->SR1[1] = GET_ESM_BIT_NUM(ESM_G2ERR_FMC_UNCORR);
                flashread = sl_flashWREG->FUNCERRADD;
                *flash_stResult = ST_PASS;
            }else {
                *flash_stResult = ST_FAIL;
            }
            /* Anyways clear flash & ESM status registers */
            sl_flashWREG->FEDACSTATUS = F021F_FEDACSTATUS_ADD_PAR_ERR;
            sl_esmREG->SR1[1] =  GET_ESM_BIT_NUM(ESM_G2ERR_FMC_UNCORR);
            sl_esmREG->SSR2 = GET_ESM_BIT_NUM(ESM_G2ERR_FMC_UNCORR);
            flashread = sl_flashWREG->FUNCERRADD;

            /* Clear the diag mode settings */
            sl_flashWREG->FPAROVR = regBkupFparOvr;
            sl_flashWREG->FDIAGCTRL = regBckupFdiagctrl;
        }
        retVal = TRUE; /* Tests were run */
        /*clear the flags which indicate tests ongoing*/
        if(testType == FLASH_ADDRESS_PARITY_SELF_TEST)
        {
        	SL_FLAG_CLEAR(FLASH_ADDRESS_PARITY_SELF_TEST);
        }
        else
        {
        	SL_FLAG_CLEAR(FLASH_ADDRESS_PARITY_FAULT_INJECT);
        }
        break;
#endif
    case FLASH_ECC_TEST_MODE_2BIT:
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    case FLASH_ECC_TEST_MODE_2BIT_FAULT_INJECT:
    case FLASH_ADDRESS_ECC_SELF_TEST:
    case FLASH_ADDRESS_ECC_FAULT_INJECT:

        /* Backup parity over ride register */
        regBkupFparOvr = sl_flashWREG->FPAROVR;
#endif
        regBckupFdiagctrl = sl_flashWREG->FDIAGCTRL;
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /* Read to unfreeze the error address registers */
        flashread = sl_flashWREG->FUNCERRADD;
        sl_flashWREG->FEDACSTATUS = F021F_FEDACSTATUS_B1_UNC_ERR;
        sl_flashWREG->FEDACSTATUS = F021F_FEDACSTATUS_ERR_ZERO_FLG;
#endif

