pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
        /* Setup the diag mode for 2 bit error */
        fdiagCtrl |= F021F_FDCTRL_DMODE_TEST_MODE;
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        sl_flashWREG->FPAROVR = F021F_FPAROVR_PAR_OVR_ENABLE|F021F_FPAROVR_BUS_PAR_ENABLE;
        if((FLASH_ADDRESS_ECC_SELF_TEST == testType)||(FLASH_ADDRESS_ECC_FAULT_INJECT == testType ))
        {
            sl_flashWREG->FPAROVR |= F021F_FPAROVR_SYN_ADDRESS_ECC;
        }
        else /* FLASH_ECC_TEST_MODE_2BIT || FLASH_ECC_TEST_MODE_2BIT_FAULT_INJECT */
        {
            sl_flashWREG->FPAROVR |= F021F_FPAROVR_SYN_2BIT_DATA_ECC;
        }
#endif
        sl_flashWREG->FDIAGCTRL = fdiagCtrl;
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        sl_flashWREG->FEMU_DMSW = 0U;
        sl_flashWREG->FEMU_DLSW = 0U;
        sl_flashWREG->FEMU_ECC = F021F_FEMU_ECC_SYN_2BIT_DATA_ECC;
        BF_SET(sl_flashWREG->FDIAGCTRL, F021F_FDIAGCTRL_DIAG_BUF_SEL_A, F021F_FDIAGCTRL_DIAG_EN_START, F021F_FDIAGCTRL_DIAG_EN_LENGTH);
#endif


        /*flag is set to indicate the current test which is ongoing and
        These flags are used in the sl_esm.c so as to mask the esm callback*/
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        if ((FLASH_ECC_TEST_MODE_2BIT_FAULT_INJECT != testType)&&(FLASH_ADDRESS_ECC_FAULT_INJECT != testType)) 
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        if (FLASH_ECC_TEST_MODE_2BIT == testType) 
#endif
        {
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        	SL_FLAG_SET(FLASH_ECC_TEST_MODE_2BIT);
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
            /* Test must run from RAM - cannot execute the function SL_FLAG_SET
             * from Flash, so copying the functionality inline.  */
            extern boolean sl_priv_flag_set[];
            sl_priv_flag_set[FLASH_ECC_TEST_MODE_2BIT-TESTTYPE_MIN] = TRUE;
#endif

#if FUNCTION_PROFILING_ENABLED
		    SL_Record_Errorcreationtick(testType);
#endif

        	sl_flashWREG->FDIAGCTRL |= F021F_FDIAGCTRL_DIAG_TRIG;
		
            /*SAFETYMCUSW 58 S MR:14.3 <APPROVED> Comment_16*/
            flashread = *(volatile uint32 *)flashBadECC2;
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            /*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
            /*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
            if ((F021F_FEDACSTATUS_B1_UNC_ERR==((uint32)sl_flashWREG->FEDACSTATUS & F021F_FEDACSTATUS_B1_UNC_ERR))
                    && (sl_flashWREG->FUNCERRADD == 0x8u)
                    && (BIT(ESM_G3ERR_FMC_UNCORR) == (sl_esmREG->SR1[2] & BIT(ESM_G3ERR_FMC_UNCORR)))) {
                _SL_HoldNClear_nError(); /* Clear nError */
                /* Clear flash & ESM status registers */
                sl_flashWREG->FEDACSTATUS = F021F_FEDACSTATUS_B1_UNC_ERR;
                sl_esmREG->SR1[2] = BIT(ESM_G3ERR_FMC_UNCORR);

                /* Repeat the test for a different address to ensure that the FCORERRADD register is updated correctly */
                /*SAFETYMCUSW 58 S MR:14.3 <APPROVED> Comment_16*/
                sl_flashWREG->FDIAGCTRL = fdiagCtrl;
                sl_flashWREG->FDIAGCTRL |= F021F_FDIAGCTRL_DIAG_TRIG;
                flashread = *(volatile uint32 *)flashBadECC1;
                /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                /*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
                /*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
                if ((F021F_FEDACSTATUS_B1_UNC_ERR == ((uint32)sl_flashWREG->FEDACSTATUS & F021F_FEDACSTATUS_B1_UNC_ERR))
                        && (sl_flashWREG->FUNCERRADD == 0x0u) && (BIT(ESM_G3ERR_FMC_UNCORR) == (sl_esmREG->SR1[2] & BIT(ESM_G3ERR_FMC_UNCORR)))) {
                    _SL_HoldNClear_nError();
                    *flash_stResult = ST_PASS;
                } else {
                    *flash_stResult = ST_FAIL;
                }
            } else {
                *flash_stResult = ST_FAIL;
            }
			/* Anyways clear flash & ESM status registers */
			#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
			sl_flashWREG->FEDACSTATUS = F021F_FEDACSTATUS_B1_UNC_ERR;
			flashread = sl_flashWREG->FUNCERRADD;
			#endif
            sl_esmREG->SR1[2] =  BIT(ESM_G3ERR_FMC_UNCORR);
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
            if (BIT(ESM_G2ERR_CR5_BUSERR) == (sl_esmREG->SSR2 & BIT(ESM_G2ERR_CR5_BUSERR))) {
                /* Clear nError */
                _SL_HoldNClear_nError();
                sl_esmREG->SSR2 = BIT(ESM_G2ERR_CR5_BUSERR);
                *flash_stResult = ST_PASS;
            } else {
                *flash_stResult = ST_FAIL;
            }
#endif
            /* Clear the diag mode settings */
			#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
			sl_flashWREG->FPAROVR = regBkupFparOvr;
			#endif
            sl_flashWREG->FDIAGCTRL = regBckupFdiagctrl;
            /* Clear the flags which indicate tests ongoing*/
            SL_FLAG_CLEAR(FLASH_ECC_TEST_MODE_2BIT);
        }
        /* Tests were run */
        retVal = TRUE;
        break;

    default:
        retVal = FALSE;
        break;
    }
    /* If the test was fault injection and not self test, then do not mask the call back & clear the *
     *  FAULT_INJECTION flag for subsequent runs*/
    if((TRUE) == _sl_fault_injection){
            _sl_fault_injection=FALSE;
    }
#if(FUNC_RESULT_LOG_ENABLED == 1)
    /*SAFETYMCUSW 45 D MR:21.1 <APPROVED> Comment_14*/
    SL_Log_Result(FUNC_ID_ST_FLASH, testType, *flash_stResult , 0U);
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Stop_Profiling(testType);
#endif
    return(retVal);
}

