pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
#define feeBadECC1        (*(volatile uint32 *)0xF0200000u)
#define feeBadECC2        (*(volatile uint32 *)0xF0200008u)
#define ADDR_DATA_MSW                        (0xF0200004u)
#define ADDR_DATA_LSW                        (0xF0200000u)
#define FEE_TEST_DATA                        0u
#define FEE_ERROR_POS                        2u
#define FEE_SYNDROME_BIT2_SINGLE_BIT_ERROR    0xD3u
/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_SelfTest_FEE (SL_SelfTestType testType, boolean bMode, SL_SelfTest_Result * fee_stResult)
{
    boolean retVal = FALSE;
    uint32 fdiagCtrl = F021F_FDIAGCTRL_DIAG_EN_KEY;
    uint32 regBckupFdiagctrl, regBkupIntEnaSet, regBckupErrInfulence;
    uint8 ecc;
    uint8 syndrome=0U;
    volatile boolean _sl_fault_injection = FALSE;
    volatile uint32 flashread = 0u;

#if FUNCTION_PROFILING_ENABLED
    SL_Start_Profiling(testType);
#endif
    /* If fault inject set global variable to flag to the ESM handler that it is a fault injection */
    if((FEE_ECC_TEST_MODE_1BIT_FAULT_INJECT == testType)||
        (FEE_ECC_TEST_MODE_2BIT_FAULT_INJECT == testType)){
        _sl_fault_injection=TRUE;
    }
#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /* Verify that the parameters are in rage */
    /*LDRA_INSPECTWINDOW 50 */
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    if ((_SELFTEST_FEEECC_MIN > testType) || (_SELFTEST_FEEECC_MAX < testType) || !CHECK_RANGE_RAM_PTR(fee_stResult)) {
        SL_Log_Error(FUNC_ID_ST_FLASH, ERR_TYPE_PARAM, 0U);
        return(FALSE);
    }
#endif
#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /* Error if not in privilege mode */
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_FLASH, ERR_TYPE_ENTRY_CON, 2U);
        return(FALSE);
    }

    /* If nERROR is active then do not proceed with tests that trigger nERROR */
    if((TRUE) == SL_ESM_nERROR_Active()){
        SL_Log_Error(FUNC_ID_ST_FLASH, ERR_TYPE_ENTRY_CON, 3U);
        return(FALSE);
    }
#endif
    switch(testType) {

    case FEE_ECC_DATA_CORR_MODE:
    case FEE_ECC_TEST_MODE_1BIT:
    case FEE_ECC_TEST_MODE_1BIT_FAULT_INJECT:
    case FEE_ECC_TEST_MODE_2BIT:
    case FEE_ECC_TEST_MODE_2BIT_FAULT_INJECT:
        regBckupFdiagctrl = sl_flashWREG->FDIAGCTRL;
        fdiagCtrl |= F021F_FDCTRL_DMODE_DATA_CORR;
        /*  Clear all the status errors*/
        sl_flashWREG->EESTATUS |= ~0;
        /* Clear this to unfree error reporting */
        flashread=sl_flashWREG->EEUNCERRADD;
        flashread=sl_flashWREG->EECORRERRADD;

        /*Backup grp1 esm interrupt enable register and clear the interrupt enable */
        /*the esm interrupts for selftests which generate group 1 interrupts is blocked.Users will have to rely on
        status functions to get the pass/failure information*/        
        regBkupIntEnaSet = sl_esmREG->IESR4;
        regBckupErrInfulence = sl_esmREG->IEPSR4;
        if((FALSE) == _sl_fault_injection){
            sl_esmREG->IECR4 = GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_CORRERR)|GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_UNCORRERR);
            sl_esmREG->IEPCR4 = GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_CORRERR)|GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_UNCORRERR);
        }

        /* Load FEMU_XX regs in order to generate ecc */
        sl_flashWREG->FEMUADDR=ADDR_DATA_MSW;
        sl_flashWREG->FEMUDMSW = FEE_TEST_DATA;
        sl_flashWREG->FEMUDLSW = FEE_TEST_DATA;

        /*ecc for the correct data*/
        ecc = sl_flashWREG->FEMUECC;
        /* Load corrupt data in FEMU_XXX regs single bit error */
        sl_flashWREG->FEMUDMSW = FEE_TEST_DATA;
        /* Flip a bit and generate single bit error*/
        if((FEE_ECC_TEST_MODE_2BIT_FAULT_INJECT == testType) || (FEE_ECC_TEST_MODE_2BIT == testType)){
            sl_flashWREG->FEMUDLSW = FEE_TEST_DATA ^ (0x3U<<(FEE_ERROR_POS));
        }else{
            sl_flashWREG->FEMUDLSW = FEE_TEST_DATA ^ BIT(FEE_ERROR_POS);
        }

        /* Set SECDED mode as fee as only fee is supported for this mode
         * and enable the Diagnosis*/
        sl_flashWREG->FDIAGCTRL = fdiagCtrl|F021F_FDIAGCTRL_DIAGECCSEL_FEE;
        sl_flashWREG->FEMUECC = ecc;
        /* Trigger the test */
#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
        sl_flashWREG->FDIAGCTRL |=F021F_FDIAGCTRL_DIAG_TRIG;

        if((FEE_ECC_DATA_CORR_MODE == testType) || (FEE_ECC_TEST_MODE_1BIT == testType)){
            /* Check the error flags, if single bit error and only one of ERR_ONE_FLG or ERR_ZERO_FLG is set */
        	/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        	/*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
            if((F021F_EE_STATUS_D_CORR_ERR_FLG == ((uint32)sl_flashWREG->EESTATUS & F021F_EE_STATUS_D_CORR_ERR_FLG)) &&
                    (GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_CORRERR) == (sl_esmREG->SR4[0] & GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_CORRERR))) &&
                    (((F021F_EE_STATUS_ERR_ZERO_FLG ==
                    		/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
                    		/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                    		/*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
                    		((uint32)sl_flashWREG->EESTATUS & F021F_EE_STATUS_ERR_ZERO_FLG))    &&
                        (!(F021F_EE_STATUS_ERR_ONE_FLG ==
                        		/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
                        		/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                        		/*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
                        		((uint32)sl_flashWREG->EESTATUS & F021F_EE_STATUS_ERR_ONE_FLG))))
                        ||
                        ((!(F021F_EE_STATUS_ERR_ZERO_FLG ==
                        		/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
                        		/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                        		/*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
                        		((uint32)sl_flashWREG->EESTATUS & F021F_EE_STATUS_ERR_ZERO_FLG)))    &&
                                (F021F_EE_STATUS_ERR_ONE_FLG ==
                                		/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
                                		/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                                		/*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
                                		((uint32)sl_flashWREG->EESTATUS & F021F_EE_STATUS_ERR_ONE_FLG)))) &&
                                        (FEE_ERROR_POS ==
                                        		/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
                                        		/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                                        		/*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
                                        		((uint32)sl_flashWREG->EECORRERRPOS & F021F_EECORRERRPOS_MASK))){
                    *fee_stResult = ST_PASS;
                }
            else{
                *fee_stResult = ST_FAIL;
            }
            /*Clear the status set during the test*/
            sl_flashWREG->EESTATUS |= F021F_EE_STATUS_D_CORR_ERR_FLG|
                                    F021F_EE_STATUS_ERR_ZERO_FLG|
                                    F021F_EE_STATUS_ERR_ONE_FLG;
            sl_esmREG->SR4[0] = GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_CORRERR);
        }
        else if(FEE_ECC_TEST_MODE_2BIT == testType){
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        	/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
        	/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
        	/*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
            if((F021F_EE_STATUS_D_UNC_ERR_FLG == ((uint32)sl_flashWREG->EESTATUS & F021F_EE_STATUS_D_UNC_ERR_FLG)) &&
                    ((F021F_EE_STATUS_UNC_ERR_FLG ==
                    		/*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
                    		((uint32)sl_flashWREG->EESTATUS & F021F_EE_STATUS_UNC_ERR_FLG)))
                    && (sl_flashWREG->EEUNCERRADD == (ADDR_DATA_MSW & F021F_EEUNCERRADD_MASK))
                    && (GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_UNCORRERR) == (sl_esmREG->SR4[0] & GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_UNCORRERR)))){
                *fee_stResult = ST_PASS;
                /*Clear the status set during the test*/
                sl_flashWREG->EESTATUS |= F021F_EE_STATUS_D_UNC_ERR_FLG|
                                        F021F_EE_STATUS_UNC_ERR_FLG;
                sl_esmREG->SR4[0] = GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_UNCORRERR);
            }
            else{
                *fee_stResult = ST_FAIL;
            }
        }
        else
        {
            *fee_stResult = ST_FAIL;
        }
        retVal = TRUE;
        /* Clear the diag mode settings */
        sl_flashWREG->FDIAGCTRL &=~(F021F_FDCTRL_DMODE_DATA_CORR|F021F_FDIAGCTRL_DIAG_EN_MASK); /* Clear Diagnostics enable key */
        sl_flashWREG->FDIAGCTRL = regBckupFdiagctrl;
        /* Read and unfreeze error reporting */
        flashread=sl_flashWREG->EEUNCERRADD;
        flashread=sl_flashWREG->EECORRERRADD;

