pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
        /*Restore grp1 esm interrupt enable*/
        sl_esmREG->IESR4 = regBkupIntEnaSet;
        sl_esmREG->IEPSR4 = regBckupErrInfulence;
        break;

    case FEE_ECC_SYN_REPORT_MODE:
        regBckupFdiagctrl = sl_flashWREG->FDIAGCTRL;
        /*  Clear all the status errors*/
        sl_flashWREG->EESTATUS |= ~0;
        /* Clear this to unfree error reporting */
        flashread=sl_flashWREG->EEUNCERRADD;
        /*load FEMU_XX regs in order to generate ecc and use it for next operations*/
        sl_flashWREG->FEMUADDR=ADDR_DATA_MSW;
        fdiagCtrl |= F021F_FDIAGCTRL_DMODE_SYN_RPT;
        sl_flashWREG->FEMUDMSW = FEE_TEST_DATA;
        sl_flashWREG->FEMUDLSW = FEE_TEST_DATA;
        /* Store ECC*/
        ecc = sl_flashWREG->FEMUECC;

        sl_flashWREG->FEMUDMSW = FEE_TEST_DATA;
        sl_flashWREG->FEMUDLSW = FEE_TEST_DATA ^ BIT(FEE_ERROR_POS);
        /* Calculate the Syndrome value */
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        syndrome = ecc ^ sl_flashWREG->FEMUECC;

        /* Set the data back to the original data */
        sl_flashWREG->FEMUDMSW = FEE_TEST_DATA;
        sl_flashWREG->FEMUDLSW = FEE_TEST_DATA;
        /* Set the FDIAGCTRL register*/
        /* Set SECDED mode as fee as only fee is supported for this mode */
        sl_flashWREG->FDIAGCTRL = fdiagCtrl|F021F_FDIAGCTRL_DIAGECCSEL_FEE;
        /* Introduce the single bit error corresponding to the calculated syndrome */
        sl_flashWREG->FEMUDMSW = FEE_TEST_DATA;
        sl_flashWREG->FEMUDLSW = FEE_TEST_DATA ^ BIT(FEE_ERROR_POS);
        /* Trigger the diagnosis */
        sl_flashWREG->FDIAGCTRL |=(F021F_FDIAGCTRL_DIAG_TRIG);
        /* Now the FEMUECC would contain the actual syndrome, as the mode is FLASH_ECC_SYN_REPORT_MODE
         * Check this value to the calculated syndrome, if it is match the diagnosis passes */
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        if((syndrome) == sl_flashWREG->FEMUECC){
            *fee_stResult = ST_PASS;
        }
        else
        {
            *fee_stResult = ST_FAIL;
        }
        /* Clear the diag mode settings */
        sl_flashWREG->FDIAGCTRL &=~(F021F_FDCTRL_DMODE_DATA_CORR|F021F_FDIAGCTRL_DIAG_EN_MASK); /* Clear Diagnostics enable key */
        sl_flashWREG->FDIAGCTRL = regBckupFdiagctrl;
        /*Clear the status set during the test*/
        sl_flashWREG->EESTATUS |= ~0;
        retVal = TRUE;
        /* Read and unfreeze error reporting */
        flashread=sl_flashWREG->EEUNCERRADD;
        break;

    case FEE_ECC_MALFUNCTION_MODE1:
        regBckupFdiagctrl = sl_flashWREG->FDIAGCTRL;
        /* Clear this to unfree error reporting */
        flashread=sl_flashWREG->EEUNCERRADD;

        /*Backup grp1 esm interrupt enable register and clear the interrupt enable */
        /*the esm interrupts for selftests which generate group 1 interrupts is blocked.Users will have to rely on
        status functions to get the pass/failure information*/        
        regBkupIntEnaSet = sl_esmREG->IESR4;
        regBckupErrInfulence = sl_esmREG->IEPSR4;
        if((FALSE) == _sl_fault_injection){
            sl_esmREG->IECR4 = GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_UNCORRERR);
            sl_esmREG->IEPCR4 = GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_UNCORRERR);
        }

        /* Set diagmode and SECDED mode as fee as only fee is supported for this mode */
        fdiagCtrl |= F021F_FDIAGCTRL_DMODE_MALFUNC1|F021F_FDIAGCTRL_DIAGECCSEL_FEE;
        /*  Clear all the status errors*/
        sl_flashWREG->EESTATUS |= (uint32)~0;

        /* Enable EDACMODE and put a non zero value is FRAWECC*/
        sl_flashWREG->FDIAGCTRL = fdiagCtrl;
        sl_flashWREG->FRAWECC = 1U;
#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
        /* Trigger the test */
        sl_flashWREG->FDIAGCTRL |=F021F_FDIAGCTRL_DIAG_TRIG;
        /* Check error */
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        /*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
        if((F021F_EE_STATUS_CME == ((uint32)sl_flashWREG->EESTATUS & F021F_EE_STATUS_CME))&&
            (GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_UNCORRERR) == (sl_esmREG->SR4[0] & GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_UNCORRERR)))){
            *fee_stResult = ST_PASS;
        }
        else
        {
            *fee_stResult = ST_FAIL;
        }
        /* Clear ESM bits */
        sl_esmREG->SR4[0] = GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_UNCORRERR);
        /* Clear the diag mode settings */
        sl_flashWREG->FDIAGCTRL &=~(F021F_FDCTRL_DMODE_DATA_CORR|F021F_FDIAGCTRL_DIAG_EN_MASK); /* Clear Diagnostics enable key */
        sl_flashWREG->FDIAGCTRL = regBckupFdiagctrl;
        /*Clear the status set during the test*/
        sl_flashWREG->EESTATUS |= ~0;
        retVal = TRUE;
        /* Read and unfreeze error reporting */
        flashread=sl_flashWREG->EEUNCERRADD;

        /*Restore grp1 esm interrupt enable*/
        sl_esmREG->IESR4 = regBkupIntEnaSet;
        sl_esmREG->IEPSR4 = regBckupErrInfulence;
        break;

    case FEE_ECC_MALFUNCTION_MODE2:
        regBckupFdiagctrl = sl_flashWREG->FDIAGCTRL;
        sl_flashWREG->FDIAGCTRL=0U;
        /* Read and unfreeze error reporting */
        flashread=sl_flashWREG->EEUNCERRADD;

        /*Backup grp1 esm interrupt enable register and clear the interrupt enable */
        /*the esm interrupts for selftests which generate group 1 interrupts is blocked.Users will have to rely on
        status functions to get the pass/failure information*/        
        regBkupIntEnaSet = sl_esmREG->IESR4;
        regBckupErrInfulence = sl_esmREG->IEPSR4;
        if((FALSE) == _sl_fault_injection){
            sl_esmREG->IECR4= GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_UNCORRERR);
            sl_esmREG->IEPCR4 = GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_UNCORRERR);
        }

        /* Set diagmode and SECDED mode as fee as only fee is supported for this mode */
        sl_flashWREG->FDIAGCTRL|= F021F_FDIAGCTRL_DIAGECCSEL_FEE;
        sl_flashWREG->FDIAGCTRL|= F021F_FDIAGCTRL_DMODE_MALFUNC2;

        /*  Clear all the status errors*/
        sl_flashWREG->EESTATUS |= ~0;

