pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
        /* Enable EDACMODE*/
        /*SAFETYMCUSW 9 S MR: 12.2 <APPROVED> Comment_10*/
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        BIT_SET(sl_flashWREG->FDIAGCTRL,F021F_FDIAGCTRL_DIAG_EN_KEY);
        /* Invert data for the ecc calculation and put zero in FRAWECC */
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        sl_flashWREG->FRAWDATAH = ~sl_flashWREG->FRAWDATAH;
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        sl_flashWREG->FRAWDATAL = ~sl_flashWREG->FRAWDATAL;
        sl_flashWREG->FRAWECC = 0U;
#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
        /* Trigger the test */
        sl_flashWREG->FDIAGCTRL |=F021F_FDIAGCTRL_DIAG_TRIG;

        /* Check Error */
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        /*SAFETYMCUSW 96 S MR: 6.2,10.1,10.2,12.1,12.6 <APPROVED> Comment_25*/
        if((F021F_EE_STATUS_CME == ((uint32)sl_flashWREG->EESTATUS & F021F_EE_STATUS_CME))&&
                (GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_UNCORRERR) == (sl_esmREG->SR4[0] & GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_UNCORRERR)))){
            *fee_stResult = ST_PASS;
        }
        else
        {
            *fee_stResult = ST_FAIL;
        }
        /* Clear ESM bits */
        sl_esmREG->SR4[0] = GET_ESM_BIT_NUM(ESM_G1ERR_EEPROM_UNCORRERR);
        /* Clear the diag mode settings */
        sl_flashWREG->FDIAGCTRL &=~(F021F_FDCTRL_DMODE_DATA_CORR|F021F_FDIAGCTRL_DIAG_EN_MASK); /* Clear Diagnostics enable key */
        sl_flashWREG->FDIAGCTRL = regBckupFdiagctrl;
        /*Clear the status set during the test*/
        sl_flashWREG->EESTATUS |= ~0;
        retVal = TRUE;
        /* Read and unfreeze error reporting */
        flashread=sl_flashWREG->EEUNCERRADD;
        /*Restore grp1 esm interrupt enable*/
        sl_esmREG->IESR4 = regBkupIntEnaSet;
        sl_esmREG->IEPSR4 = regBckupErrInfulence;
        break;
    default:
        retVal = FALSE;
        break;
    }
    /* If the test was fault injection and not self test, then do not mask the call back & clear the *
     *  FAULT_INJECTION flag for subsequent runs*/
    if((TRUE) == _sl_fault_injection){
            _sl_fault_injection=FALSE;
    }
#if(FUNC_RESULT_LOG_ENABLED == 1)
    /*SAFETYMCUSW 45 D MR:21.1 <APPROVED> Comment_14*/
    SL_Log_Result(FUNC_ID_ST_FLASH, testType, *fee_stResult , 0U);
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Stop_Profiling(testType);
#endif
    return(retVal);
}
#endif

/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
/*SAFETYMCUSW 62 D MR: 16.7 <APPROVED> Comment_17*/
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
boolean SL_SelfTest_PBIST (register SL_SelfTestType testType, register uint64 ramGroup, register uint32 algoInfo)
#else
boolean SL_SelfTest_PBIST (register SL_SelfTestType testType, register uint32 ramGroup, register uint32 algoInfo)
#endif
{
    register uint32 tempVal;
    register boolean retVal = FALSE;

#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if (0 != sl_pbistREG->PACT)
    {
        SL_Log_Error(FUNC_ID_ST_PBIST, ERR_TYPE_ENTRY_CON, 1u);
        retVal = FALSE;
        return retVal;
    }

    /*check for priveleged mode*/
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_PBIST, ERR_TYPE_ENTRY_CON, 0u);
        retVal =  FALSE;
        return retVal;
    }

    /* If nERROR is active then do not proceed with tests that trigger nERROR */
    if((TRUE) == SL_ESM_nERROR_Active()){
        SL_Log_Error(FUNC_ID_ST_PBIST, ERR_TYPE_ENTRY_CON, 2u);
        return(FALSE);
    }
#endif

#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /*SAFETYMCUSW 437 S MR: 17.3 <APPROVED> Comment_19*/
    if ((_SELFTEST_PBIST_MIN > testType) || (_SELFTEST_PBIST_MAX < testType)) {
        SL_Log_Error(FUNC_ID_ST_PBIST, ERR_TYPE_PARAM, 0u);
        retVal = FALSE;
        return retVal;
    }
    if (ALL_PBIST_RAM_GROUPS != (ALL_PBIST_RAM_GROUPS | ramGroup)) {
        SL_Log_Error(FUNC_ID_ST_PBIST, ERR_TYPE_PARAM, 1u);
        retVal = FALSE;
        return retVal;
    }
    if (ALL_PBISALGO != (ALL_PBISALGO | algoInfo)) {
        SL_Log_Error(FUNC_ID_ST_PBIST, ERR_TYPE_PARAM, 2u);
        retVal = FALSE;
        return retVal;
    }
#endif
    switch(testType) {
        case PBIST_EXECUTE:
        case PBIST_EXECUTE_OVERRIDE:
            /* PBIST ROM clock frequency = HCLK frequency /2 */
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
            /*SAFETYMCUSW 9 S MR: 12.2 <APPROVED> Comment_10*/
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            BF_SET(sl_systemREG1->MSTGCR,ROM_CLK_SRC_HCKL_DIV_2,BF_ROM_DIV_START,BF_ROM_DIV_LENGTH);
            /* Enable PBIST controller */
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
            sl_systemREG1->MSINENA = SYSREG1_MSINENA_MSIENA;
            /* Enable PBIST Contrlller */
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
            /*SAFETYMCUSW 9 S MR: 12.2 <APPROVED> Comment_10*/
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            BF_SET(sl_systemREG1->MSTGCR,ENABLE_MEM_STEST_CTRL,BF_MSTGENA_START,BF_MSTGENA_LENGTH);
            /* Wait for 32 VBUS Clocks */
            for (tempVal=0u; tempVal<(VBUS_CLK_CYCLES + (VBUS_CLK_CYCLES * 1u)); tempVal++)
            {

            }
            /* Enable PBIST clocks and ROM clock */
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
            sl_pbistREG->PACT = (PBIST_PACT_PACT1 | PBIST_PACT_PACT0);
            /* Select the algorithms */
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
            sl_pbistREG->ALGO = algoInfo;
            if (PBIST_EXECUTE_OVERRIDE == testType) {
                /* Override RINFOx with ROM contents */
                /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
                sl_pbistREG->OVER = ENABLE_OVERRIDE;
            }
            else {
                /* Select RAM groups */
                /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
                sl_pbistREG->RINFOL = (uint32)(ramGroup&0xFFFFFFFFu);
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
                /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
                sl_pbistREG->RINFOU = 0x00000000u; /* No RAM group between 33-64 */
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
                sl_pbistREG->RINFOU = (uint32)((ramGroup>>32)&0xFFFFFFFFu); /* No RAM group between 33-64 */
#endif
                /* Do not override RINFOx with ROM contents */
                /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
                 sl_pbistREG->OVER = DISABLE_OVERRIDE;
            }
            /* Algorithm code is loaded from ROM */
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
            sl_pbistREG->ROM = ALG_RAM_FROM_ROM;
            /* Start PBIST */
            /* Note: If executing on TCM RAM, Stack Contents are corrupted, so be careful with return data */
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
            sl_pbistREG->DLR = (PBIST_DLR_DLR4 | PBIST_DLR_DLR2);
            retVal = TRUE;
         break;
        default:
            break;
    }
#if(FUNC_RESULT_LOG_ENABLED == 1)
    SL_Log_Result(FUNC_ID_ST_PBIST, testType, (SL_SelfTest_Result)retVal , 0u);
#endif
    return(retVal);
}


