pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_SelfTest_Status_PBIST(SL_PBIST_FailInfo * param1)
{
#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /*LDRA_INSPECTWINDOW 50 */
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    if (FALSE == CHECK_RANGE_RAM_PTR(param1)) {
        SL_Log_Error(FUNC_ID_ST_PBIST_STATUS, ERR_TYPE_PARAM, 0u);
        return FALSE;
    }
#endif

#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /*check for priveleged mode*/
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_PBIST_STATUS, ERR_TYPE_ENTRY_CON, 0u);
        return FALSE;
    }
#endif
        /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        if ((sl_systemREG1->MSTCGSTAT & 0x1u) == 0x0u)
        {
           return FALSE;
        }
        else
        {
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
        	/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            if ((sl_pbistREG->FSRF0 == 0u) && (sl_pbistREG->FSRF1 == 0u)) {
                /* Return PASS*/
                param1->stResult             = ST_PASS;
                param1->port0FailCount         = 0u;
                param1->port1FailCount         = 0u;
                param1->port0FailAddress    = 0u;
                param1->port1FailAddress    = 0u;
                param1->port0FailData       = 0u;
                param1->port1FailData       = 0u;
            } else {
                /* Store the failure data in OUT params */
                param1->stResult            = ST_FAIL;
                /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
                /*SAFETYMCUSW 439 S MR: 11.3 <APPROVED> "The base address of the peripheral registers are actually macros" */
                /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                param1->port0FailCount      = (uint8) (sl_pbistREG->FSRC0 & 0xFFu);
                /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
                /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                param1->port1FailCount      = (uint8) (sl_pbistREG->FSRC1 & 0xFFu);
                /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
                /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                param1->port0FailAddress    = (uint16) (sl_pbistREG->FSRA0 & 0xFFFFu);
                /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
                /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                param1->port1FailAddress    = (uint16) (sl_pbistREG->FSRA1 & 0xFFFFu);
                /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
                param1->port0FailData       = sl_pbistREG->FSRDL0;
                /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
                param1->port1FailData       = sl_pbistREG->FSRDL1;
            }
        /* Stop the PBIST */
        SL_SelfTest_PBIST_StopExec();
#if(FUNC_RESULT_LOG_ENABLED == 1)
        /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
        SL_Log_Result(FUNC_ID_ST_PBIST_STATUS, (SL_SelfTestType)0, param1->stResult, 0u);
#endif
        }
    return TRUE;
}

/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_SelfTest_WaitCompletion_PBIST(void)
{
    register boolean retVal = FALSE;
    /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if ((sl_systemREG1->MSTCGSTAT & 0x1u) == 0x1u) {
        /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
        sl_systemREG1->MSTCGSTAT = 0x1u;
        retVal = TRUE;
    } else {
        retVal = FALSE;
    }
    return retVal;
}

/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
boolean SL_SelfTest_PBIST_StopExec(void)
{
    /* Stop the PBIST */
    /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    sl_pbistREG->PACT = 0x0u;
    /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    /*SAFETYMCUSW 9 S MR: 12.2 <APPROVED> Comment_10*/
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    BF_SET(sl_systemREG1->MSTGCR,DISABLE_MEM_STEST_CTRL,BF_MINITGENA_START,BF_MINITGENA_LENGTH);
    return(TRUE);
}

/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_SelfTest_STC(register SL_SelfTestType testType, register boolean bMode, register SL_STC_Config * config)
{
    register uint32 tempVal = 0U;
    boolean retval = FALSE;

#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /* Verify that the parameters are in rage */
    /*LDRA_INSPECTWINDOW 50 */
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    /*SAFETYMCUSW 437 S MR: 17.3 <APPROVED> Comment_19*/
    if ((_SELFTEST_STC_MIN > testType) || (_SELFTEST_STC_MAX < testType)||
            !CHECK_RANGE_RAM_PTR(config)) {
        SL_Log_Error(FUNC_ID_ST_STC, ERR_TYPE_PARAM, 0U);
        retval = FALSE;
        return(retval);
    }
    /* Error if interval count is greater than supported */
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    if(config->intervalCount>STC_MAX_INTERVALS)
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
    if(config->intervalCount>STC1_MAX_INTERVALS)
#endif
    {
        SL_Log_Error(FUNC_ID_ST_STC, ERR_TYPE_PARAM, 0U);
        retval = FALSE;
        return(retval);
    }
    if(config->stcClockDiv>STC_MAX_CLOCK_DIV){
        SL_Log_Error(FUNC_ID_ST_STC, ERR_TYPE_PARAM, 0U);
        retval = FALSE;
        return(retval);
    }
#endif
#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /* Error if not in privilege mode */
        if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
            SL_Log_Error(FUNC_ID_ST_STC, ERR_TYPE_ENTRY_CON, 2U);
            retval = FALSE;
            return(retval);
    }

    /* If nERROR is active then do not proceed with tests that trigger nERROR */
    if((TRUE) == SL_ESM_nERROR_Active()){
        SL_Log_Error(FUNC_ID_ST_STC, ERR_TYPE_ENTRY_CON, 3U);
        return(FALSE);
    }
#endif

    /* Configure the clock divider */
    sl_systemREG2->STCCLKDIV = ((config->stcClockDiv & 0x07u) << 24);

