pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
    /* Configure the interval count & restart/continue */
    tempVal = 0U;
    tempVal |= ((uint32)config->intervalCount << STC_STCGCR0_INTCOUNT_START);
    if (TRUE == config->restartInterval0) {
        tempVal |= STC_STCGCR0_RS_CNT;
    }
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    sl_stcREG->STCGCR0 = tempVal;

    /* If in compare selfcheck (fault injection) mode then setup STCSCSCR */
    if (STC_COMPARE_SELFCHECK == testType) {
        sl_stcREG->STCSCSCR = (uint32)(STC_STCSCSCR_FAULT_INS|STC_STCSCSCR_SELF_CHECK_KEY);
    }

    /* Setup the timeout value */
    sl_stcREG->STCTPR = config->timeoutCounter;

    /* Enable STC run */
    sl_stcREG->STCGCR1 = STC_STCGCR1_STC_ENA;
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)

    sl_stcREG1->STCGCR0 = tempVal;

    /* If in compare selfcheck (fault injection) mode then setup STCSCSCR */
    if (STC1_COMPARE_SELFCHECK == testType) {
        sl_stcREG1->STCSCSCR = (uint32)(STC_STCSCSCR_FAULT_INS|STC_STCSCSCR_SELF_CHECK_KEY);
    }

    /* Setup the timeout value */
    sl_stcREG1->STCTPR = config->timeoutCounter;

    /* Segment 0 core select - to be run in parallel */
    BF_SET(sl_stcREG1->STCGCR1, STC_GCR1_SEG0_CORE_PARLL, STC_GCR1_SEG0_CORE_SEL_START, STC_GCR1_SEG0_CORE_SEL_LENGTH);

    /* Enable STC run */
    sl_stcREG1->STCGCR1 = STC_STCGCR1_STC_ENA;
#endif
    for (tempVal=0u; tempVal<32u; tempVal++) {
    }
#if(FUNC_RESULT_LOG_ENABLED == 1)
    /* The system goes into reset after the test, and the result of the test has to be found out from there
     * Now logging the value of result as 0xEF which denotes 'do not know'state
     */
    SL_Log_Result(FUNC_ID_ST_STC,testType, (SL_SelfTest_Result)0xEFU , 0u);
#endif
    /* Kick off the STC execution */
    _SL_Kickoff_STC_execution();

    /* Execution never comes here !!! */
    retval = TRUE;
    return (retval);
}

/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_SelfTest_Status_STC (SL_STC_FailInfo * failInfostc)
{
    boolean retVal = FALSE;
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if (STC_STCGSTAT_TEST_DONE == (STC_STCGSTAT_TEST_DONE & sl_stcREG->STCGSTAT)) 
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if (STC_STCGSTAT_TEST_DONE == (STC_STCGSTAT_TEST_DONE & sl_stcREG1->STCGSTAT)) 
#endif
    {
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        retVal = TRUE;/* Test was completed */

        /* Get test results */
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        if (STC_STCGSTAT_TEST_FAIL == (STC_STCGSTAT_TEST_FAIL & sl_stcREG->STCGSTAT)) {
            /* Test completed & failed */
            failInfostc->stResult = ST_FAIL;
            /* Clear the error */
            sl_stcREG->STCGSTAT = STC_STCGSTAT_TEST_FAIL;
        }
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        retVal = TRUE;/* Test was completed */
            /* Get test results */
        if (STC_STCGSTAT_TEST_FAIL == (STC_STCGSTAT_TEST_FAIL & sl_stcREG1->STCGSTAT)) {
            /* Test completed & failed */
            failInfostc->stResult = ST_FAIL;
            /* Clear the error */
            sl_stcREG1->STCGSTAT = STC_STCGSTAT_TEST_FAIL;
        }
#endif
        else {
            /* Test completed & passed */
            failInfostc->stResult = ST_PASS;
        }
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        if (STC_STCFSTAT_CPU1_FAIL == (STC_STCFSTAT_CPU1_FAIL & sl_stcREG->STCFSTAT)) {
            sl_stcREG->STCFSTAT = STC_STCFSTAT_CPU1_FAIL;
            failInfostc->CPU1Failure = ST_PASS;
        }
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        if (STC_STCFSTAT_CPU1_FAIL == (STC_STCFSTAT_CPU1_FAIL & sl_stcREG1->STCFSTAT)) {
            sl_stcREG1->STCFSTAT = STC_STCFSTAT_CPU1_FAIL;
            failInfostc->CPU1Failure = ST_PASS;
        }
#endif
        else {
            failInfostc->CPU1Failure = ST_FAIL;
        }
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        if (STC_STCFSTAT_CPU2_FAIL == (STC_STCFSTAT_CPU2_FAIL & sl_stcREG->STCFSTAT)) {
            sl_stcREG->STCFSTAT = STC_STCFSTAT_CPU2_FAIL;
            failInfostc->CPU2Failure = ST_PASS;
        }
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        if (STC_STCFSTAT_CPU2_FAIL == (STC_STCFSTAT_CPU2_FAIL & sl_stcREG1->STCFSTAT)) {
            sl_stcREG1->STCFSTAT = STC_STCFSTAT_CPU2_FAIL;
            failInfostc->CPU2Failure = ST_PASS;
        }
#endif
        else {
            failInfostc->CPU2Failure = ST_FAIL;
        }
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        if (STC_STCFSTAT_TO_ERR == (STC_STCFSTAT_TO_ERR & sl_stcREG->STCFSTAT)) {
            sl_stcREG->STCFSTAT = STC_STCFSTAT_TO_ERR;
            failInfostc->TimeOutFailure = ST_PASS;
        }
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        if (STC_STCFSTAT_TO_ERR == (STC_STCFSTAT_TO_ERR & sl_stcREG1->STCFSTAT)) {
            sl_stcREG1->STCFSTAT = STC_STCFSTAT_TO_ERR;
            failInfostc->TimeOutFailure = ST_PASS;
        }
#endif
        else {
            failInfostc->TimeOutFailure = ST_FAIL;
        }
    } else {
        /* Test did not complete */
        retVal = FALSE;
    }

