pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
    return(retVal);
}

/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_)
boolean SL_SelfTest_PSCON(SL_SelfTestType testType, boolean mode, SL_PSCON_FailInfo * param1)
{
    register boolean retVal = TRUE;
    register uint32 regBkupIntEnaSet, regBckupErrInfulence;
    uint32 regbackup;

#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /* Verify that the parameters are in rage */
    /*LDRA_INSPECTWINDOW 50 */
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    if ((_SELFTEST_PSCON_MIN > testType) || (_SELFTEST_PSCON_MAX < testType) || !CHECK_RANGE_RAM_PTR(param1)) {
        SL_Log_Error(FUNC_ID_ST_PSCON, ERR_TYPE_PARAM, 0U);
            return(FALSE);
    }
#endif
#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /* Error if not in privilege mode */
    if ((PSCON_PMA_TEST != testType) && (ARM_MODE_USR == _SL_Get_ARM_Mode())) {
        SL_Log_Error(FUNC_ID_ST_PSCON, ERR_TYPE_ENTRY_CON, 2U);
        return(FALSE);
    }
    if ((PSCON_PMA_TEST == testType) && (ARM_MODE_USR != _SL_Get_ARM_Mode())) {
            SL_Log_Error(FUNC_ID_ST_PSCON, ERR_TYPE_ENTRY_CON, 2U);
            return(FALSE);
    }


    /* If nERROR is active then do not proceed with tests that trigger nERROR */
    if((TRUE) == SL_ESM_nERROR_Active()){
        SL_Log_Error(FUNC_ID_ST_PSCON, ERR_TYPE_ENTRY_CON, 3U);
        return(FALSE);
    }
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Start_Profiling(testType);
#endif
    retVal = TRUE;
    switch(testType) {
        case PSCON_SELF_TEST:
            /*flag is set to indicate the current test which is ongoing and
            These flags are used in the sl_esm.c so as to mask the esm callback*/  
        	SL_FLAG_SET(PSCON_SELF_TEST);
            sl_pmmREG->PRCKEYREG = PMM_PRCKEYREG_MKEY_ST_MODE;
            if ((TRUE) == mode) {
                /* Wait for the self-test to complete & get results*/
                /*SAFETYMCUSW 28 D <APPROVED> Comment_13*/
                while (TRUE != SL_SelfTest_Status_PSCON(param1)) {
                }
            }
            break;

        case PSCON_ERROR_FORCING:
        case PSCON_ERROR_FORCING_FAULT_INJECT:
            /*Backup grp1 esm interrupt enable register and clear the interrupt enable */
        /*the esm interrupts for selftests which generate group 1 interrupts is blocked.Users will have to rely on
        status functions to get the pass/failure information*/        
            regBkupIntEnaSet = sl_esmREG->IESR4;
            regBckupErrInfulence = sl_esmREG->IEPSR4;
            if(PSCON_ERROR_FORCING == testType){
                /*flag is set to indicate the current test which is ongoing and
               These flags are used in the sl_esm.c so as to mask the esm callback*/
            	SL_FLAG_SET(PSCON_ERROR_FORCING);
                sl_esmREG->IECR4 = GET_ESM_BIT_NUM(ESM_G1ERR_PSCON_COMPARE_ERR);
                sl_esmREG->IEPCR4 = GET_ESM_BIT_NUM(ESM_G1ERR_PSCON_COMPARE_ERR);
                sl_esmREG->IECR4 = GET_ESM_BIT_NUM(ESM_G1ERR_PSCON_SELTEST_ERR);
                sl_esmREG->IEPCR4 = GET_ESM_BIT_NUM(ESM_G1ERR_PSCON_SELTEST_ERR);
            }
            else
            {
                /*flag is set to indicate the current test which is ongoing and
                These flags are used in the sl_esm.c so as to mask the esm callback*/
            	SL_FLAG_SET(PSCON_ERROR_FORCING_FAULT_INJECT);
            }
#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
            sl_pmmREG->PRCKEYREG = PMM_PRCKEYREG_MKEY_ERRFCG_MODE;
            if(PSCON_ERROR_FORCING == testType)
            {
                if (GET_ESM_BIT_NUM(ESM_G1ERR_PSCON_COMPARE_ERR) == (sl_esmREG->SR4[0] & GET_ESM_BIT_NUM(ESM_G1ERR_PSCON_COMPARE_ERR))) {
                    sl_esmREG->SR4[0] = GET_ESM_BIT_NUM(ESM_G1ERR_PSCON_COMPARE_ERR);
                    sl_esmREG->SR4[0] = GET_ESM_BIT_NUM(ESM_G1ERR_PSCON_SELTEST_ERR);
                    param1->stResult = ST_PASS;
                } else {
                    param1->stResult = ST_FAIL;
                }
                /*clear the flags which indicate tests ongoing*/
                SL_FLAG_CLEAR(PSCON_ERROR_FORCING);
            }
            else
            {
            /*clear the flags which indicate tests ongoing*/
            	SL_FLAG_CLEAR(PSCON_ERROR_FORCING_FAULT_INJECT);
            }
            /*Restore grp1 esm interrupt enable*/
            sl_esmREG->IESR4 = regBkupIntEnaSet;
            sl_esmREG->IEPSR4 = regBckupErrInfulence;
            /* Revert to normal operation */
            sl_pmmREG->PRCKEYREG = PMM_PRCKEYREG_MKEY_LKSTEP_MODE;
            break;

        case PSCON_SELF_TEST_ERROR_FORCING:
        case PSCON_SELF_TEST_ERROR_FORCING_FAULT_INJECT:
            /*Backup grp1 esm interrupt enable register and clear the interrupt enable */
             /*the esm interrupts for selftests which generate group 1 interrupts is blocked.Users will have to rely on
            status functions to get the pass/failure information*/        
            regBkupIntEnaSet = sl_esmREG->IESR4;
            regBckupErrInfulence = sl_esmREG->IEPSR4;
            if(PSCON_SELF_TEST_ERROR_FORCING ==  testType){
                /*flag is set to indicate the current test which is ongoing and
                These flags are used in the sl_esm.c so as to mask the esm callback*/
            	SL_FLAG_SET(PSCON_SELF_TEST_ERROR_FORCING);
                sl_esmREG->IECR4 = GET_ESM_BIT_NUM(ESM_G1ERR_PSCON_SELTEST_ERR);
                sl_esmREG->IEPCR4 = GET_ESM_BIT_NUM(ESM_G1ERR_PSCON_SELTEST_ERR);
            }
            else
            {
                /*flag is set to indicate the current test which is ongoing and
                These flags are used in the sl_esm.c so as to mask the esm callback*/ 
            	SL_FLAG_SET(PSCON_SELF_TEST_ERROR_FORCING_FAULT_INJECT);
            }
#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
            sl_pmmREG->PRCKEYREG = PMM_PRCKEYREG_MKEY_STERRF_MODE;
            if(PSCON_SELF_TEST_ERROR_FORCING == testType)
            {
                if (GET_ESM_BIT_NUM(ESM_G1ERR_PSCON_SELTEST_ERR) == (sl_esmREG->SR4[0] & GET_ESM_BIT_NUM(ESM_G1ERR_PSCON_SELTEST_ERR))) {
                    sl_esmREG->SR4[0] = GET_ESM_BIT_NUM(ESM_G1ERR_PSCON_SELTEST_ERR);
                    param1->stResult = ST_PASS;
                } else {
                    param1->stResult = ST_FAIL;
                }
                /*clear the flags which indicate tests ongoing*/
                SL_FLAG_CLEAR(PSCON_SELF_TEST_ERROR_FORCING);
            }
            else
            {
            /*clear the flags which indicate tests ongoing*/
            	SL_FLAG_CLEAR(PSCON_SELF_TEST_ERROR_FORCING_FAULT_INJECT);
            }
            /*Restore grp1 esm interrupt enable*/
            sl_esmREG->IESR4 = regBkupIntEnaSet;
            sl_esmREG->IEPSR4 = regBckupErrInfulence;
            /* Revert to normal operation */
            sl_pmmREG->PRCKEYREG = PMM_PRCKEYREG_MKEY_LKSTEP_MODE;
            break;

        case PSCON_PMA_TEST:
            /* Make sure we are in non-privilege (user) mode */
            if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
                retVal = TRUE;
                regbackup = sl_pmmREG->PRCKEYREG;
                /*flag is set to indicate the current test which is ongoing and
                These flags are used in the sl_esm.c so as to mask the esm callback*/
                SL_FLAG_SET(PSCON_PMA_TEST);
#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
                /* Try writing to GLOBALCTRL1.AUTO_CLK_WAKE_ENA, which should result in an abort*/
                sl_pmmREG->PRCKEYREG = 0x0000000FU;
                /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                if(regbackup == sl_pmmREG->PRCKEYREG)
                {
                    param1->stResult = ST_PASS;
                }
                else
                {
                    param1->stResult = ST_FAIL;
                }
            } else {
                /* Error, must be in user mode to run this test */
                retVal = FALSE;
            }
            /*clear the flags which indicate tests ongoing*/
            SL_FLAG_CLEAR(PSCON_PMA_TEST);
            /* Revert to normal operation */
            sl_pmmREG->PRCKEYREG = PMM_PRCKEYREG_MKEY_LKSTEP_MODE;
            break;

        default:
            /* Revert to normal operation */
            sl_pmmREG->PRCKEYREG = PMM_PRCKEYREG_MKEY_LKSTEP_MODE;
            break;
    }
#if(FUNC_RESULT_LOG_ENABLED == 1)
    SL_Log_Result(FUNC_ID_ST_PSCON, testType, param1->stResult , 0U);
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Stop_Profiling(testType);
#endif
    return(retVal);
}
#endif

