pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_)
boolean SL_SelfTest_Status_PSCON (SL_PSCON_FailInfo * param1)
{
    boolean retVal = FALSE;
    /*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
    /*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
    /*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if ((PMM_PSCON_LPDDCSTAT1_LSTC != ((uint32)(PMM_PSCON_LPDDCSTAT1_LSTC & sl_pmmREG->LPDDCSTAT1))) &&
            (PMM_PSCON_MPDDCSTAT1_MSTC != ((uint32)(PMM_PSCON_MPDDCSTAT1_MSTC & sl_pmmREG->MPDDCSTAT1)))){
        retVal = FALSE;
    } else {
        /* If one of the Power or Memory domains have failed, mark the ST as failure */
    	/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
    	/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
    	/*SAFETYMCUSW 408 S MR:12.4 <APPROVED> Comment_12*/
    	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        if  ((0u == (PMM_PSCON_LPDDCSTAT2_LSTE & sl_pmmREG->LPDDCSTAT2)) &&
                (0u == (PMM_PSCON_MPDDCSTAT2_MSTE & sl_pmmREG->MPDDCSTAT2))) {
            param1->stResult = ST_PASS;
        } else {
            param1->stResult = ST_FAIL;
        }

        param1->pdFailure = sl_pmmREG->LPDDCSTAT2;
        param1->mdFailure = sl_pmmREG->MPDDCSTAT2;
        /*clear the flags which indicate tests ongoing*/
        SL_FLAG_CLEAR(PSCON_SELF_TEST);
        /* Revert to normal operation */
        sl_pmmREG->PRCKEYREG = PMM_PRCKEYREG_MKEY_LKSTEP_MODE;
        retVal = TRUE;
    }
    return(retVal);
}
#endif

/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_SelfTest_EFuse (SL_SelfTestType testType, boolean bMode, SL_EFuse_Config * config)
{
    uint32 regBkup;
    volatile uint32 regBkupIntEnaSet, regBckupErrInfulence;
    volatile boolean _sl_fault_injection = FALSE;
    boolean retVal = FALSE;
#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /* Verify that the parameters are in range */
    /*LDRA_INSPECTWINDOW 50 */
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    if ((_SELFTEST_EFUSE_MIN > testType) || (_SELFTEST_EFUSE_MAX < testType) || !CHECK_RANGE_RAM_PTR(config)){
        SL_Log_Error(FUNC_ID_ST_EFUSE, ERR_TYPE_PARAM, 0U);
        return(FALSE);
    }
#endif
#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_EFUSE, ERR_TYPE_ENTRY_CON, 2U);
        retVal =  FALSE;
        return(FALSE);
    }
    /* If nERROR is active then do not proceed with tests that trigger nERROR */
    if((TRUE) == SL_ESM_nERROR_Active()){
        SL_Log_Error(FUNC_ID_ST_EFUSE, ERR_TYPE_ENTRY_CON, 3U);
        return(FALSE);
    }
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Start_Profiling(testType);
#endif

    switch(testType) {
    case EFUSE_SELF_TEST_AUTOLOAD:
        /* \todo */
        retVal = FALSE;
        break;

    case EFUSE_SELF_TEST_ECC:
        retVal = TRUE; /* Inputs are fine. Tests are run :) */
        /*flag is set to indicate the current test which is ongoing and
        These flags are used in the sl_esm.c so as to mask the esm callback*/
        SL_FLAG_SET(EFUSE_SELF_TEST_ECC);
        /* Configure the self-test parameters */
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        sl_efcREG->SELF_TEST_CYCLES = config->numPatterns;
        sl_efcREG->SELF_TEST_SIGN   = config->seedSignature;
        /* Kick off the self-test */
        sl_efcREG->BOUNDARY = EFC_BOUNDARY_INPUT_EN | EFC_BOUNDARY_SELF_TEST_EN;
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        sl_efcREG->ST_CY = config->numPatterns;
        sl_efcREG->ST_SIG   = config->seedSignature;
        /* Kick off the self-test */
        sl_efcREG->BOUND = EFC_BOUNDARY_INPUT_EN | EFC_BOUNDARY_SELF_TEST_EN;
#endif
        /* If mode is synchronous, update the result now*/
        if((TRUE)==bMode){
            /*SAFETYMCUSW 28 D <APPROVED> Comment_13*/
            while((TRUE) != SL_SelfTest_Status_EFuse(&config->failInfo)){}
        }
        break;

    case EFUSE_SELF_TEST_STUCK_AT_ZERO:
        retVal = TRUE; /* Inputs are fine. Tests are run :) */
        /*Backup grp1 esm interrupt enable register and clear the interrupt enable */
        /*the esm interrupts for selftests which generate group 1 interrupts is blocked.Users will have to rely on
        status functions to get the pass/failure information*/        
        regBkupIntEnaSet = sl_esmREG->IESR4;
        regBckupErrInfulence = sl_esmREG->IEPSR4;
        sl_esmREG->IECR4 = GET_ESM_BIT_NUM(ESM_G1ERR_EFUSE_SELTEST_ERR);
           sl_esmREG->IEPCR4 = GET_ESM_BIT_NUM(ESM_G1ERR_EFUSE_SELTEST_ERR);

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        regBkup = (sl_efcREG->BOUNDARY);
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        regBkup = (sl_efcREG->BOUND);
#endif
        /* Enable the output for errors */
#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        sl_efcREG->BOUNDARY = (ST_BOUNDARY_VALUE | EFC_BOUNDARY_OUTPUT_EN);
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        sl_efcREG->BOUND = (ST_BOUNDARY_VALUE | EFC_BOUNDARY_OUTPUT_EN);
#endif
        /* Check the efuse controller output for the above error outputs */
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        if (ST_PIN_VALUE == (ST_PIN_VALUE & sl_efcREG->PINS)) {
            /* If all outputs are set, then test has passed */
            config->failInfo.stResult = ST_PASS;
        } else {
            /* One or more ouputs is/are stuck at zero !! return error */
            config->failInfo.stResult = ST_FAIL;
        }
        /* Clear interrupts & Error Pins only for this event but only if this is the only event */
        if ((uint32) (1u << ESM_G3ERR_EFUSE_AUTOLOAD_ERR) == (uint32) (sl_esmREG->SR1[2] & (1u << ESM_G3ERR_EFUSE_AUTOLOAD_ERR))) {
            _SL_HoldNClear_nError();
        }

        /* Clear any ESM interrupts */
        sl_esmREG->SR4[0] = GET_ESM_BIT_NUM(ESM_G1ERR_EFUSE_ERR_OTHER)|GET_ESM_BIT_NUM(ESM_G1ERR_EFUSE_SELTEST_ERR);
        sl_esmREG->SR1[2] = GET_ESM_BIT_NUM(ESM_G3ERR_EFUSE_AUTOLOAD_ERR); /* \todo Should clear the ESMKEYR if this event is configured for nERROR */
        /*Restore grp1 esm interrupt enable*/
        sl_esmREG->IESR4 = regBkupIntEnaSet;
        sl_esmREG->IEPSR4 = regBckupErrInfulence;

        /* Restore boundary register */
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
        sl_efcREG->BOUNDARY = regBkup;
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
        sl_efcREG->BOUND = regBkup;
#endif
        break;
    default:
        break;
    }
#if(FUNC_RESULT_LOG_ENABLED == 1)
    SL_Log_Result(FUNC_ID_ST_EFUSE, testType, config->failInfo.stResult , 0U);
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Stop_Profiling(testType);
#endif
    return(retVal);
}


