pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_SelfTest_Status_EFuse (SL_EFuse_FailInfo * failInfoefuse)
{
    boolean retVal = FALSE;

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if ((uint32) (EFC_BOUNDARY_INPUT_EN | EFC_BOUNDARY_SELF_TEST_EN)
            == (uint32) (sl_efcREG->BOUNDARY & (EFC_BOUNDARY_INPUT_EN | EFC_BOUNDARY_SELF_TEST_EN))) 
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if ((uint32) (EFC_BOUNDARY_INPUT_EN | EFC_BOUNDARY_SELF_TEST_EN)
            == (uint32) (sl_efcREG->BOUND & (EFC_BOUNDARY_INPUT_EN | EFC_BOUNDARY_SELF_TEST_EN))) 
#endif
    {
        /** ECC Self test has been enabled, check the results accordingly */
    	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        if (EFC_PINS_SELF_TEST_DONE == (uint32) (sl_efcREG->PINS & EFC_PINS_SELF_TEST_DONE)) {
            /* self test is complete */
            retVal = TRUE;
            /* Now check the status of the self test */
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            if ((EFC_PINS_SELF_TEST_ERROR != (uint32) (sl_efcREG->PINS & EFC_PINS_SELF_TEST_ERROR)))
            {
                /*EFUSE ECC*/
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_)
            	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                if(EFC_NO_ERROR == (sl_efcREG->ERROR & EFC_ERROR_CODE))
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
                /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                if(EFC_NO_ERROR == (sl_efcREG->ERR_STAT & EFC_ERROR_CODE))
#endif
                {
                    if(0==(sl_esmREG->SR4[0] &
                            (GET_ESM_BIT_NUM(ESM_G1ERR_EFUSE_ERR_OTHER)|GET_ESM_BIT_NUM(ESM_G1ERR_EFUSE_SELTEST_ERR)))){
                        failInfoefuse->stResult = ST_PASS;
                    }
                }
            } else {
                /* Self test failed */
                failInfoefuse->stResult = ST_FAIL;
            }
            /* Load the error info anyways */
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_)
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            failInfoefuse->failInfo= (SL_EFuse_Error)(sl_efcREG->ERROR & EFC_ERROR_CODE);
#endif
#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            failInfoefuse->failInfo= (SL_EFuse_Error)(sl_efcREG->ERR_STAT & EFC_ERROR_CODE);
#endif
            /*clear the flags which indicate tests ongoing*/
            SL_FLAG_CLEAR(EFUSE_SELF_TEST_ECC);
        } else {
            /* self test is not complete */
            retVal = FALSE;
        }
    } else {
        /* Since no test was triggered, return FALSE */
        retVal = FALSE;
    }

    return (retVal);
}

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_SelfTest_CCMR4F (SL_SelfTestType testType, boolean bMode, SL_CCMR4F_FailInfo * config)
{
    boolean retVal = FALSE;
    volatile boolean _sl_fault_injection = FALSE;
    volatile uint32 regBkupIntEnaSet, regBckupErrInfulence;
    if(CCMR4F_ERROR_FORCING_TEST_FAULT_INJECT == testType){
        _sl_fault_injection=TRUE;
    }
#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_20*/
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_20*/
    if (FALSE == (boolean)CHECK_RANGE_RAM_PTR(config)) {
        SL_Log_Error(FUNC_ID_ST_CCMR4F, ERR_TYPE_PARAM, 0u);
        retVal =  FALSE;
        return retVal;
    }
    if ((_SELFTEST_CCMR4F_MIN > testType) || (_SELFTEST_CCMR4F_MAX < testType)) {
        SL_Log_Error(FUNC_ID_ST_CCMR4F, ERR_TYPE_PARAM, 1u);
        retVal = FALSE;
        return retVal;
    }
#endif

#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /*check for priveleged mode*/
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_CCMR4F, ERR_TYPE_ENTRY_CON, 0u);
        retVal =  FALSE;
        return(FALSE);
    }


    /* If nERROR is active then do not proceed with tests that trigger nERROR */
    if((TRUE) == SL_ESM_nERROR_Active()){
        SL_Log_Error(FUNC_ID_ST_CCMR4F, ERR_TYPE_ENTRY_CON, 2u);
        return(FALSE);
    }
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Start_Profiling(testType);
#endif
    /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if (CCMR4F_CCMKEYR_MODE_LOCKSTEP != (uint32) (ccmr4fREG1->_CCMKEYR & CCMR4F_CCMKEYR_MODE)) {
            retVal =  FALSE;
    }
    else
    {
        switch(testType) {
            case CCMR4F_SELF_TEST:
                /* Set mode to self_test but first ensure that a test is not in process*/
                /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
                /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
                  /*flag is set to indicate the current test which is ongoing and
                These flags are used in the sl_esm.c so as to mask the esm callback*/
            	SL_FLAG_SET(CCMR4F_SELF_TEST);
                ccmr4fREG1->_CCMKEYR = CCMR4F_CCMKEYR_MODE_SELFTEST;
                /* If sync mode loop for the test to complete */
                if ((TRUE) == bMode) {
                    /*SAFETYMCUSW 28 D <APPROVED> Comment_13*/
                    while (FALSE == SL_SelfTest_Status_CCMR4F(config))
                    {

                    }
                    retVal = TRUE;
                } else {
                /* Since the test is running return TRUE (though this func., call might have not started it) */
                retVal = TRUE;
            }
        break;
        case CCMR4F_ERROR_FORCING_TEST:
        case CCMR4F_ERROR_FORCING_TEST_FAULT_INJECT:
            retVal = TRUE;
            regBkupIntEnaSet = sl_esmREG->IESR1;
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            regBckupErrInfulence = sl_esmREG->EEPAPR1;
             if(CCMR4F_ERROR_FORCING_TEST ==testType) {
                 /*flag is set to indicate the current test which is ongoing and
                   These flags are used in the sl_esm.c so as to mask the esm callback*/
            	 SL_FLAG_SET(CCMR4F_ERROR_FORCING_TEST);
                 sl_esmREG->IECR1 = GET_ESM_BIT_NUM(ESM_G1ERR_CCMR4_SELFTEST);
                    sl_esmREG->DEPAPR1 = GET_ESM_BIT_NUM(ESM_G1ERR_CCMR4_SELFTEST);
             }
             /* Set the mode to error forcing mode */
             /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
             /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
             ccmr4fREG1->_CCMKEYR = CCMR4F_CCMKEYR_MODE_ERRFORCING;
             /* Error is injected & mode is switched back to lockstep (takes 1 cpu cycle).
             Wait for the mode to switch */
             /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
             /*SAFETYMCUSW 28 D <APPROVED> Comment_13*/
             /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
             while (CCMR4F_CCMKEYR_MODE_LOCKSTEP != (uint32) (ccmr4fREG1->_CCMKEYR & CCMR4F_CCMKEYR_MODE)) {
             }

             /* This section is applicable only for the CCMR4F_ERROR_FORCING_TEST case and not applicable for the
              * CCMR4F_ERROR_FORCING_TEST_FAULT_INJECT, where the application handler clears the error bits that
              * were set */
             if(CCMR4F_ERROR_FORCING_TEST ==testType) {
             /* Since this raises a G2 ESM Error, it will be cleared by the ESM handler. So check the shadow register */
             /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
              /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
              if(((uint32)1u == BF_GET(sl_esmREG->SSR2,BF_CCMR4_CMP_ERROR,BF_CCMR4_CMP_ERROR_LENGTH))) {
            	  config->stResult = ST_PASS;
              } else {
                  config->stResult = ST_FAIL;
              }

             /* Clear nERROR & Interrupt only if in normal self test mode */
                 /* Clear nERROR */
                 _SL_HoldNClear_nError();
                 /* Clear the interrupt */
                 /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
                 sl_esmREG->SR1[1] = GET_ESM_BIT_NUM(ESM_G2ERR_CCMR4_COMP);
                 sl_esmREG->SSR2 = GET_ESM_BIT_NUM(ESM_G2ERR_CCMR4_COMP);
                 sl_esmREG->SR1[0] = GET_ESM_BIT_NUM(ESM_G1ERR_CCMR4_SELFTEST);
                 /*clear the flags which indicate tests ongoing*/
                 SL_FLAG_CLEAR(CCMR4F_ERROR_FORCING_TEST);
             }
             else
             {
                 /* Nothing to do incase of fault injection */
             }
             sl_esmREG->IESR1 = regBkupIntEnaSet;
             sl_esmREG->EEPAPR1 = regBckupErrInfulence;
             break;

        case CCMR4F_SELF_TEST_ERROR_FORCING:
             retVal = TRUE;
             /*Backup grp1 esm interrupt enable register and clear the interrupt enable */
             /*the esm interrupts for selftests which generate group 1 interrupts is blocked.Users will have to rely on
             status functions to get the pass/failure information*/        
             regBkupIntEnaSet = sl_esmREG->IESR1;
             /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
             regBckupErrInfulence = sl_esmREG->EEPAPR1;
             sl_esmREG->IECR1 = GET_ESM_BIT_NUM(ESM_G1ERR_CCMR4_SELFTEST);
                sl_esmREG->DEPAPR1 = GET_ESM_BIT_NUM(ESM_G1ERR_CCMR4_SELFTEST);
             /*flag is set to indicate the current test which is ongoing and
             These flags are used in the sl_esm.c so as to mask the esm callback*/
                SL_FLAG_SET(CCMR4F_SELF_TEST_ERROR_FORCING);
             /* Set the mode to self test error forcing mode */
             /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
             ccmr4fREG1->_CCMKEYR = CCMR4F_CCMKEYR_MODE_STERRFORCG;
             /* Error is injected & mode is switched back to lockstep
             (takes 1 cpu cycle). Wait for the mode to switch */
             /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
             /*SAFETYMCUSW 28 D <APPROVED> Comment_13*/
             /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
             while (CCMR4F_CCMKEYR_MODE_LOCKSTEP != (uint32) (ccmr4fREG1->_CCMKEYR & CCMR4F_CCMKEYR_MODE)) {
             }

             /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
             if(GET_ESM_BIT_NUM(ESM_G1ERR_CCMR4_SELFTEST) == (sl_esmREG->SR1[0] & GET_ESM_BIT_NUM(ESM_G1ERR_CCMR4_SELFTEST))){
                 config->stResult = ST_PASS;
             }
             else
             {
                 config->stResult = ST_FAIL;
             }
             /* Clear nERROR */
             _SL_HoldNClear_nError();
             /* Clear the interrupt */
             /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
             sl_esmREG->SR1[0] = (1u << ESM_G1ERR_CCMR4_SELFTEST);
             /*clear the flags which indicate tests ongoing*/
             SL_FLAG_CLEAR(CCMR4F_ERROR_FORCING_TEST);
             /*Restore grp1 esm interrupt enable*/
             sl_esmREG->IESR1 = regBkupIntEnaSet;
             sl_esmREG->EEPAPR1 = regBckupErrInfulence;
             break;
        default:
             break;
        }
    }
    /* If the test was fault injection and not self test, then do not mask the call back & clear the *
     *  FAULT_INJECTION flag for subsequent runs*/
    if((TRUE) == _sl_fault_injection){
            _sl_fault_injection=FALSE;
    }
#if(FUNC_RESULT_LOG_ENABLED == 1)
    SL_Log_Result(FUNC_ID_ST_CCMR4F, testType, (SL_SelfTest_Result)retVal , 0u);
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Stop_Profiling(testType);
#endif
    return(retVal);
}
#endif

#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_SelfTest_CCMR5F (SL_SelfTestType testType, boolean bMode, SL_CCMR5F_FailInfo * config)
{
    boolean retVal = FALSE;
    volatile boolean _sl_fault_injection = FALSE;
    volatile uint32 regBkupIntEnaSet, regBckupErrInfulence;
    volatile uint32* ccmr5fKeyReg = (uint32*)0;

#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_20*/
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_20*/
    if (FALSE == (boolean)CHECK_RANGE_RAM_PTR(config)) {
        SL_Log_Error(FUNC_ID_ST_CCMR5F, ERR_TYPE_PARAM, 0u);
        retVal =  FALSE;
        return retVal;
    }
    if ((_SELFTEST_CCMR5F_MIN > testType) || (_SELFTEST_CCMR5F_MAX < testType))
        {
        SL_Log_Error(FUNC_ID_ST_CCMR5F, ERR_TYPE_PARAM, 1u);
        retVal = FALSE;
        return retVal;
    }
#endif
    if ((testType >= CCMR5F_CPUCOMP_SELF_TEST) && 
            (testType <= CCMR5F_CPUCOMP_SELF_TEST_ERROR_FORCING)) 
        ccmr5fKeyReg = &(ccmr5fREG1->_CCMKEYR1);
    else if ((testType >= CCMR5F_VIMCOMP_SELF_TEST) && 
            (testType <= CCMR5F_VIMCOMP_SELF_TEST_ERROR_FORCING))
        ccmr5fKeyReg = &(ccmr5fREG1->_CCMKEYR2);
    else if ((testType >= CCMR5F_PDCOMP_SELF_TEST) && 
            (testType <= CCMR5F_PDCOMP_SELF_TEST_ERROR_FORCING)) 
        ccmr5fKeyReg = &(ccmr5fREG1->_CCMKEYR4);
    else if ((testType >= CCMR5F_INMCOMP_SELF_TEST) && 
            (testType <= CCMR5F_INMCOMP_SELF_TEST_ERROR_FORCING))
        ccmr5fKeyReg = &(ccmr5fREG1->_CCMKEYR3);

    if (ccmr5fKeyReg == (uint32*)0)
    {
        retVal = FALSE;
        return retVal;
    }

