pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /*check for priveleged mode*/
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_CCMR5F, ERR_TYPE_ENTRY_CON, 0u);
        retVal =  FALSE;
        return(FALSE);
    }


    /* If nERROR is active then do not proceed with tests that trigger nERROR */
    if((TRUE) == SL_ESM_nERROR_Active()){
        SL_Log_Error(FUNC_ID_ST_CCMR5F, ERR_TYPE_ENTRY_CON, 1u);
        return(FALSE);
    }

    /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    if (CCMR5F_CCMKEYR_MODE_LOCKSTEP != (*ccmr5fKeyReg & CCMR5F_CCMKEYR_MODE)) {
        SL_Log_Error(FUNC_ID_ST_CCMR5F, ERR_TYPE_ENTRY_CON, 2u);
        return(FALSE);
    }
#endif
    if((CCMR5F_CPUCOMP_ERROR_FORCING_TEST_FAULT_INJECT == testType) ||
            (CCMR5F_VIMCOMP_ERROR_FORCING_TEST_FAULT_INJECT == testType) || 
            (CCMR5F_PDCOMP_ERROR_FORCING_TEST_FAULT_INJECT == testType)  || 
            (CCMR5F_INMCOMP_ERROR_FORCING_TEST_FAULT_INJECT == testType)) { 
        _sl_fault_injection=TRUE;
    }
#if FUNCTION_PROFILING_ENABLED
    SL_Start_Profiling(testType);
#endif
    switch(testType) {
        case CCMR5F_CPUCOMP_SELF_TEST:
        case CCMR5F_VIMCOMP_SELF_TEST:
        case CCMR5F_PDCOMP_SELF_TEST:
        case CCMR5F_INMCOMP_SELF_TEST:
            /* Set mode to self_test but first ensure that a test is not in process*/
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
           /* flag is set to indicate the current test which is ongoing and
            * These flags are used in the sl_esm.c so as to mask the esm
            * callback.
            * NOTE: even if the CCMR4F Selftest fails (selftest ESM occurs), the
            * application callback will not be made; application must use the
            * failinfo structure to get the status of selftest diagnostic */
            SL_FLAG_SET(testType);
            *ccmr5fKeyReg = CCMR5F_CCMKEYR_MODE_SELFTEST;
            /* If sync mode loop for the test to complete */
            if ((TRUE) == bMode) {
                /*SAFETYMCUSW 28 D <APPROVED> Comment_13*/
                while (FALSE == SL_SelfTest_Status_CCMR5F(testType, config)) {
                }
                retVal = TRUE;
            } else {
                /* Since the test is running return TRUE */
                retVal = TRUE;
            }
            break;

    case CCMR5F_CPUCOMP_ERROR_FORCING_TEST:
    case CCMR5F_CPUCOMP_ERROR_FORCING_TEST_FAULT_INJECT:
    case CCMR5F_VIMCOMP_ERROR_FORCING_TEST:
    case CCMR5F_VIMCOMP_ERROR_FORCING_TEST_FAULT_INJECT:
    case CCMR5F_PDCOMP_ERROR_FORCING_TEST:
    case CCMR5F_PDCOMP_ERROR_FORCING_TEST_FAULT_INJECT:
    case CCMR5F_INMCOMP_ERROR_FORCING_TEST:
    case CCMR5F_INMCOMP_ERROR_FORCING_TEST_FAULT_INJECT:
        retVal = TRUE;
        regBkupIntEnaSet = sl_esmREG->IESR1;
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        regBckupErrInfulence = sl_esmREG->EEPAPR1;
        SL_FLAG_SET(testType);
        if(_sl_fault_injection == FALSE) {
             /*flag is set to indicate the current test which is ongoing and
               These flags are used in the sl_esm.c so as to mask the esm callback*/
             sl_esmREG->IECR1 = GET_ESM_BIT_NUM(ESM_G1ERR_CCMR5_SELFTEST);
             sl_esmREG->DEPAPR1 = GET_ESM_BIT_NUM(ESM_G1ERR_CCMR5_SELFTEST);
         }
#if FUNCTION_PROFILING_ENABLED
    SL_Record_Errorcreationtick(testType);
#endif
         /* Set the mode to error forcing mode */
         /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
         /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
        *ccmr5fKeyReg = CCMR5F_CCMKEYR_MODE_ERRFORCING;
        /* Error is injected & mode is switched back to lockstep (takes 1 cpu
         * cycle).  
         * Wait for the mode to switch */

        /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
        /*SAFETYMCUSW 28 D <APPROVED> Comment_13*/
        while (CCMR5F_CCMKEYR_MODE_LOCKSTEP != (*ccmr5fKeyReg & CCMR5F_CCMKEYR_MODE)) {
        }
        /* Since this raises a G2 ESM Error, it will be cleared by the ESM
         * handler. So check the shadow register */
        /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
        int g2interrupt;
        switch (testType) {
            case CCMR5F_CPUCOMP_ERROR_FORCING_TEST:
            case CCMR5F_CPUCOMP_ERROR_FORCING_TEST_FAULT_INJECT:
                g2interrupt = BF_CCMR5_CPUCOMP_ERROR;
                break;

            case CCMR5F_VIMCOMP_ERROR_FORCING_TEST:
            case CCMR5F_VIMCOMP_ERROR_FORCING_TEST_FAULT_INJECT:
                g2interrupt = BF_CCMR5_VIMCOMP_ERROR;
                break;

            case CCMR5F_PDCOMP_ERROR_FORCING_TEST:
            case CCMR5F_PDCOMP_ERROR_FORCING_TEST_FAULT_INJECT:
                g2interrupt = BF_CCMR5_PDCOMP_ERROR;
                break;

            case CCMR5F_INMCOMP_ERROR_FORCING_TEST:
            case CCMR5F_INMCOMP_ERROR_FORCING_TEST_FAULT_INJECT:
                g2interrupt = BF_CCMR5_INMCOMP_ERROR;
                break;
        }
        /* check if group 2 interrupt corresponding to error forced occured */
        if(((uint32)1u ==
                    BF_GET(sl_esmREG->SSR2,g2interrupt,BF_CCMR5_CMP_ERROR_LENGTH)))
        {
            config->stResult = ST_PASS;
        } else {
            config->stResult = ST_FAIL;
        }

        /* Clear nERROR & Interrupt only if in normal self test mode */
        if (_sl_fault_injection == FALSE) {
            /* Clear nERROR */
            _SL_HoldNClear_nError();
            /* Clear the interrupt */
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
            /* ESM Status for Group2 is automatically cleared upon reading of
             * INTOFFH register on entering the ESM High interrupt handler. */
            /*sl_esmREG->SR1[1] = GET_ESM_BIT_NUM(ESM_G2ERR_CCMR5_COMP);*/
            sl_esmREG->SR1[0] = GET_ESM_BIT_NUM(ESM_G1ERR_CCMR5_SELFTEST);
            sl_esmREG->SSR2 = GET_ESM_BIT_NUM(g2interrupt);
        } else {
             /* Nothing to do incase of fault injection */
        }
        /*clear the flags which indicate tests ongoing*/
        SL_FLAG_CLEAR(testType);
        sl_esmREG->IESR1 = regBkupIntEnaSet;
        sl_esmREG->EEPAPR1 = regBckupErrInfulence;
    break;

    case CCMR5F_CPUCOMP_SELF_TEST_ERROR_FORCING:
    case CCMR5F_VIMCOMP_SELF_TEST_ERROR_FORCING:
    case CCMR5F_PDCOMP_SELF_TEST_ERROR_FORCING:
    case CCMR5F_INMCOMP_SELF_TEST_ERROR_FORCING:
         retVal = TRUE;
         /*Backup grp1 esm interrupt enable register and clear the interrupt
          * enable */
         /*the esm interrupts for selftests which generate group 1 interrupts is
          * blocked. Users will have to rely on status values to get the
          * pass/failure information*/
         regBkupIntEnaSet = sl_esmREG->IESR1;
         /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
         regBckupErrInfulence = sl_esmREG->EEPAPR1;
         sl_esmREG->IECR1 = GET_ESM_BIT_NUM(ESM_G1ERR_CCMR5_SELFTEST);
         sl_esmREG->DEPAPR1 = GET_ESM_BIT_NUM(ESM_G1ERR_CCMR5_SELFTEST);
         /*flag is set to indicate the current test which is ongoing and
         These flags are used in the sl_esm.c so as to mask the esm callback*/
         SL_FLAG_SET(testType);
         /* Set the mode to self test error forcing mode */
         /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
#if FUNCTION_PROFILING_ENABLED
    SL_Record_Errorcreationtick(testType);
#endif
        *ccmr5fKeyReg = CCMR5F_CCMKEYR_MODE_STERRFORCING;
         /* Error is injected & mode is switched back to lockstep
         (takes 1 cpu cycle). Wait for the mode to switch */

         /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
        /*SAFETYMCUSW 28 D <APPROVED> Comment_13*/

        while (CCMR5F_CCMKEYR_MODE_LOCKSTEP != (uint32) (*ccmr5fKeyReg & CCMR5F_CCMKEYR_MODE)) {
        }
        /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
        if(GET_ESM_BIT_NUM(ESM_G1ERR_CCMR5_SELFTEST) == (sl_esmREG->SR1[0] & GET_ESM_BIT_NUM(ESM_G1ERR_CCMR5_SELFTEST))){
            config->stResult = ST_PASS;
        }
        else
        {
            config->stResult = ST_FAIL;
        }
        /* Clear nERROR */
        _SL_HoldNClear_nError();
        /* Clear the interrupt */
        /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_21*/
        sl_esmREG->SR1[0] = (1u << ESM_G1ERR_CCMR5_SELFTEST);
        /*clear the flags which indicate tests ongoing*/
        SL_FLAG_CLEAR(testType);
        /*Restore grp1 esm interrupt enable*/
        sl_esmREG->IESR1 = regBkupIntEnaSet;
        sl_esmREG->EEPAPR1 = regBckupErrInfulence;
    break;

    default:
    break;
    }

