pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
    if (GET_ESM_BIT_NUM(ESM_G1ERR_CCMR5_OPERATING_STATUS) == (sl_esmREG->SR7[0] & GET_ESM_BIT_NUM(ESM_G1ERR_CCMR5_OPERATING_STATUS)))
    {
        sl_esmREG->SR7[0] = GET_ESM_BIT_NUM(ESM_G1ERR_CCMR5_OPERATING_STATUS);
    }
    /* If the test was fault injection and not self test, then do not mask the call back & clear the *
     *  FAULT_INJECTION flag for subsequent runs*/
    if((TRUE) == _sl_fault_injection){
            _sl_fault_injection=FALSE;
    }
#if(FUNC_RESULT_LOG_ENABLED == 1)
    SL_Log_Result(FUNC_ID_ST_CCMR5F, testType, (SL_SelfTest_Result)retVal , 0u);
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Stop_Profiling(testType);
#endif
    return(retVal);
}
#endif

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 91 S MR: 5.2,5.6,5.7 <APPROVED> Comment_22*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_SelfTest_Status_CCMR4F (SL_CCMR4F_FailInfo * failInfoccmr4f)
{
    boolean retVal = FALSE;
#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    if (FALSE == (boolean)CHECK_RANGE_RAM_PTR(failInfoccmr4f)) {
        SL_Log_Error(FUNC_ID_ST_CCMR4F_STATUS, ERR_TYPE_PARAM, 0u);
        retVal =  FALSE;
        return retVal;
    }
#endif

#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /*check for priveleged mode*/
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_CCMR4F_STATUS, ERR_TYPE_ENTRY_CON, 0u);
        retVal =  FALSE;
        return(FALSE);
    }
#endif
    /* Proceed only if in self-test mode else entry condition is wrong */
    /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if (CCMR4F_CCMKEYR_MODE_SELFTEST != (uint32) (ccmr4fREG1->_CCMKEYR & CCMR4F_CCMKEYR_MODE)) {
            retVal =  FALSE;
    }
    else
    {
    /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if (CCMR4F_CCMSR_STC == (uint32) (ccmr4fREG1->_CCMSR & CCMR4F_CCMSR_STC)) {
        /* Restore the CPU mode */
        /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
        ccmr4fREG1->_CCMKEYR = CCMR4F_CCMKEYR_MODE_LOCKSTEP;
        /* \todo document that the Status API must be called after starting the
        self-test to restore the cpu mode */
        retVal = TRUE; /* Indicate that the self test was complete */
        /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        if (CCMR4F_CCMSR_STE == (uint32) (ccmr4fREG1->_CCMSR & CCMR4F_CCMSR_STE)) {
            /* self-test failed */
            failInfoccmr4f->stResult = ST_FAIL;
            /* retrieve the err info */
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            if (CCMR4F_CCMSR_STET == (uint32) (ccmr4fREG1->_CCMSR & CCMR4F_CCMSR_STET)) {
                /* \todo Looks like there is a type in TRM w.r.t bit description. */
                failInfoccmr4f->failInfo = CCMR4F_ST_ERR_COMPARE_MATCH;
            } else {
                failInfoccmr4f->failInfo = CCMR4F_ST_ERR_COMPARE_MISMATCH;
            }
        } else {
            failInfoccmr4f->stResult = ST_PASS;
        }
        /*clear the flags which indicate tests ongoing*/
        SL_FLAG_CLEAR(CCMR4F_SELF_TEST);
    } else {
        retVal = FALSE; /* Indicate that the self test was not complete */
    }
#if(FUNC_RESULT_LOG_ENABLED == 1)
    SL_Log_Result(FUNC_ID_ST_CCMR4F_STATUS, (SL_SelfTestType)0u, failInfoccmr4f->stResult, 0u);
#endif
    }
    return(retVal);
}
#endif

#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 91 S MR: 5.2,5.6,5.7 <APPROVED> Comment_22*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_SelfTest_Status_CCMR5F (SL_SelfTestType testType, SL_CCMR5F_FailInfo * failInfoccmr5f)
{
    boolean retVal = FALSE;
    volatile uint32* ccmr5fKeyReg = (uint32*)0;
    volatile uint32* ccmr5fStReg = (uint32*)0;
#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    if (FALSE == (boolean)CHECK_RANGE_RAM_PTR(failInfoccmr5f)) {
        SL_Log_Error(FUNC_ID_ST_CCMR5F_STATUS, ERR_TYPE_PARAM, 0u);
        retVal =  FALSE;
        return retVal;
    }

    if ((CCMR5F_CPUCOMP_SELF_TEST != testType) && 
            (CCMR5F_VIMCOMP_SELF_TEST != testType) &&
            (CCMR5F_PDCOMP_SELF_TEST != testType) &&
            (CCMR5F_INMCOMP_SELF_TEST != testType)) {
        SL_Log_Error(FUNC_ID_ST_CCMR5F, ERR_TYPE_PARAM, 1u);
        retVal = FALSE;
        return retVal;
    }
#endif

#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /*check for priveleged mode*/
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_CCMR5F_STATUS, ERR_TYPE_ENTRY_CON, 0u);
        retVal =  FALSE;
        return(FALSE);
    }
#endif

    if (testType == CCMR5F_CPUCOMP_SELF_TEST) {
        ccmr5fKeyReg = &(ccmr5fREG1->_CCMKEYR1);
        ccmr5fStReg =  &(ccmr5fREG1->_CCMSR1);
    } else if (testType == CCMR5F_VIMCOMP_SELF_TEST) {
        ccmr5fKeyReg = &(ccmr5fREG1->_CCMKEYR2);
        ccmr5fStReg =  &(ccmr5fREG1->_CCMSR2);
    } else if (testType == CCMR5F_PDCOMP_SELF_TEST)  {
        ccmr5fKeyReg = &(ccmr5fREG1->_CCMKEYR4);
        ccmr5fStReg =  &(ccmr5fREG1->_CCMSR4);
    }
    else if (testType == CCMR5F_INMCOMP_SELF_TEST) {
        ccmr5fKeyReg = &(ccmr5fREG1->_CCMKEYR3);
        ccmr5fStReg =  &(ccmr5fREG1->_CCMSR3);
    }

    /* Proceed only if in self-test mode else entry condition is wrong */
    /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    if (CCMR5F_CCMKEYR_MODE_SELFTEST != (uint32) (*ccmr5fKeyReg & CCMR5F_CCMKEYR_MODE)) {
               retVal =  FALSE;
    } else {
        /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    	/*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        if (CCMR5F_CCMSR_STC == (uint32) (*ccmr5fStReg & CCMR5F_CCMSR_STC)) {
            /* Restore the CPU mode */
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
            *ccmr5fKeyReg = CCMR5F_CCMKEYR_MODE_LOCKSTEP;
            /* \todo document that the Status API must be called after starting the
            self-test to restore the cpu mode */
            retVal = TRUE; /* Indicate that the self test was complete */
            /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
            /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
            if (CCMR5F_CCMSR_STE == (uint32) (*ccmr5fStReg & CCMR5F_CCMSR_STE)) {
                /* self-test failed */
                failInfoccmr5f->stResult = ST_FAIL;
                /* retrieve the err info */
                /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
                /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
                if (CCMR5F_CCMSR_STET == (uint32) (*ccmr5fStReg & CCMR5F_CCMSR_STET)) {
                    /* \todo Looks like there is a type in TRM w.r.t bit description. */
                    failInfoccmr5f->failInfo = CCMR5F_ST_ERR_COMPARE_MATCH;
                } else {
                    failInfoccmr5f->failInfo = CCMR5F_ST_ERR_COMPARE_MISMATCH;
                }
            } else {
                failInfoccmr5f->stResult = ST_PASS;
            }
            /*clear the flags which indicate tests ongoing*/
            SL_FLAG_CLEAR(testType);
        } else {
            retVal = FALSE; /* Indicate that the self test was not complete */
        }
    }

