pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
#if(FUNC_RESULT_LOG_ENABLED == 1)
    SL_Log_Result(FUNC_ID_ST_CCMR5F_STATUS, (SL_SelfTestType)0u, failInfoccmr5f->stResult, 0u);
#endif
    return(retVal);
}
#endif

#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_) || defined(_RM42x_) || defined(_TMS570LS04x_)
/** @fn void adcCalibration(sl_adcBASE_t *adc)
*   @brief Computes offset error using Calibration mode
*   @param[in] adc Pointer to ADC module:
*              - sl_adcREG1: ADC1 module pointer
*              - sl_adcREG2: ADC2 module pointer
*   This function computes offset error using Calibration mode
*
*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_adcCalibration(sl_adcBASE_t * adc, uint32 * offset_error)
{
	uint32 calr_val[5]={0U,0U,0U,0U,0U};
    uint32 loop_index=0U;
    uint32 backup_mode;

    boolean retVal =  FALSE;

#ifdef FUNCTION_PARAM_CHECK_ENABLED

    /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    if((adc != sl_adcREG1) && (adc != sl_adcREG2) && (adc != NULL)) {
        SL_Log_Error(FUNC_ID_ST_ADC, ERR_TYPE_PARAM, 2u);
        retVal = FALSE;
        return retVal;
    }

#endif

#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /*check for priveleged mode*/
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_ADC, ERR_TYPE_ENTRY_CON, 0u);
        retVal = FALSE;
        return retVal;
    }
    /*todo check if these checks are redundant*/
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if ((uint32)1u == adc->RSTCR) {
        SL_Log_Error(FUNC_ID_ST_ADC, ERR_TYPE_ENTRY_CON, 1u);
        retVal = FALSE;
        return retVal;
    }
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if(0u != (adc->OPMODECR & ADC_POWERDOWN_MODE)) {
        SL_Log_Error(FUNC_ID_ST_ADC, ERR_TYPE_ENTRY_CON, 2u);
        retVal = FALSE;
        return retVal;
    }
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if(0u == (adc->OPMODECR & ADC_ENABLE)) {
        SL_Log_Error(FUNC_ID_ST_ADC, ERR_TYPE_ENTRY_CON, 3u);
        retVal = FALSE;
        return retVal;
    }
#endif

    /** - Backup Mode before Calibration  */
    backup_mode = adc->OPMODECR;

    /** - Enable 12-BIT ADC  */
    sl_adcREG1->OPMODECR |= 0x80000000U;

    /* Disable all channels for conversion */
    adc->GxSEL[0]=0x00U;
    adc->GxSEL[1]=0x00U;
    adc->GxSEL[2]=0x00U;

    for(loop_index=0U;loop_index<4U;loop_index++)
    {
        /* Disable Self Test and Calibration mode */
        adc->CALCR=0x0U;

        switch(loop_index)
        {
            case 0U :     /* Test 1 : Bride En = 0 , HiLo =0 */
                        adc->CALCR=0x0U;
                        break;

            case 1U :    /* Test 1 : Bride En = 0 , HiLo =1 */
                        adc->CALCR=0x0100U;
                        break;

            case 2U :     /* Test 1 : Bride En = 1 , HiLo =0 */
                        adc->CALCR=0x0200U;
                        break;

            case 3U :     /* Test 1 : Bride En = 1 , HiLo =1 */
                        adc->CALCR=0x0300U;
                        break;
            default :
                        break;
        }

        /* Enable Calibration mode */
        adc->CALCR|=0x1U;

        /* Start calibration conversion */
        adc->CALCR|=0x00010000U;

        /* Wait for calibration conversion to complete */
        /*SAFETYMCUSW 28 D <APPROVED> Comment_13*/
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        while((adc->CALCR & 0x00010000U)==0x00010000U)
        {
        } /* Wait */

        /* Read converted value */
        calr_val[loop_index]= adc->CALR;
    }

    /* Disable Self Test and Calibration mode */
    adc->CALCR=0x0U;

    /* Compute the Offset error correction value */
    calr_val[4]=calr_val[0]+ calr_val[1] + calr_val[2] + calr_val[3];

    calr_val[4]=(calr_val[4]/4);

    *offset_error=calr_val[4]-0x7FFU;

    /*Write the offset error to the Calibration register */
    /* Load 2's complement of the computed value to ADCALR register */
    *offset_error=~(*offset_error);
    *offset_error=(*offset_error) & 0xFFFU;
    *offset_error=(*offset_error) + 1U;

    adc->CALR = *offset_error;

  /** - Restore Mode after Calibration  */
    adc->OPMODECR = backup_mode;

    retVal = TRUE;
    return retVal;

 /**   @note The function adcInit has to be called before using this function. */

}

/*SAFETYMCUSW 62 D MR: 16.7 <APPROVED> Comment_23*/
/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_SelfTest_ADC(SL_SelfTestType testType, boolean mode, SL_ADC_Config * config, SL_ADC_Pinstatus * pinstatus)
{
    uint16 adRefHi = 0u;
    uint16 adRefLo = 0u;
    uint16 approximated_value;
    uint32 temp, offset;
    SL_ADC_Data Vd, Vu, Vn;

    boolean retVal =  FALSE;

    uint32 ModeCtrlRegWorkingCopy, IntEnaRegWorkingCopy, IntThrRegWorkingCopy;

#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    if (FALSE == (boolean)CHECK_RANGE_RAM_PTR(pinstatus)) {
        SL_Log_Error(FUNC_ID_ST_ADC, ERR_TYPE_PARAM, 0u);
        retVal =  FALSE;
        return retVal;
    }
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    /*SAFETYMCUSW 439 S MR:11.3 <APPROVED> Comment_4*/
    if (FALSE == (boolean)CHECK_RANGE_RAM_PTR(config)) {
        SL_Log_Error(FUNC_ID_ST_ADC, ERR_TYPE_PARAM, 1u);
        retVal =  FALSE;
        return retVal;
    }
    /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    if((config->adcbase != sl_adcREG1) && (config->adcbase != sl_adcREG2) && (config->adcbase != NULL)) {
        SL_Log_Error(FUNC_ID_ST_ADC, ERR_TYPE_PARAM, 2u);
        retVal =  FALSE;
        return retVal;
    }
#if defined(_TMS570LS31x_) || defined(_TMS570LS12x_) || defined(_RM48x_) || defined(_RM46x_)
/*ADC Channels 0 to 23 are available in TMS570LS31x, TMS570LS12x, RM48 and RM46x devices*/
    if((config->adc_channel >= 24u)) {
        SL_Log_Error(FUNC_ID_ST_ADC, ERR_TYPE_PARAM, 3u);
        retVal =  FALSE;
        return retVal;
    }
#endif
#if defined(_RM42x_) || defined(_TMS570LS04x_)
/*These ADC channels are not available in TMS570LS04x and RM42x devices*/
    if(((config->adc_channel > 11u) && (config->adc_channel < 16u)) ||
           ((config->adc_channel > 17u) && (config->adc_channel < 20u)) ||
           (config->adc_channel > 21u)){
        SL_Log_Error(FUNC_ID_ST_ADC, ERR_TYPE_PARAM, 3u);
        retVal = FALSE;
        return retVal;
    }
#endif

#endif

