pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /*check for priveleged mode*/
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_ADC, ERR_TYPE_ENTRY_CON, 0u);
        retVal =  FALSE;
        return retVal;
    }
    /*todo check if these checks are redundant*/
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if ((uint32)1u == config->adcbase->RSTCR) {
        SL_Log_Error(FUNC_ID_ST_ADC, ERR_TYPE_ENTRY_CON, 1u);
        retVal =  FALSE;
        return retVal;
    }
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if(0u != (config->adcbase->OPMODECR & ADC_POWERDOWN_MODE)) {
        SL_Log_Error(FUNC_ID_ST_ADC, ERR_TYPE_ENTRY_CON, 2u);
        retVal =  FALSE;
        return retVal;
    }
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    if(0u == (config->adcbase->OPMODECR & ADC_ENABLE)) {
        SL_Log_Error(FUNC_ID_ST_ADC, ERR_TYPE_ENTRY_CON, 3u);
        retVal =  FALSE;
        return retVal;
    }
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Start_Profiling(testType);
#endif
    sl_adcBASE_t * adc = config->adcbase;
    uint8 channel = config->adc_channel;
    /*initializing the Vd,Vu,Vn values to 0 on start*/
    Vd.value = 0u;
    Vu.value = 0u;
    Vn.value = 0u;

    /*setting pinstatus to default value*/
    *pinstatus = ADC_PIN_UNDETERMINED;
    /*backup copy of the interrupt and mode control registers of adc*/
    IntEnaRegWorkingCopy = adc->GxINTENA[sl_adcGROUP1];
    IntThrRegWorkingCopy = adc->GxINTCR[sl_adcGROUP1];
    ModeCtrlRegWorkingCopy = adc->OPMODECR;

    /*Disable Interrupts*/
    adc->GxINTENA[sl_adcGROUP1] = 0u;

    /*disable any self tst and Calib mode first */
    adc->CALCR = 0u;

    /*first find out AdRefHi and AdRefLo by using Calibration method*/
    /** - Backup Mode before Calibration  */

    /** - Enable 12-BIT ADC  */
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    (adc->OPMODECR) |= ADC_12BIT_RESOLUTION;
    /* Disable all channels for conversion */
    /*Event select*/
    adc->GxSEL[sl_adcGROUP1] = 0u;

    /* Test 1 : Bride En = 1 , HiLo =0 Calib Enabled, Start Calibration */
    /*SAFETYMCUSW 28 D MR: 16.7 <APPROVED> Comment_24*/
    adc->CALCR = (ADC_CALIB_BRIDGE_ENABLE | ADC_START_CALIBRATION | ADC_ENABLE_CALIBRATION);

    /* Wait for calibration conversion to complete */
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    while ((adc->CALCR & ADC_START_CALIBRATION) == ADC_START_CALIBRATION) {

    }
    /* Read converted value */
    /* Since adc->CALR is volatile, it is recommended not to cast directly to uint16 */
    temp = adc->CALR;
    adRefLo = (uint16)temp;

    /*  Bride En = 1 , HiLo =1 Calib Enabled, Start Calibration */
    adc->CALCR = (ADC_CALIB_BRIDGE_ENABLE | ADC_CALIB_HILO_ENABLE | ADC_START_CALIBRATION | ADC_ENABLE_CALIBRATION);
    /* Wait for calibration conversion to complete */
    /*SAFETYMCUSW 28 D MR: 16.7 <APPROVED> Comment_24*/
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    while ((adc->CALCR & ADC_START_CALIBRATION) == ADC_START_CALIBRATION) {
    }
    /* Read converted value */
    /* Since adc->CALR is volatile, it is recommended not to cast directly to uint16 */
    temp = adc->CALR;
    adRefHi = (uint16)temp;

    /** - Restore Mode after Calibration  */
    adc->OPMODECR = ModeCtrlRegWorkingCopy;
    /* disable any self tst and Calib mode first*/
    adc->CALCR = 0u;

    /*Calibrate the ADC so as to fill appropriate value in CALR register*/
    /*SAFETYMCUSW 440 S MR: 11.3 <APPROVED> Comment_18*/
    if(FALSE == SL_adcCalibration(adc, &offset))
    {
    	return retVal;
    }

    /*Calculate Vn*/
    /*enable ADC channel which needs to be tested */
    _SL_SelfTest_adcStartConversion_selChn(adc, channel, ADC_FIFO_SIZE, (uint32) sl_adcGROUP1);
    /* check for the status of the group to see if it is finished*/
    /*SAFETYMCUSW 28 D MR: 16.7 <APPROVED> Comment_24*/
    while (FALSE == _SL_SelfTest_adcIsConversionComplete(adc, (uint32) sl_adcGROUP1)) {

    }
    /* copy the results into the Vn*/
    _SL_SelfTest_adcGetSingleData(adc, (uint32) sl_adcGROUP1, &Vn);

    /* for this self test put the adc group in single shot non streaming mode & later restore the setting to original */
    /* set the ADC hw in the self test mode and start the test.*/
    /*Calculate Vd*/
    adc->CALCR |= ADC_ENABLE_SELFTEST;
    /* set HiLo to 0 to connect AdVref = low */
    /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
    adc->CALCR = (adc->CALCR)&(~ADC_CALIB_HILO_ENABLE);
    /*enable ADC channel which needs to be tested */
    _SL_SelfTest_adcStartConversion_selChn(adc, channel, ADC_FIFO_SIZE, (uint32) sl_adcGROUP1);
    /* check for the status of the group to see if it is finished*/
    /*SAFETYMCUSW 28 D MR: 16.7 <APPROVED> Comment_24*/
    while (FALSE == _SL_SelfTest_adcIsConversionComplete(adc, (uint32) sl_adcGROUP1)) {

    }
    /* copy the results into the Vd*/
    _SL_SelfTest_adcGetSingleData(adc, (uint32) sl_adcGROUP1, &Vd);

    /*Calculate Vu*/
    adc->CALCR |= ADC_CALIB_HILO_ENABLE;
    /*enable ADC channel which needs to be tested */
    _SL_SelfTest_adcStartConversion_selChn(adc, channel, ADC_FIFO_SIZE, (uint32) sl_adcGROUP1);
    /* check for the status of the group to see if it is finished*/
    /*SAFETYMCUSW 28 D MR: 16.7 <APPROVED> Comment_24*/
    while (FALSE == _SL_SelfTest_adcIsConversionComplete(adc, (uint32) sl_adcGROUP1)) {

    }
    /* copy the results into the Vn*/
    _SL_SelfTest_adcGetSingleData(adc, (uint32) sl_adcGROUP1, &Vu);

    /*Approximation of the values is done here*/
    /* find the differences and set the voltages levels to ref_low or rel_hig for proper comparision */
    approximated_value = _SL_Approximate_value(Vn.value,adRefHi,(uint8)ADC_APPROXIMATION_THRESHOLD);
    if(approximated_value == Vn.value)
    {
        Vn.value = _SL_Approximate_value(Vn.value,adRefLo,(uint8)ADC_APPROXIMATION_THRESHOLD);
    }
    else
    {
        Vn.value = approximated_value;
    }
    approximated_value = _SL_Approximate_value(Vu.value,adRefHi,(uint8)ADC_APPROXIMATION_THRESHOLD);
    if(approximated_value == Vu.value)
    {
        Vu.value = _SL_Approximate_value(Vu.value,adRefLo,(uint8)ADC_APPROXIMATION_THRESHOLD);
        Vu.value = Vu.value; /* Avoid warning that function return value not used */
    }
    else
    {
        Vu.value = approximated_value;
    }
    approximated_value = _SL_Approximate_value(Vd.value,adRefHi,(uint8)ADC_APPROXIMATION_THRESHOLD);
    if(approximated_value == Vd.value)
    {
        Vd.value = _SL_Approximate_value(Vd.value,adRefLo,(uint8)ADC_APPROXIMATION_THRESHOLD);
        Vd.value = Vd.value; /* Avoid warning that function return value not used */
    }
    else
    {
        Vd.value = approximated_value;
    }

