pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
    if ((Vn.value == adRefHi) && (Vu.value == adRefHi) && (Vd.value == adRefHi)) {
        *pinstatus = ADC_PIN_SHORTED_TO_ADVREF_HIGH;
    } else if ((Vn.value == adRefLo) && (Vu.value == adRefLo) && (Vd.value == adRefLo)) {
        *pinstatus = ADC_PIN_SHORTED_TO_ADVREF_LOW;
    } else if (((Vu.value < adRefHi) && (Vu.value > Vn.value)) && ((Vd.value > adRefLo) && (Vd.value < Vn.value))) {
        *pinstatus = ADC_PIN_GOOD;
    } else if ((Vu.value == adRefHi) && (Vd.value == adRefLo)) {
        *pinstatus = ADC_PIN_OPEN;
    } else {
        *pinstatus = ADC_PIN_UNDETERMINED;
    }

    /*disable any self tst and Calib mode first*/
    adc->CALCR = 0u;
    /* Disable all channels for conversion */
    /* Disable all channels for conversion */
    /*Event select*/
    adc->GxSEL[(uint32) sl_adcGROUP1] = 0u;
    /*Enable Interrupts if it was enabled before the selftest*/
    adc->GxINTENA[(uint32) sl_adcGROUP1] = IntEnaRegWorkingCopy;
    adc->GxINTCR[(uint32) sl_adcGROUP1] = IntThrRegWorkingCopy;

#if(FUNC_RESULT_LOG_ENABLED == 1)
    SL_Log_Result(FUNC_ID_ST_ADC, testType, adc_stResult , 0u);
#endif

    retVal =  TRUE;
#if FUNCTION_PROFILING_ENABLED
    SL_Stop_Profiling(testType);
#endif
    return retVal;
}


/*reserved location in memory map*/
#define SCR_RESERVED_LOCATION 0x70000000U
/*reserved location in memory map*/
#define PCR_RESERVED_LOCATION 0xFD000000U
/*SAFETYMCUSW 61 D MR: 8.10,8.11 <APPROVED> Comment_15*/
/*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
boolean SL_SelfTestL2L3Interconnect(SL_SelfTestType testType)
{
    boolean retVal = FALSE;
    uint32 read_reserved_word;
#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /* Verify that the parameters are in rage */
    if ((_SELFTEST_L2L3INTERCONNECT_MIN > testType) || (_SELFTEST_L2L3INTERCONNECT_MAX < testType)) {
        SL_Log_Error(FUNC_ID_ST_L2L3INTERCONNECT, ERR_TYPE_PARAM, 0u);
        retVal =  FALSE;
        return(retVal);
    }
#endif

#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /*check for priveleged mode*/
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_L2L3INTERCONNECT, ERR_TYPE_ENTRY_CON, 0u);
        retVal =  FALSE;
        return(retVal);
    }
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Start_Profiling(testType);
#endif
    switch(testType)
    {
    /*Access a reserve location in the EMIF register space,as EMIF lies on SCR*/
        case L2INTERCONNECT_FAULT_INJECT:
            /*try to read reserved word in the emif register map*/
#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
            _SL_Barrier_Data_Access();
            read_reserved_word = *((uint32*)SCR_RESERVED_LOCATION);
            read_reserved_word = read_reserved_word; /* Avoid compiler warning. */
            retVal = TRUE;
            break;
    /*Access a reserve location in the DCAN register space,as DCAN lies on PCR*/
        case L3INTERCONNECT_FAULT_INJECT:
            /*try to read reserved word in the pbist register map*/
#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif
            _SL_Barrier_Data_Access();
            read_reserved_word = *((uint32*)PCR_RESERVED_LOCATION);
            read_reserved_word = read_reserved_word; /* Avoid compiler warning. */
            retVal = TRUE;
            break;

        default:
            retVal = FALSE;
            break;
    }
#if(FUNC_RESULT_LOG_ENABLED == 1)
    SL_Log_Result(FUNC_ID_ST_L2L3INTERCONNECT, testType, (SL_SelfTest_Result)retVal , 0u);
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Stop_Profiling(testType);
#endif
    return(retVal);
    /*SAFETYMCUSW 7 C MR: 14.7 <APPROVED> Comment_3*/
}
#endif

#if defined(_TMS570LC43x_) || defined(_RM57Lx_)
#define dmaRAMBaseAddr    0xFFF80000u
#define dmaBadECC        0xFFF80010u
boolean SL_SelfTest_DMA(SL_SelfTestType testType)
{
    volatile boolean _sl_fault_injection = FALSE;
    volatile uint32 ramRead;
    register uint64 regBackupSECCTL, regBackupPCR, ramread64, regBckupErrInfulence, regBkupIntEnaSet;
    uint32 ram1erraddr, dataVal;
    uint32 *dmaRead = (uint32 *)dmaBadECC;

#if FUNCTION_PROFILING_ENABLED
    SL_Start_Profiling(testType);
#endif

    boolean retVal = FALSE;

    regBackupPCR = sl_dmaREG->DMAPCR;
    regBackupSECCTL = sl_dmaREG->DMASECCCTRL;

#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /* Verify that the parameters are in rage */
    if ((_SELFTEST_DMA_MIN > testType) || (_SELFTEST_DMA_MAX < testType)) {
        SL_Log_Error(FUNC_ID_ST_DMA, ERR_TYPE_PARAM, 0u);
        retVal =  FALSE;
        return(retVal);
    }
#endif

#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /*check for priveleged mode*/
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_DMA, ERR_TYPE_ENTRY_CON, 0u);
        retVal =  FALSE;
        return(retVal);
    }
#endif

    /* If DMA ECC is not enabled, return error. */
    if((DMA_SRAM_ECC_DISABLED) == BF_GET(sl_dmaREG->DMAPCR, DMA_PARCTRL_ECC_DETECT_EN_START, DMA_PARCTRL_ECC_DETECT_EN_LENGTH))
    {
        SL_Log_Error(FUNC_ID_ST_DMA, ERR_TYPE_ENTRY_CON, 1U);
        return(FALSE);
    }

    /* If nERROR is active then do not proceed with tests that trigger nERROR */
    if((TRUE) == SL_ESM_nERROR_Active())
    {
        SL_Log_Error(FUNC_ID_ST_DMA, ERR_TYPE_ENTRY_CON, 3U);
        return(FALSE);
    }

    /* If fault inject set global variable to flag to the ESM handler that it is a fault injection */
    if((DMA_ECC_TEST_MODE_1BIT_FAULT_INJECT == testType)||
        (DMA_ECC_TEST_MODE_2BIT_FAULT_INJECT == testType)){
        _sl_fault_injection=TRUE;
    }

    /* backup DATA stored at this location */
    dataVal = *dmaRead;

    /* Enable ECC */
    BF_SET(sl_dmaREG->DMAPCR, DMA_PARCTRL_ECC_EN, DMA_PARCTRL_ECC_EN_START, DMA_PARCTRL_ECC_EN_LENGTH);

    /* rewrite the data back to the DMA RAM, this will ensure that the ECC is
     * correctly computed for this location. */
    *dmaRead = dataVal;

    /* Enable ECC test mode */
    BIT_SET(sl_dmaREG->DMAPCR, DMA_ECC_TST_EN);

#if FUNCTION_PROFILING_ENABLED
    SL_Record_Errorcreationtick(testType);
#endif

#if FUNCTION_PROFILING_ENABLED
    SL_Record_Errorcreationtick(testType);
#endif

    switch(testType)
    {

