pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
    case DMA_ECC_TEST_MODE_1BIT:
    case DMA_ECC_TEST_MODE_1BIT_FAULT_INJECT:

        SL_FLAG_SET(testType);
        /*Backup grp1 esm interrupt enable register and clear the interrupt enable */
        regBkupIntEnaSet = sl_esmREG->IESR7;
        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        regBckupErrInfulence = sl_esmREG->IEPSR7;

        if((FALSE) == _sl_fault_injection){
            /* Disable ESM notification */
            sl_esmREG->IECR7 = GET_ESM_BIT_NUM(ESM_G1ERR_DMA_ECC_SBERR);
            sl_esmREG->IEPCR7 = GET_ESM_BIT_NUM(ESM_G1ERR_DMA_ECC_SBERR);
        }

        /* Enable generation of single bit event to the ESM (will set the ESM
         * Status flag upon detection of single bit error.) If ESM is enabled
         * (fault injection), will cause ESM interrupt to occur.  */
        BF_SET(sl_dmaREG->DMASECCCTRL, DMA_SBE_EVT_EN, DMA_SBE_EVT_START, DMA_SBE_EVT_LENGTH);
        /* Write clear any pending single bit error flag */
        BIT_SET(sl_dmaREG->DMASECCCTRL, DMA_ECC_SBERR);
        /* Read clear the error address offset */
        ramRead = sl_dmaREG->DMAECCSBE;

        /* Check syndrome */
        /* Flip bit 0 to introduce a single bit error */
        *dmaRead ^= DMA_FLIP_DATA_1BIT;
        /*BIT_FLIP(*dmaRead, DMA_FLIP_DATA_1BIT);*/

        /* Cause 1 bit ECC error */
        ramRead = *dmaRead;
        ram1erraddr = (uint32)(sl_dmaREG->DMAECCSBE | dmaRAMBaseAddr);

        if(DMA_ECC_TEST_MODE_1BIT == testType) {
            if((BIT(DMA_ECC_SBERR) == (sl_dmaREG->DMASECCCTRL & BIT(DMA_ECC_SBERR))) &&
                    (dmaBadECC == ram1erraddr) &&
                    (((sl_esmREG->SR7[0]) & GET_ESM_BIT_NUM(ESM_G1ERR_DMA_ECC_SBERR)) 
                     == GET_ESM_BIT_NUM(ESM_G1ERR_DMA_ECC_SBERR))) {
                /* Clear ESM error status */
                sl_esmREG->SR7[0] =  GET_ESM_BIT_NUM(ESM_G1ERR_DMA_ECC_SBERR);
                retVal = TRUE;
            } else {
                retVal = FALSE;
            }
        }  else {
            /*nothing to be done for fault injection */
            retVal = TRUE;
        }

        /* Clear flags and read error address */
        BIT_SET(sl_dmaREG->DMASECCCTRL, BIT(DMA_ECC_SBERR));

        /* Disable ECC */
        BF_SET(sl_dmaREG->DMAPCR, DMA_PARCTRL_ECC_DIS, DMA_PARCTRL_ECC_EN_START, DMA_PARCTRL_ECC_EN_LENGTH);

        /* Restore data. ECC should remain the same as before. */
        *dmaRead = dataVal;

        SL_FLAG_CLEAR(testType);

        /* Clear the TEST bit of Parity control register */
        BIT_SET(sl_dmaREG->DMAPCR, DMA_ECC_TST_EN);

        /* Restore DMA register states */
        sl_dmaREG->DMAPCR = regBackupPCR;
        sl_dmaREG->DMASECCCTRL = regBackupSECCTL;

        /* Restore ESM registers states */
        sl_esmREG->IESR7 = regBkupIntEnaSet;
        sl_esmREG->IEPSR7 = regBckupErrInfulence;

        break;

    case DMA_ECC_TEST_MODE_2BIT:
    case DMA_ECC_TEST_MODE_2BIT_FAULT_INJECT:
        regBkupIntEnaSet = sl_esmREG->IESR1;
        regBckupErrInfulence = sl_esmREG->EEPAPR1;

        if((FALSE) == _sl_fault_injection){
            /* Disable ESM notification */
            sl_esmREG->IECR1 = GET_ESM_BIT_NUM(ESM_G1ERR_DMA_ECC_UNCORR);
            sl_esmREG->DEPAPR1 = GET_ESM_BIT_NUM(ESM_G1ERR_DMA_ECC_UNCORR);
        }

        /* Clear previous ECC error */
        BIT_SET(sl_dmaREG->DMAPAR, DMA_ECC_ERR);

        /* Read clear the error address */
         ramRead= sl_dmaREG->DMAPAR;
         SL_FLAG_SET(testType);

        /* Introduce a double bit error */
        *dmaRead ^= DMA_FLIP_DATA_2BIT;
        /*BIT_FLIP(*dmaRead, DMA_FLIP_DATA_2BIT);*/

        ramRead = *dmaRead;
        ram1erraddr = (BF_GET(sl_dmaREG->DMAPAR, DMA_ECC_UNCORERR_ADDR_START, DMA_ECC_UNCORERR_ADDR_LEN)| dmaRAMBaseAddr);

        if(DMA_ECC_TEST_MODE_2BIT == testType) {
            if(((sl_dmaREG->DMAPAR & BIT(DMA_ECC_ERR)) == BIT(DMA_ECC_ERR)) &&
                (dmaBadECC == ram1erraddr)    &&
                (GET_ESM_BIT_NUM(ESM_G1ERR_DMA_ECC_UNCORR) == 
                 (sl_esmREG->SR1[0] & GET_ESM_BIT_NUM(ESM_G1ERR_DMA_ECC_UNCORR)))) {
                retVal = TRUE;
                /* Clear ESM error status */
                sl_esmREG->SR1[0] =  GET_ESM_BIT_NUM(ESM_G1ERR_DMA_ECC_UNCORR);
            } else {
                retVal = FALSE;
            }
        } else {
            retVal = TRUE;
        }

        /* Clear flags and read error address */
        BIT_SET(sl_dmaREG->DMAPAR, BIT(DMA_ECC_ERR));

        /* Disable ECC */
        BF_SET(sl_dmaREG->DMAPCR, DMA_PARCTRL_ECC_DIS, DMA_PARCTRL_ECC_EN_START, DMA_PARCTRL_ECC_EN_LENGTH);

        /* Restore data */
        *dmaRead = dataVal;

        SL_FLAG_CLEAR(testType);

        /* Disable ECC test mode */
        BIT_SET(sl_dmaREG->DMAPCR, DMA_ECC_TST_EN);

        /* Restore DMA register states */
        sl_dmaREG->DMAPCR = regBackupPCR;
        sl_dmaREG->DMASECCCTRL = regBackupSECCTL;
        /* Restore ESM registers states */
        sl_esmREG->IESR1 = regBkupIntEnaSet;
        sl_esmREG->EEPAPR1 = regBckupErrInfulence;
        break;

    default:
        retVal = FALSE;
        break;
    }

    /* If the test was fault injection and not self test, then do not mask the call back & clear the *
    *  FAULT_INJECTION flag for subsequent runs*/
    if((TRUE) == _sl_fault_injection){
            _sl_fault_injection=FALSE;
    }

    ramread64 = ramread64; /* Avoid compiler warning. */

#if(FUNC_RESULT_LOG_ENABLED == 1)
    SL_Log_Result(FUNC_ID_ST_DMA, testType, (SL_SelfTest_Result)retVal , 0u);
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Stop_Profiling(testType);
#endif
    return(retVal);
}

#define msgNo            2u
#define eccOffset        0x00001000u
#define dcan1RAMBase    (volatile uint32*)0xFF1E0000
#define dcan2RAMBase    (volatile uint32*)0xFF1C0000
#define dcan3RAMBase    (volatile uint32*)0xFF1A0000
#define dcan4RAMBase    (volatile uint32*)0xFF180000

/* ESM 2 bit registers  specific to each DCAN instance. */
#define dcan1uerrESMReg (volatile uint32*)&(sl_esmREG->SR1[0])
#define dcan1iesrESMReg (volatile uint32*)&(sl_esmREG->IESR1)
#define dcan1iecrESMReg (volatile uint32*)&(sl_esmREG->IECR1)
#define dcan1eepaprESMReg (volatile uint32*)&(sl_esmREG->EEPAPR1)
#define dcan1depaprESMReg (volatile uint32*)&(sl_esmREG->DEPAPR1)

#define dcan2uerrESMReg dcan1uerrESMReg
#define dcan2iesrESMReg dcan1iesrESMReg
#define dcan2iecrESMReg dcan1iecrESMReg
#define dcan2eepaprESMReg dcan1eepaprESMReg
#define dcan2depaprESMReg dcan1depaprESMReg

#define dcan3uerrESMReg dcan1uerrESMReg
#define dcan3iesrESMReg dcan1iesrESMReg
#define dcan3iecrESMReg dcan1iecrESMReg
#define dcan3eepaprESMReg dcan1eepaprESMReg
#define dcan3depaprESMReg dcan1depaprESMReg

#define dcan4uerrESMReg (volatile uint32*)&(sl_esmREG->SR4[0])
#define dcan4iesrESMReg (volatile uint32*)&(sl_esmREG->IESR4)
#define dcan4iecrESMReg (volatile uint32*)&(sl_esmREG->IECR4)
#define dcan4eepaprESMReg (volatile uint32*)&(sl_esmREG->IEPSR4)
#define dcan4depaprESMReg (volatile uint32*)&(sl_esmREG->IEPCR4)

boolean SL_SelfTest_CAN(SL_SelfTestType testType, SL_DCAN_Instance instance)
{
    volatile boolean _sl_fault_injection = FALSE;
    volatile uint32 ramRead;
    register uint32 ramread32, regBackupEccCS, regBackupCtl, regBckupErrInfulence, regBkupIntEnaSet;
    volatile uint32* data;
    boolean testPassed = FALSE;
    uint32           dataVal;

    sl_canBASE_t* sl_canREG;
    volatile uint32 *dcanRAMBase;
    uint32 esm1bitecc, esm2bitecc;
    volatile uint32* esm2bitStatReg;
    volatile uint32* esm2bitEEPAPR;
    volatile uint32* esm2bitDEPAPR; 
    volatile uint32* esm2bitIESR;   
    volatile uint32* esm2bitIECR;   

#if FUNCTION_PROFILING_ENABLED
    SL_Start_Profiling(testType);
#endif

