pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
    boolean retVal = FALSE;

#ifdef FUNCTION_PARAM_CHECK_ENABLED
    /* Verify that the parameters are in rage */
    if ((_SELFTEST_CAN_MIN > testType) || (_SELFTEST_CAN_MAX < testType)) {
        SL_Log_Error(FUNC_ID_ST_CAN, ERR_TYPE_PARAM, 0u);
        retVal =  FALSE;
        return(retVal);
    }

    if ((instance < DCAN_MIN) || (instance > DCAN_MAX)) {
        SL_Log_Error(FUNC_ID_ST_CAN, ERR_TYPE_PARAM, 0u);
        retVal =  FALSE;
        return(retVal);
    }

#endif

#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /*check for privileged mode*/
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_CAN, ERR_TYPE_ENTRY_CON, 0u);
        retVal =  FALSE;
        return(retVal);
    }
#endif
    switch(instance)
    {
        case SL_DCAN1:
            sl_canREG      = sl_canREG1;
            dcanRAMBase    = dcan1RAMBase;
            esm1bitecc     = ESM_G1ERR_CAN1_ECC_SBERR;
            esm2bitecc     = ESM_G1ERR_CAN1_ECC_UNCORR;
            esm2bitStatReg = dcan1uerrESMReg;
            esm2bitEEPAPR  = dcan1eepaprESMReg;
            esm2bitDEPAPR  = dcan1depaprESMReg;
            esm2bitIESR    = dcan1iesrESMReg;
            esm2bitIECR    = dcan1iecrESMReg;
            break;
        case SL_DCAN2:
            sl_canREG      = sl_canREG2;
            dcanRAMBase    = dcan2RAMBase;
            esm1bitecc     = ESM_G1ERR_CAN2_ECC_SBERR;
            esm2bitecc     = ESM_G1ERR_CAN2_ECC_UNCORR;
            esm2bitStatReg = dcan2uerrESMReg;
            esm2bitEEPAPR  = dcan2eepaprESMReg;
            esm2bitDEPAPR  = dcan2depaprESMReg;
            esm2bitIESR    = dcan2iesrESMReg;
            esm2bitIECR    = dcan2iecrESMReg;
            break;
        case SL_DCAN3:
            sl_canREG      = sl_canREG3;
            dcanRAMBase    = dcan3RAMBase;
            esm1bitecc     = ESM_G1ERR_CAN3_ECC_SBERR;
            esm2bitecc     = ESM_G1ERR_CAN3_ECC_UNCORR;
            esm2bitStatReg = dcan3uerrESMReg;
            esm2bitEEPAPR  = dcan3eepaprESMReg;
            esm2bitDEPAPR  = dcan3depaprESMReg;
            esm2bitIESR    = dcan3iesrESMReg;
            esm2bitIECR    = dcan3iecrESMReg;
            break;
        case SL_DCAN4:
            sl_canREG      = sl_canREG4;
            dcanRAMBase    = dcan4RAMBase;
            esm1bitecc     = ESM_G1ERR_CAN4_ECC_SBERR;
            esm2bitecc     = ESM_G1ERR_CAN4_ECC_UNCORR;
            esm2bitStatReg = dcan4uerrESMReg;
            esm2bitEEPAPR  = dcan4eepaprESMReg;
            esm2bitDEPAPR  = dcan4depaprESMReg;
            esm2bitIESR    = dcan4iesrESMReg;
            esm2bitIECR    = dcan4iecrESMReg;
            break;
    }

    if((CAN_SRAM_ECC_DISABLED) == 
            BF_GET(sl_canREG->CTL, CAN_CTRL_SECDED_START, CAN_CTRL_SECDED_LENGTH))
    {
        SL_Log_Error(FUNC_ID_ST_CAN, ERR_TYPE_ENTRY_CON, 1U);
        return(FALSE);
    }

    /* If nERROR is active then do not proceed with tests that trigger nERROR */
    if((TRUE) == SL_ESM_nERROR_Active())
    {
        SL_Log_Error(FUNC_ID_ST_CAN, ERR_TYPE_ENTRY_CON, 2U);
        return(FALSE);
    }

    /* If fault inject set global variable to flag to the ESM handler that it is a fault injection */
    if((CAN_ECC_TEST_MODE_1BIT_FAULT_INJECT == testType)||
        (CAN_ECC_TEST_MODE_2BIT_FAULT_INJECT == testType)){
        _sl_fault_injection = TRUE;
    }

    /* DCAN1/2/3 uncorrectable ECC is in SR1  */


    regBackupEccCS = sl_canREG->ECC_CS;
    regBackupCtl = sl_canREG->CTL;

    /* initialize data */
    data = (volatile uint32 *)((((uint32)dcanRAMBase) + (msgNo*0x20u)));
    /* Offset the pointer by 4 bytes as the memory map for the MESSAGE RAM
     * is different based on RDA or debug, and offsetting this by 4 points
     * to an unreserved location regardless of RDA or debug mode access of
     * message RAM */
    data++;

    /* disable SECDED - write to PMD in CANCTL */
    BF_SET(sl_canREG->CTL, CAN_CTRL_SECDED_DIS, CAN_CTRL_SECDED_START, CAN_CTRL_SECDED_LENGTH);

    /* set Test bit to enable Test Mode (required for selecting test mode - RDA) */
    BIT_SET(sl_canREG->CTL, BIT(CAN_CTRL_TEST_EN));

    /* set Init bit (enter software initialization mode) and avoid conflicts with Message Handler
     * This step is required before entering RDA mode */
    BIT_SET(sl_canREG->CTL, BIT(CAN_CTRL_INIT));

    /* enable Ram Direct Access (RDA) */
    BIT_SET(sl_canREG->TEST, BIT(CAN_TEST_RDA_EN));

    /* backup DATA stored at this location */
    dataVal = *data;

    /* enable SECDED diagnostic mode */
    BF_SET(sl_canREG->ECCDIAG, CAN_ECCDIAG_SECDED_EN, 0, 4);

#if FUNCTION_PROFILING_ENABLED
    SL_Record_Errorcreationtick(testType);
#endif

    switch(testType)
    {
    case CAN_ECC_TEST_MODE_1BIT:
    case CAN_ECC_TEST_MODE_1BIT_FAULT_INJECT:

        /*Backup grp1 esm interrupt enable register and clear the interrupt enable */
        regBkupIntEnaSet = sl_esmREG->IESR7;

        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        regBckupErrInfulence = sl_esmREG->IEPSR7;

        if((FALSE) == _sl_fault_injection) {
            sl_esmREG->IECR7 = GET_ESM_BIT_NUM(esm1bitecc);
            sl_esmREG->IEPCR7 = GET_ESM_BIT_NUM(esm1bitecc);
        } 

        /* enable ECC single bit error event */
        BF_SET(sl_canREG->ECC_CS , CAN_ECC_CS_SBE_EVT_EN, CAN_ECC_CS_SBE_EVT_START, CAN_ECC_CS_SBE_EVT_LENGTH);
        /* corrupt the data */
        *data ^= CAN_FLIP_DATA_1BIT;

        /* enable SECDED */
        BF_SET(sl_canREG->CTL, CAN_CTRL_SECDED_EN, CAN_CTRL_SECDED_START, CAN_CTRL_SECDED_LENGTH);

        /* set the SL Test flag as close as possible to the creation of error.
         * This minimizes the chance of a race condition in the reading of the
         * test flag incorrectly. */
        SL_FLAG_SET(testType);
        
        /* create fault */
        ramread32 = *data;

        if(CAN_ECC_TEST_MODE_1BIT == testType) {
            /* Correctable ESM event for all DCAN instances is registered in ESM
             * status SR7[0]  */
            if(GET_ESM_BIT_NUM(esm1bitecc) == 
                    (sl_esmREG->SR7[0] & GET_ESM_BIT_NUM(esm1bitecc))) {
                testPassed = TRUE;
                /* clear ESM error status */
                sl_esmREG->SR7[0] = GET_ESM_BIT_NUM(esm1bitecc);
            }

            if(testPassed && 
                ((sl_canREG->ECC_CS & BIT(CAN_ECC_SBERR)) == BIT(CAN_ECC_SBERR)) && 
                ((sl_canREG->ECCDIAG_STAT & BIT(CAN_ECC_SBERR)) == BIT(CAN_ECC_SBERR)) &&
                (msgNo == (sl_canREG->ECC_SBEC & CAN_ECC_SERR_MSG_NO))) {
                if(CAN_ECC_CS_ECC_MODE_DIS == 
                        BF_GET(sl_canREG->ECC_CS, CAN_ECC_CS_ECC_MODE_START, CAN_ECC_CS_ECC_MODE_LENGTH)) {
                    if((sl_canREG->ES & BIT(CAN_ECC_ES_PER)) == BIT(CAN_ECC_ES_PER)) {
                        ramRead = sl_canREG->ES;
                        retVal = TRUE;
                    } else {
                        retVal = FALSE;
                    }
                } else {
                    retVal = TRUE;
                }


            } else {
                retVal = FALSE;
            }
        }
        else {
            /* fault injected */
            retVal = TRUE;
        }


