pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
        /* clear the single bit error status */
        /*BIT_SET(sl_canREG->ECC_CS, BIT(CAN_ECC_SBERR));*/
        /*BIT_SET(sl_canREG->ECCDIAG_STAT, BIT(CAN_ECC_SBERR));*/
        sl_canREG->ECC_CS = BIT(CAN_ECC_SBERR);
        sl_canREG->ECCDIAG_STAT = BIT(CAN_ECC_SBERR);

        /* disable SECDED - write to PMD in CANCTL */
        BF_SET(sl_canREG->CTL, CAN_CTRL_SECDED_DIS, CAN_CTRL_SECDED_START, CAN_CTRL_SECDED_LENGTH);
        /* Restore data; in other cases data should be auto corrected. */
        *data = dataVal;
        /* enable SECDED */
        BF_SET(sl_canREG->CTL, CAN_CTRL_SECDED_EN, CAN_CTRL_SECDED_START, CAN_CTRL_SECDED_LENGTH);


        /* disable diagnostic mode */
        BF_SET(sl_canREG->ECCDIAG, CAN_ECCDIAG_SECDED_DIS, 0, 4);
        /* Disable Ram Direct Access (RDA) */
        BIT_CLEAR(sl_canREG->TEST, BIT(CAN_TEST_RDA_EN));

        /* Restore CAN registers states */
        sl_canREG->CTL = regBackupCtl;
        sl_canREG->ECC_CS = regBackupEccCS;

        /* Restore grp1 esm interrupt enable */
        sl_esmREG->IESR7 = regBkupIntEnaSet;
        sl_esmREG->IEPSR7 = regBckupErrInfulence;

        break;

    case CAN_ECC_TEST_MODE_2BIT:
    case CAN_ECC_TEST_MODE_2BIT_FAULT_INJECT:

        /*Backup grp1 esm interrupt enable register and clear the interrupt enable */
        regBkupIntEnaSet = *esm2bitIESR;

        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        regBckupErrInfulence = *esm2bitEEPAPR;

        if((FALSE) == _sl_fault_injection) {
            *esm2bitIECR    = GET_ESM_BIT_NUM(esm2bitecc);
            *esm2bitDEPAPR = GET_ESM_BIT_NUM(esm2bitecc);
        }

        /* doubt - corrupt the data/ecc */
        *data ^= CAN_FLIP_DATA_2BIT;

        /* enable SECDED */
        BF_SET(sl_canREG->CTL, CAN_CTRL_SECDED_EN, CAN_CTRL_SECDED_START, CAN_CTRL_SECDED_LENGTH);

        /* set the SL Test flag as close as possible to the creation of error.
         * This minimizes the chance of a race condition in the reading of the
         * test flag incorrectly. */
        SL_FLAG_SET(testType);
        ramread32 = *data;

        if(CAN_ECC_TEST_MODE_2BIT == testType) {
            if(GET_ESM_BIT_NUM(esm2bitecc) == 
                    ((*esm2bitStatReg) & GET_ESM_BIT_NUM(esm2bitecc))) {
                testPassed = TRUE;
                /* clear ESM error status */
                *esm2bitStatReg = GET_ESM_BIT_NUM(esm2bitecc);
            }

            if(testPassed  && 
                    ((sl_canREG->ECC_CS & BIT(CAN_ECC_UNCORR_ERR)) == BIT(CAN_ECC_UNCORR_ERR)) &&
                    ((sl_canREG->ECCDIAG_STAT & BIT(CAN_ECC_UNCORR_ERR)) == BIT(CAN_ECC_UNCORR_ERR)) &&
                    ((sl_canREG->ES & BIT(CAN_ECC_UNCORR_ERR)) == BIT(CAN_ECC_UNCORR_ERR))) {
                retVal = TRUE;
            } else {
                retVal = FALSE;
            }
        }
        else {
            /* fault injected */
            retVal = TRUE;
        }
        /* disable SECDED - write to PMD in CANCTL */
        BF_SET(sl_canREG->CTL, CAN_CTRL_SECDED_DIS, CAN_CTRL_SECDED_START, CAN_CTRL_SECDED_LENGTH);
        /* Restore data */
        *data = dataVal;
        /* enable SECDED */
        BF_SET(sl_canREG->CTL, CAN_CTRL_SECDED_EN, CAN_CTRL_SECDED_START, CAN_CTRL_SECDED_LENGTH);

        /* clear the double bit error status */
        /*BIT_SET(sl_canREG1->ECC_CS, BIT(CAN_ECC_UNCORR_ERR));*/
        /*BIT_SET(sl_canREG1->ECCDIAG_STAT, BIT(CAN_ECC_UNCORR_ERR));*/
        sl_canREG->ECC_CS = BIT(CAN_ECC_UNCORR_ERR);
        sl_canREG->ECCDIAG_STAT = BIT(CAN_ECC_UNCORR_ERR);

        /* disable diagnostic mode */
        BF_SET(sl_canREG->ECCDIAG, CAN_ECCDIAG_SECDED_DIS, 0, 4);
        /* Disable Ram Direct Access (RDA) */
        BIT_CLEAR(sl_canREG->TEST, BIT(CAN_TEST_RDA_EN));

        /* Restore CAN registers states */
        sl_canREG->ECC_CS = regBackupEccCS;
        sl_canREG->CTL = regBackupCtl;

        /* Restore grp1 esm interrupt enable */
        *esm2bitIESR = regBkupIntEnaSet;
        *esm2bitEEPAPR = regBckupErrInfulence;
        break;

    default:
        retVal = FALSE;
        break;
    }
    SL_FLAG_CLEAR(testType);

    /* If the test was fault injection and not self test, then do not mask the call back & clear the *
    *  FAULT_INJECTION flag for subsequent runs*/
    if((TRUE) == _sl_fault_injection){
        _sl_fault_injection = FALSE;
    }
    ramread32 = ramread32; /* Avoid compiler warning. */

#if(FUNC_RESULT_LOG_ENABLED == 1)
    SL_Log_Result(FUNC_ID_ST_CAN, testType, (SL_SelfTest_Result)retVal , 0u);
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Stop_Profiling(testType);
#endif
    return(retVal);
}

#define mibspi1uerrESMReg (volatile uint32*)&(sl_esmREG->SR1[0])
#define mibspi1iesrESMReg (volatile uint32*)&(sl_esmREG->IESR1)
#define mibspi1iecrESMReg (volatile uint32*)&(sl_esmREG->IECR1)
#define mibspi1eepaprESMReg (volatile uint32*)&(sl_esmREG->EEPAPR1)
#define mibspi1depaprESMReg (volatile uint32*)&(sl_esmREG->DEPAPR1)

#define mibspi2uerrESMReg (volatile uint32*)&(sl_esmREG->SR4[0])
#define mibspi2iesrESMReg (volatile uint32*)&(sl_esmREG->IESR4)
#define mibspi2iecrESMReg (volatile uint32*)&(sl_esmREG->IECR4)
#define mibspi2eepaprESMReg (volatile uint32*)&(sl_esmREG->IEPSR4)
#define mibspi2depaprESMReg (volatile uint32*)&(sl_esmREG->IEPCR4)

#define mibspi3uerrESMReg (volatile uint32*)&(sl_esmREG->SR1[0])
#define mibspi3iesrESMReg (volatile uint32*)&(sl_esmREG->IESR1)
#define mibspi3iecrESMReg (volatile uint32*)&(sl_esmREG->IECR1)
#define mibspi3eepaprESMReg (volatile uint32*)&(sl_esmREG->EEPAPR1)
#define mibspi3depaprESMReg (volatile uint32*)&(sl_esmREG->DEPAPR1)

#define mibspi4uerrESMReg (volatile uint32*)&(sl_esmREG->SR4[0])
#define mibspi4iesrESMReg (volatile uint32*)&(sl_esmREG->IESR4)
#define mibspi4iecrESMReg (volatile uint32*)&(sl_esmREG->IECR4)
#define mibspi4eepaprESMReg (volatile uint32*)&(sl_esmREG->IEPSR4)
#define mibspi4depaprESMReg (volatile uint32*)&(sl_esmREG->IEPCR4)

#define mibspi5uerrESMReg (volatile uint32*)&(sl_esmREG->SR1[0])
#define mibspi5iesrESMReg (volatile uint32*)&(sl_esmREG->IESR1)
#define mibspi5iecrESMReg (volatile uint32*)&(sl_esmREG->IECR1)
#define mibspi5eepaprESMReg (volatile uint32*)&(sl_esmREG->EEPAPR1)
#define mibspi5depaprESMReg (volatile uint32*)&(sl_esmREG->DEPAPR1)
boolean SL_SelfTest_MibSPI(SL_SelfTestType testType, SL_MIBSPI_Instance instance)
{
    boolean testPassed = FALSE;
    volatile boolean _sl_fault_injection = FALSE;
    volatile uint32 ramRead;
    register uint32 ramread32, regBackupEccCtl, regBckupErrInfulence, regBkupIntEnaSet, regBackuMIBSPIE;
    volatile uint32* data;
    uint32           dataVal;
    uint32 offset;

    sl_mibspiBASE_t* sl_mibspiREG;
    volatile uint32 *sl_mibspiRAM;
    uint32 esm1bitecc, esm2bitecc;
    volatile uint32* esm2bitStatReg;
    volatile uint32* esm2bitEEPAPR;
    volatile uint32* esm2bitDEPAPR; 
    volatile uint32* esm2bitIESR;   
    volatile uint32* esm2bitIECR;   


#if FUNCTION_PROFILING_ENABLED
    SL_Start_Profiling(testType);
#endif

