pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
    boolean retVal = FALSE;

#ifdef FUNC_ENTRY_COND_CHECK_ENABLED
    /*check for privileged mode*/
    if (ARM_MODE_USR == _SL_Get_ARM_Mode()) {
        SL_Log_Error(FUNC_ID_ST_SPI, ERR_TYPE_ENTRY_CON, 0u);
        retVal =  FALSE;
        return(retVal);
    }
#endif

    /* If nERROR is active then do not proceed with tests that trigger nERROR */
    if((TRUE) == SL_ESM_nERROR_Active())
    {
        SL_Log_Error(FUNC_ID_ST_SPI, ERR_TYPE_ENTRY_CON, 3U);
        return(FALSE);
    }

    /* If fault inject set global variable to flag to the ESM handler that it is a fault injection */
    if((MIBSPI_ECC_TEST_MODE_1BIT_FAULT_INJECT == testType)||
        (MIBSPI_ECC_TEST_MODE_2BIT_FAULT_INJECT == testType)){
        _sl_fault_injection=TRUE;
    }

    switch(instance)
    {
        case SL_MIBSPI1:
            sl_mibspiREG = sl_mibspiREG1;
            sl_mibspiRAM = (volatile uint32*)sl_mibspiRAM1;
            esm1bitecc     = ESM_G1ERR_SPI1_ECC_SBERR;
            esm2bitecc     = ESM_G1ERR_SPI1_ECC_UNCORR;
            esm2bitStatReg = mibspi1uerrESMReg;
            esm2bitEEPAPR  = mibspi1eepaprESMReg;
            esm2bitDEPAPR  = mibspi1depaprESMReg;
            esm2bitIESR    = mibspi1iesrESMReg;
            esm2bitIECR    = mibspi1iecrESMReg;

            break;
        case SL_MIBSPI2:
            sl_mibspiREG = sl_mibspiREG2;
            sl_mibspiRAM = (volatile uint32*)sl_mibspiRAM2;
            esm1bitecc     = ESM_G1ERR_SPI2_ECC_SBERR;
            esm2bitecc     = ESM_G1ERR_SPI2_ECC_UNCORR;
            esm2bitStatReg = mibspi2uerrESMReg;
            esm2bitEEPAPR  = mibspi2eepaprESMReg;
            esm2bitDEPAPR  = mibspi2depaprESMReg;
            esm2bitIESR    = mibspi2iesrESMReg;
            esm2bitIECR    = mibspi2iecrESMReg;

            break;
        case SL_MIBSPI3:
            sl_mibspiREG = sl_mibspiREG3;
            sl_mibspiRAM = (volatile uint32*)sl_mibspiRAM3;
            esm1bitecc     = ESM_G1ERR_SPI3_ECC_SBERR;
            esm2bitecc     = ESM_G1ERR_SPI3_ECC_UNCORR;
            esm2bitStatReg = mibspi3uerrESMReg;
            esm2bitEEPAPR  = mibspi3eepaprESMReg;
            esm2bitDEPAPR  = mibspi3depaprESMReg;
            esm2bitIESR    = mibspi3iesrESMReg;
            esm2bitIECR    = mibspi3iecrESMReg;
            break;
        case SL_MIBSPI4:
            sl_mibspiREG = sl_mibspiREG4;
            sl_mibspiRAM = (volatile uint32*)sl_mibspiRAM4;
            esm1bitecc     = ESM_G1ERR_SPI4_ECC_SBERR;
            esm2bitecc     = ESM_G1ERR_SPI4_ECC_UNCORR;
            esm2bitStatReg = mibspi4uerrESMReg;
            esm2bitEEPAPR  = mibspi4eepaprESMReg;
            esm2bitDEPAPR  = mibspi4depaprESMReg;
            esm2bitIESR    = mibspi4iesrESMReg;
            esm2bitIECR    = mibspi4iecrESMReg;
            break;
        case SL_MIBSPI5:
            sl_mibspiREG = sl_mibspiREG5;
            sl_mibspiRAM = (volatile uint32*)sl_mibspiRAM5;
            esm1bitecc     = ESM_G1ERR_SPI5_ECC_SBERR;
            esm2bitecc     = ESM_G1ERR_SPI5_ECC_UNCORR;
            esm2bitStatReg = mibspi5uerrESMReg;
            esm2bitEEPAPR  = mibspi5eepaprESMReg;
            esm2bitDEPAPR  = mibspi5depaprESMReg;
            esm2bitIESR    = mibspi5iesrESMReg;
            esm2bitIECR    = mibspi5iecrESMReg;
            break;
    }

    if(BF_GET(sl_mibspiREG->MIBSPIE, SPI_MIBSPIE_EX_BUF_START, SPI_MIBSPIE_EX_BUF_LENGTH) == SPI_MIBSPIE_EX_BUF_DIS) {
        offset = DEFAULT;
    } else {
        offset = EXTENDED;
    }

    /* backUp registers */
    regBackupEccCtl = sl_mibspiREG->PAR_ECC_CTRL;
    regBackuMIBSPIE = sl_mibspiREG->MIBSPIE;

    /* enable ECC memory test */
    BIT_SET(sl_mibspiREG->PAR_ECC_CTRL, SPI_ECC_MEMTST_EN);

    /* enable RXRAM access */
    BIT_SET(sl_mibspiREG->MIBSPIE, SPI_MIBSPI_RXRAM_ACCESS);

    /* enable ECC diagnostic mode */
    BF_SET(sl_mibspiREG->ECC_DIAG_CTRL, SPI_DIAG_CTRL_ECC_EN, SPI_DIAG_CTRL_ECC_START, SPI_DIAG_CTRL_ECC_LENGTH);

    /* initialize data */
    data = (volatile uint32 *)((uint32)sl_mibspiRAM + offset + 4);

    /* backUp the data */
    dataVal = (uint32)(*data);

#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif

#if FUNCTION_PROFILING_ENABLED
        SL_Record_Errorcreationtick(testType);
#endif

    switch(testType)
    {
    case MIBSPI_ECC_TEST_MODE_1BIT:
    case MIBSPI_ECC_TEST_MODE_1BIT_FAULT_INJECT:

        /*Backup grp1 esm interrupt enable register and clear the interrupt enable */
        regBkupIntEnaSet = sl_esmREG->IESR7;

        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        regBckupErrInfulence = sl_esmREG->IEPSR7;

        if((FALSE) == _sl_fault_injection) {
            sl_esmREG->IECR7 = GET_ESM_BIT_NUM(esm1bitecc);
            sl_esmREG->IEPCR7 = GET_ESM_BIT_NUM(esm1bitecc);
        } 

        SL_FLAG_SET(testType);
        /* enable single bit error event */
        BF_SET(sl_mibspiREG->PAR_ECC_CTRL, SPI_PAR_ECC_CTRL_SBE_EVT_EN, SPI_PAR_ECC_CTRL_SBE_EVT_START, SPI_PAR_ECC_CTRL_SBE_EVT_LENGTH);

        /* corrupt the data */
        BIT_FLIP(*data, SPI_FLIP_DATA_1BIT);

        /* enable SECDED */
        BF_SET(sl_mibspiREG->PAR_ECC_CTRL, SPI_PAR_CTRL_ECC_EN, SPI_PAR_CTRL_ECC_START, SPI_PAR_CTRL_ECC_LENGTH);

        ramread32 = *data;

        if(MIBSPI_ECC_TEST_MODE_1BIT == testType) {
            if(GET_ESM_BIT_NUM(esm1bitecc) == 
                    (sl_esmREG->SR7[0] & GET_ESM_BIT_NUM(esm1bitecc))) {
                testPassed = TRUE;
                /* clear ESM error status */
                sl_esmREG->SR7[0] = GET_ESM_BIT_NUM(esm1bitecc);
            }

            
            if((testPassed == TRUE) && 
                    ((sl_mibspiREG->PAR_ECC_STAT & BIT(SPI_PAR_ECC_STAT_SBEFLGRX)) == BIT(SPI_PAR_ECC_STAT_SBEFLGRX)) &&
                    ((sl_mibspiREG->ECC_DIAG_STAT & BIT(SPI_ECCDIAG_STAT_SBEFLGRX)) == BIT(SPI_ECCDIAG_STAT_SBEFLGRX)) &&
                    ((offset + 4) == (uint32)BF_GET(sl_mibspiREG->SBERR_ADDRRX, SPI_SBERR_ADDRRX_START, SPI_SBERR_ADDRRX_LENGTH))){


                retVal = TRUE;

            } else {
                retVal = FALSE;
            }
        }
        else {
            /* Fault injected */
            retVal = TRUE;
        }

