pradeepa-s/tms570ls12x_safeti/code_composer_studio/safeti_test/safety_library/source/sl_selftest.c
        /* clear the single bit error status */
        sl_mibspiREG->PAR_ECC_STAT = BIT(SPI_PAR_ECC_STAT_SBEFLGRX);
        sl_mibspiREG->ECC_DIAG_STAT = BIT(SPI_ECCDIAG_STAT_SBEFLGRX);
        /* Restore data */
        *data = dataVal;

        /* disable diagnostic mode */
        BF_SET(sl_mibspiREG->ECC_DIAG_CTRL, SPI_DIAG_CTRL_ECC_DIS, SPI_DIAG_CTRL_ECC_START, SPI_DIAG_CTRL_ECC_LENGTH);

        /* Restore SPI registers states */
        sl_mibspiREG->PAR_ECC_CTRL = regBackupEccCtl;
        sl_mibspiREG->MIBSPIE = regBackuMIBSPIE;

        /* Restore grp1 esm interrupt enable */
        sl_esmREG->IESR7 = regBkupIntEnaSet;
        sl_esmREG->IEPSR7 = regBckupErrInfulence;

        break;

    case MIBSPI_ECC_TEST_MODE_2BIT:
    case MIBSPI_ECC_TEST_MODE_2BIT_FAULT_INJECT:

        /*Backup grp1 esm interrupt enable register and clear the interrupt enable */
        regBkupIntEnaSet = *esm2bitIESR;

        /*SAFETYMCUSW 134 S MR: 12.2 <APPROVED> Comment_5*/
        regBckupErrInfulence = *esm2bitEEPAPR;

        if((FALSE) == _sl_fault_injection) {
            *esm2bitIECR = GET_ESM_BIT_NUM(esm2bitecc);
            *esm2bitDEPAPR = GET_ESM_BIT_NUM(esm2bitecc);
        } 

        SL_FLAG_SET(testType);

        /* corrupt the data */
        *data ^= SPI_FLIP_DATA_2BIT;

        /* enable SECDED */
        BF_SET(sl_mibspiREG->PAR_ECC_CTRL, SPI_PAR_CTRL_ECC_EN, SPI_PAR_CTRL_ECC_START, SPI_PAR_CTRL_ECC_LENGTH);

        ramread32 = *data;

        if(MIBSPI_ECC_TEST_MODE_2BIT == testType) {
            if(GET_ESM_BIT_NUM(esm2bitecc) == 
                    (*esm2bitStatReg & GET_ESM_BIT_NUM(esm2bitecc))) {
                        testPassed = TRUE;
                        /* clear ESM error status */
                        *esm2bitStatReg = GET_ESM_BIT_NUM(esm2bitecc);
            }

            
            if((testPassed == TRUE) && 
                    ((sl_mibspiREG->PAR_ECC_STAT & BIT(SPI_PAR_ECC_STAT_UERRFLGRX)) == BIT(SPI_PAR_ECC_STAT_UERRFLGRX)) &&
                    ((sl_mibspiREG->ECC_DIAG_STAT & BIT(SPI_ECCDIAG_STAT_DEFLGRX)) == BIT(SPI_ECCDIAG_STAT_DEFLGRX)) &&
                    ((offset + 4) == (uint32)BF_GET(sl_mibspiREG->UERRADDRRX, SPI_UERR_ADDRRX_START, SPI_UERR_ADDRRX_LENGTH))) {


                retVal = TRUE;
            } else {
                retVal = FALSE;
            }
        }
        else {
            /* Fault injected */
            retVal = TRUE;
        }

        /* clear the single bit error status */
        sl_mibspiREG->PAR_ECC_STAT = BIT(SPI_PAR_ECC_STAT_UERRFLGRX);
        sl_mibspiREG->ECC_DIAG_STAT = BIT(SPI_PAR_ECC_STAT_UERRFLGRX);

        /* Restore data */
        *data = dataVal;

        /* disable diagnostic mode */
        BF_SET(sl_mibspiREG->ECC_DIAG_CTRL, SPI_DIAG_CTRL_ECC_DIS, SPI_DIAG_CTRL_ECC_START, SPI_DIAG_CTRL_ECC_LENGTH);

        /* Restore SPI registers states */
        sl_mibspiREG->PAR_ECC_CTRL = regBackupEccCtl;
        sl_mibspiREG->MIBSPIE = regBackuMIBSPIE;

        /* restore grp1 ESM interrupt enable */
        *esm2bitIESR = regBkupIntEnaSet;
        *esm2bitEEPAPR = regBckupErrInfulence;

        break;

    default:
        retVal = FALSE;
        break;
    }

    /* If the test was fault injection and not self test, then do not mask the call back & clear the *
    *  FAULT_INJECTION flag for subsequent runs*/
    if((TRUE) == _sl_fault_injection){
            _sl_fault_injection=FALSE;
    }
    SL_FLAG_CLEAR(testType);

    ramread32 = ramread32; /* Avoid compiler warning. */

    #if(FUNC_RESULT_LOG_ENABLED == 1)
    SL_Log_Result(FUNC_ID_ST_SPI, testType, (SL_SelfTest_Result)retVal , 0u);
#endif
#if FUNCTION_PROFILING_ENABLED
    SL_Stop_Profiling(testType);
#endif
    return(retVal);
}

#endif

/*Comment_1:
 *  "Reason - used for creation of 16 byte aligned sram data array"*/

/*Comment_2:
 *  "Reason -  used for creation of aligned data section for sramEccTestBuff"*/

/*Comment_3:
 *  "Reviewed - The entry condition and parameter checks shall exit immediately"*/

/*Comment_4:
 *  "Reason -  This is an advisory by MISRA.Verified validity of operation by review"*/

/*Comment_5:
 * "Reason -  FALSE_POSITIVE The rule requires that the expression should be
 * guaranteed to have the same value regardless of the order in which the operands within the expression are evaluated.
 * This usually means no more than one volatile access occuring in the expression.The recommendation that simple
 * assignments should be used is intended to be restricted to simple assignments of the form x = v and not
 * "simple assignments" according to the ISO definition. However, the recommendation does not have to be followed
 * in order to be compliant with the rule. You should implement the rule (the value should be independent of the
 * evaluation order) for compliance purposes and you might choose to issue a warning for non-simple assignments
 * or you might choose to ignore them."*/

/*Comment_6:
 *  "Reason -  This can never be NULL as addresss points to an array"*/

/*Comment_7:
 *  "Reason -  This can never be NULL"*/

/*Comment_8:
 * "Address of volatile variable used, not the variable itself"*/

/*Comment_9:
 * "Address of volatile variable used, not the variable itself"*/

/*Comment_10:
 * "Assignment in an expression is valid here"*/

/*Comment_11:
 * "Needed to generate error"*/

/*Comment_12:
 * "Address of volatile variable accessed, not the variable itself"*/

/*Comment_13:
 * "Reason - Design change necessary to remove the infinite while loop"*/

/*Comment_14:
 * "Reason -  CHECK_RANGE_RAM_PTR is used to check the valid range"*/

/*Comment_15:
 * "This function will be called by application so not static" */

/*Comment_16:
 * "Reason -  Needed for the test"*/

/*Comment_17:
 * "changes may be made in the usage of the testType" */

/*Comment_18:
 * "The base address of the peripheral registers are actually macros" */

/*Comment_19:
 * "Reason - FALSE POSITIVE _SELFTEST_PBIST_MIN and testType are object pointers of same type*/

/*Comment_20:
 * "Reason -  This is an advisory by MISRA.Verified validity of operation by review"*/

/*Comment_21:
 * "The base address of the peripheral registers are actually macros"*/

/*Comment_22:
 * "Name declared in another C name space is deviated"*/

/*Comment_23:
 * "changes may be made in the usage of the config"*/

/*Comment_24:
 * "Overall design change needed" */

/*Comment_25:
 * "False positive" */
